"[{\"question\": \"It's not a beginner's course for me, but it is really good. I'm not gonna lie and say I understood the logic in some exercices (knowing why, step by step, is a must for beginners in my opinion) but it's a good course.\", \"answers\": [\"Have faith @diaslipe! There are things that will be more understandable if you won't leave this path!\", \"@diaslipe I completely understand how you are feeling. It's not a beginner's course in any way. I consider it as a good refresher.\\nWhy don't you try out this course and then take up the Kaggle Course\\nhttps://youtube.com/playlist?list=PLEsfXFp6DpzQjDBvhNy5YbaBx9j-ZsUe6\"]}, {\"question\": \"Hi everyone, count=0\\nIn the loops and list comprehension exercise (menu is boring question) can you please explain what's wrong with the code?\\ndef menu_is_boring(meals):\\ncount=0\\nfor i in meals:\\ncount = meals.count(i)\\nif count>1:\\nreturn True\\nreturn False\", \"answers\": [\"Hi @muskanjha ,\\nLooks like you haven't indented the code properly and your code checks if the same meal is served for more than two days in a week but nor consecutive days.\\nHere is my logic that is indented properly(there are four space gaps before the if condition in the for loop and the return True is in the for loop and return False is outside because we are returning false only if the if condition fails)\\nComing to the logic I am just checking whether the element at a particular index starting from 0th index has the same value in the next index or not. Its pretty straight forward\\ud83d\\ude42\\nHope this helps!\\nTag me in this thread if you have further queries.\\ndef menu_is_boring(meals):\\n    \\\"\\\"\\\"Given a list of meals served over some period of time, return True if the\\n    same meal has ever been served two days in a row, and False otherwise.\\n    \\\"\\\"\\\"\\n    for i in range(len(meals)-1):\\n        if meals[i] == meals[i+1]:\\n            return True\\n    return False\", \"@vedanthbaliga I checked the code again on PyCharm and its working. I don't know why I got an error here.\\nThank you so much for your help :)\"]}, {\"question\": \"In the exercise of List Question 5 (Fashionably late one), I'm getting a wrong output\\ndef fashionably_late(arrivals, name):\\nreturn arrivals.index(name) >= len(arrivals) / 2 and arrivals.index(name) != arrivals[-1]\\nCan someone please explain what's wrong with this?\", \"answers\": [\"Hi @muskanjha, your logic is correct, but the problem is that you are comparing \\\"arrivals.index(name) != arrivals[-1]\\\". The code \\\"arrivals.index(name)\\\" returns an integer (index of \\\"name\\\") and \\\"arrivals[-1]\\\" returns a string (\\\"name\\\" of the last arrival). Try to change your code to \\\"name != arrivals[-1]\\\".\", \"Understood. Thanks a lot @brunotly.\"]}, {\"question\": \"Hi everyone,\\nCan someone please explain how the length of the list d = [1, 2, 3][1:] is 2?\", \"answers\": [\"@muskanjha we are starting from the first index no which is 2 and traversing to the end of the array which has 3 indices. Hence in this slice we are getting 2 and 3. So the length of the array is 2.\", \"Thanks a lot @vedanthbaliga\", \"You are welcome @muskanjha . Glad it helped you!\"]}, {\"question\": \"Is anyone else having trouble with the Python course checks, hints, and solutions? I often just get a black page of confusing error messages when I try to run them. Also, for me, the simulation for the blackjack game does not run at all.\", \"answers\": [\"@jgscott3 make sure that you run the first code block of the notebook.\"]}, {\"question\": \"It is a very good course for beginners.\", \"answers\": []}, {\"question\": \"What would be the best way to search this forum?\\nI want to see what other people's solutions/ problems are. The current searchbar searche the entire kaggle site.\", \"answers\": []}, {\"question\": \"Hi everyone,\\nAbout the last exercise of the last module (the Blackjack one), I got a weird answer.\\nFor example, blackjack_hand_greater_than(['J', 'A', 'A', '2'],['9', '6', 'K', 'A', '5', 'J']) returns True.\\nI don't really understand the output (and the purpose) of the first hand because ['J', 'A', 'A', '2'] has a sum equal to 24. According to the rules, the value of the first ace equals to 11 so that \\\"J\\\" and \\\"A\\\" has a sum equal to 21. The second ace equals to 1 and \\\"2\\\" to 2.\\nYet the solution returns a sum of 14.\\nIs it normal ?\\nThanks !\", \"answers\": [\"I think that the first Ace is 11 only if that doesn't make the overall total > 21.\", \"You can think this way\\u2026 firstly consider aces as 11, then the rule is that if you pass 21 you can turn every ace to 1 until get 21 points or less. Note that the number of aces that will fall to 1 is just enough to get 21 points or less.\\nAppliyng in your example\\u2026\\n10 + 11 + 11 + 2 = 34\\nThe sum passes 21. Turn an ace to 1\\u2026\\n10 + 11 + 1 + 2 = 24\\nThe sum still passes 21. Turn another ace to 1\\u2026\\n10 + 1 + 1 + 2 = 14\\nI think the function returns True because the second hand exeeds 21 points and it loses.\", \"Thanks for your replies, r2d1 and Bruno Ferreira !\\nAbout the sum 10 + 11 + 1 + 2 = 24, that's what I did in my code. However, the sum 10 + 1 + 1 + 2 = 14 is the output of the solution.\\nMy purpose was about counting an ace as 1 when it's drawn and when the sum between it (as 11) and the total exceeds 21. From this fact, I transform the ace from 11 to 1 and the hand (for the sum J + A + A + 2) would be equal to 24.\\nMy code works as if the player was drawing the cards in live whereas the solution calculates the hand at the end, so I think the solution counts every ace as 1 when the total exceeds 21 \\u2026\", \"Hi @rachidkarbiche, about your point in \\\"the solution counts every ace as 1 when the total exceeds 21\\\", actually the count is \\\"every ace as 11 unless the sum exceeds 21\\\". For example\\u2026\\n2 + A + A + 2\\n2 + 11 + 11 + 2 = 26\\nTurn an ace to 1\\u2026\\n2 + 11 + 1 + 2 = 16\\nThe result will be 16, because you don't need to turn another ace to 1. Considering an ace as 11 and another as 1 the sum didn't exceeds 21.\"]}, {\"question\": \"This course helps me to learn logical concepts.\", \"answers\": []}, {\"question\": \"This is a very useful course of Python. Before, I had taken some courses online or by videos on Youtube, however I did not understand some important features of Python. This course taught me how to comprehend and deal with these gaps and now I feel more confident with my understanding of Python programming.\", \"answers\": []}, {\"question\": \"It's very helpful for me. I learn much more.\", \"answers\": []}, {\"question\": \"This very helpful course for clear concepts.\", \"answers\": []}, {\"question\": \"Q4 in Loops and List comprehensions:\\ndef estimate_average_slot_payout(n_runs):\\n    \\\"\\\"\\\"Run the slot machine n_runs times and return the average net profit per run.\\n    Example calls (note that return value is nondeterministic!):\\n    >>> estimate_average_slot_payout(1)\\n    -1\\n    >>> estimate_average_slot_payout(1)\\n    0.5\\n    \\\"\\\"\\\"\\nThis question descriptions is confusing me. What do we actually need to find/ return? Any intuitive guidance?\", \"answers\": [\"Hi @codeaesthete, I answered a question about this exercise some days ago here in this topic. I just copy my answer and paste bellow, then you can see if it's helpful for your.\\nWe have a given function called play_slot_machine, wich return a random value.\\nThe excercise asks us the mean value of a large numer of runs for that function.\\nSo first, our function needs to create a loop that execute the play_slot_machine n_runs times.\\ndef estimate_average_slot_payout(n_runs):\\n    for n in range(n_runs):\\n        play_slot_machine()\\nThan, we need to put every return of the play_slot_machine in a list and get the mean value of them.\\ndef estimate_average_slot_payout(n_runs):\\n   result_list = [] # creates the list\\n   for n in range(n_runs):\\n        result = play_slot_machine() # store the result in a variable\\n        result_list.append(result-1) # add this result in the list we created\\n        # minus one for the cost\\n        # and than do this again n_runs times\\n   return sum(result_list) / len(result_list) # return the mean value of the list\\nThan it tell us that to get the average value 0.025. So we need to run the funtion a large number of times.\\nWhen I tried with one billion times I get an aproximated value\\u2026\\nestimate_average_slot_payout(10**9)\\nRun this can take a few minutes, but you will get the average.\", \"Thankyou!!! I don't know why I missed this simple thing ;)\", \"This comment was deleted.\", \"What I did was simply this:\\ndef estimate_average_slot_payout(n_runs):\\nresult_list = [] # creates the list\\ni = 0\\nwhile i <= n_runs:\\nresult = play_slot_machine() # store the result in a variable\\nresult_list.append(result) # add this result in the list we created\\nreturn sum(result_list) / len(result_list) # return the mean value of the list\\nWhen I did mine, I had no need to increase the number of runs. Like at all.\", \"def estimate_average_slot_payout(n_runs):\\n\\\"\\\"\\\"Run the slot machine n_runs times and return the average net profit per run.\\nExample calls (note that return value is nondeterministic!):\\n>>> estimate_average_slot_payout(1)\\n-1\\n>>> estimate_average_slot_payout(1)\\n0.5\\n\\\"\\\"\\\"\\nreturn sum([play_slot_machine() - 1 for i in range(n_runs)])/n_runs \\ntry this one, one sentence\"]}, {\"question\": \"Hi, can someone please explain all parts of the 7th question in Booleans and Conditionals\", \"answers\": [\"Hi @fatihorucu, in this problem you need to program a function to play Black Jack. Actually the game function is ready. But you need to create a function that decides if you want one more card or not, and what the conditions to make this decision. The function have to return True for one more card or False to finish your game. You start with two cards and than you can request as many cards you want until get 21 points, if you pass 21, you lose. Once you finish your game, it's the dealer round, and he plays the same way as you did, if he pass 21 points he lose, but he can request another card until get 17 points, and not 21 as you can. If nobody pass 21 points the player which have more points wins. The points of each card you can check in the excercise, but attention to the 'A' (ace), it can represent diferent values. You can see my solution for this exercise here: \\\"https://www.kaggle.com/brunotly/exercise-booleans-and-conditionals\\\".\", \"Hi @fatihorucu!\\nThere is a Strategy Chart by Blackjack expert Colin Jones at blackjackapprenticeship.com.\\nApplying it yielded a win rate = 42.5%.\"]}, {\"question\": \"It's very helpful course to clear concepts ..!!\", \"answers\": []}, {\"question\": \"It's very helpful course for me. I learn much more from this course. Thank you\", \"answers\": []}, {\"question\": \"party_attendees = ['Adela', 'Fleda', 'Owen', 'May', 'Mona', 'Gilbert', 'Ford']\\ndef fashionably_late(arrivals, name):\\n    order = arrivals.index(name)\\n    return order >= len(arrivals) / 2 and order != len(arrivals) - 1\\nHi,\\nAbove is the correct solution for one of the questions considering lists.\\nQ1:\\nNo matter what do I try, I can not generate an output, or return to see whether the code works. And I do not mean the q4.check. But eg: fashionably_late(7, 'Ford')\\nQ2:\\nWe determine a list\\nWe define an object : fashionably_late\\nWe create 'order' with an undefined expression 'arrivals'. We did not tel the program what it is, how dates it know?\\nWe keep using this undefined object 'arrival'\\nAnd then back to Q1. I can not figure how to obtain an output.\\nAlso, the lecture discussed indexing but did not describe how to use .index() \\u2026.\", \"answers\": [\"Hi @agnesremes, this code you showed above just define the function fashionably_late (note that isn't an object, it's a function), but to get an output you need to call this function after define it. You can do something like that\\u2026\\nfashionably_late(party_attendees, 'Fleda')\\nThis is how we execute a function in Python, write it followed by () containing the arguments, which in this case are, respectively, a list containing the attendees, and a string containing which attendee we want to verify if it's fashionably late or not.\\nWhen you define a function, you use \\\"def\\\" folowed by it's name and it's arguments inside (), which are optional.\\nWe can define a function like\\u2026\\ndef my_function_1():\\nDo something.\\nOr\\u2026\\ndef my_function_2(argument_name_1, argument_name_2):\\nDo something with the given arguments.\\nTo call the first function you just need to do this\\u2026\\nmy_function_1()\\nWhen we call the second function we are required to give argument_1 and argument_2\\u2026\\na = 10\\nb = 20\\nmy_function_2(10, 20)\\nOr even\\u2026\\nmy_function_2(argument_name_1=a, argument_name_2=b)\\nWhich is the same thing. So in the fashionably_late function you can also call it as\\u2026\\nfashionably_late(arrivals=party_attendees, name='Fleda')\\nDefine a function with arguments or not depends on your necessity and what your function will do. But once defined with arguments, they will be required, unless you define them with default values\\u2026\\ndef fashionably_late(arrivals=party_attendees, name='Fleda'):\\nIn this definition the arguments have already been informed. So you can call\\u2026\\nfashionably_late()\\nThe function will use party_attenddees and Fleda.\\nOr you can call with another arguments\\u2026\\nfashionably_late(party_attenddees, 'Adela')\"]}, {\"question\": \"Q11 Lists, why doesn't this work as a solution:\\ndef purple_shell(racers):\\n\\\"\\\"\\\"Given a list of racers, set the first place racer (at the front of the list) to last\\nplace and vice versa.\\n>>> r = [\\\"Mario\\\", \\\"Bowser\\\", \\\"Luigi\\\"]\\n>>> purple_shell(r)\\n>>> r\\n[\\\"Luigi\\\", \\\"Bowser\\\", \\\"Mario\\\"]\\n\\\"\\\"\\\"\\nracers = [racers[-1]] + racers[1:-1] + [racers[0]]\\nFlabbergasted\", \"answers\": [\"I think you put an unnecessary \\\"]\\\" in \\\"[racers[-1]]\\\".\", \"Don't think so,\\nDoesn't seem to work if I do\\nracers = racers[-1] + racers[1:-1] + racers[0]\\nThe plus operator does sees the 1st element as string, the second as a list, and doesn't understand how to join them\\nBut TY\", \"I mean\\u2026\\n[racers[-1] + racers[1:-1] + [racers[0]]\\nInstead of\\u2026\\n[racers[-1]] + racers[1:-1] + [racers[0]]\\nIn your code above.\", \"ahh sorry. Understand now.\\nStill, get this error:\\nIncorrect: After running function on list ['M', 'L'] expected its new value to be ['L', 'M'] but actually was ['M', 'L']\\nMust be a problem with my logic then. Is it because it's recursive / implicit or annnything like that. This is the code:\\ndef purple_shell(racers):\\nracers = [racers[-1], racers[1:-1], racers[0]]\\nJust trying to swap the first and last elements\", \"Hi,\\nAccording to what you want to do, I notice 2 issues :\\nracers[1:-1] is not an element but a list. If you want to compute a list with this list, you should use extend function in your example:\\nracer_list = [racers[-1]]\\nracer_list.extend(racers[1:-1])\\nracer_list.append(racers[0])\\nracers is a parameter as a 'pointer' to a list which is defined outside the function. You should not modify it inside the function:\\nfor i in range(len(racer_list)):\\nracers[i] = racer_list[i]\\nThat said, there are much simpler to swap variables\", \"Cheers Fabrice.\\nCould you point me to some easier ways to swap variables?\", \"We cannot concatenate lists like this. However, in Strings we can do that..\\nWhat you can do in this question is, swap the positions as below -\\nracers[0],racers[-1] = racers[-1],racers[0]\\nprint(racers)\\nThis works!\"]}, {\"question\": \"Hi all! I have a question connected to the ex 3 from the Lists topic. I know that this is not the best aproach to this task but this is not the case. Take a look. When I run the code below\\nracers_temp = []\\na = racers[0]\\nb = racers[-1]\\nracers.pop(0)\\nracers.pop(-1)\\nracers_temp = racers\\nracers = []\\nprint(racers) \\nprint(racers_temp)\\nracers.append(b)\\nprint(racers)\\nprint(racers_temp)\\nI got this output:\\n[]\\n[]\\n['L']\\n[]\\nPerfect. But when I comment the 7th line (just for checking, lets assume that there were only two elements in the initial list, so there is no need to clean it after droped them out) then I get this output:\\n[]\\n[]\\n['L']\\n['L']\\nI mean, when I added 'b' element to the 'racers' list I didn't change anything in the 'racers_temp' list but it chenged anyway. Why?\", \"answers\": [\"Hi @dominikagorol, in the 6th line you say to Python that racers_temp = racers and in the 10th line you do this racers.append(b).\\nSee the commented code bellow and verify if it helps\\u2026\\nprint('Situation 1)\\nracers = ['a','b']\\nracers_temp = racers # the value of racers_temp is linked to the value of racers\\nracers.append('c') # the append method will change the value of both\\nprint(racers)\\nprint(racers_temp)\\nprint('\\\\nSituation 2')\\nracers = ['a','b']\\nracers_temp = racers\\nracers = [] # this is a new assigment (using \\\"=\\\") for racers and brokes the link\\nracers.append('c')\\nprint(racers)\\nprint(racers_temp)\\nSituation 1\\n['a', 'b', 'c']\\n['a', 'b', 'c']\\nSituation 2\\n['c']\\n['a', 'b']\", \"Thank you Bruno! I'm still a little bit confused by this, because when we changed the values between two variables we used this code:\\nc = a # we linked value 'c' to the value 'a'\\na = b # then we changed value 'a' and 'c' didn't change\\nb = c # so we assigned 'c' to 'b'\\nso with the .append method, it works differently?\\nThank you for your time again :)\", \"Depends if the variables are linked or not. If they are, the append method will change all variables linked to that varibale which you aply the method. Using your example\\u2026\\na = [1,2]\\nb = [3,4]\\nc = []\\n\\nc = a\\na = b\\nb = c\\nc.append(5)\\nb.appand(6)\\n\\nprint(a)\\nprint(b)\\nprint(c)\\n\\n[3, 4]\\n[1, 2, 5, 6]\\n[1, 2, 5, 6]\\nThe \\\"b\\\" is linked to \\\"c\\\", so any change in c will did the same in \\\"b\\\" and the opposite too.\"]}, {\"question\": \"Hi!! I have a question related to topic: Strings and Dictionaries. Question 2 of exercise.\\nQuestion asks to create a function word_search which will search the given keyword in given list of documents and return their indices wherever keyword present with certain condition given. Please refer question for details.\\nI wrote the solution as follows:\\nMy code:\\ndef word_search(doc_list, keyword):\\n\\\"\\\"\\\"\\nTakes a list of documents (each document is a string) and a keyword.\\nReturns list of the index values into the original list for all documents\\ncontaining the keyword.\\nExample:\\ndoc_list = [\\\"The Learn Python Challenge Casino.\\\", \\\"They bought a car\\\", \\\"Casinoville\\\"]\\n>>> word_search(doc_list, 'casino')\\n>>> [0]\\n\\\"\\\"\\\"\\nindex_lst = []\\nfor doc in doc_list:\\n    name = doc.split()\\n    normalized = [word.rstrip('.,').lower() for word in name]\\n    if keyword.lower in normalized:\\n        index_lst.append(doc_list.index(doc))\\nreturn index_lst \\nI am getting incorrect solution, which according to me should provide corrrect solution.\\nUpon checking the solution given, I found both the codes same expect the looping method used and the use of function enumerate to it which should not make difference to the answer. Please help what could be the source of getting incorrect solution.\\nAnswer Code:\\ndef word_search(documents, keyword):\\n# list to hold the indices of matching documents\\nindices = []\\n# Iterate through the indices (i) and elements (doc) of documents\\nfor i, doc in enumerate(documents):\\n# Split the string doc into a list of words (according to whitespace)\\ntokens = doc.split()\\n# Make a transformed list where we 'normalize' each word to facilitate matching.\\n# Periods and commas are removed from the end of each word, and it's set to all lowercase.\\nnormalized = [token.rstrip('.,').lower() for token in tokens]\\n# Is there a match? If so, update the list of matching indices.\\nif keyword.lower() in normalized:\\nindices.append(i)\\nreturn indices\", \"answers\": [\"Hi Sanchita, did you indent the row \\\"index_lst.append(doc_list.index(doc)\\\" inside the row \\\"if keyword.lower in normalized:\\\"???\"]}, {\"question\": \"Hi guys! I'm a bit confused with the code snippet below. Especially the part of the if-conditional marked in attached image. The first time it checks for an item that is not already on the list, shouldn't the count be 1 rather than 0? This has got me a bit confused, I will appreciate any clarification on this, please.|\", \"answers\": [\"Hi Opeyemi, it seems that winner_item_counts is a dictionary containig: 'racer_name_1': winner_count_1, 'racer_name_2': winner_count_2, \\u2026 So the row \\\"if i not in winner_item_counts\\\" is verifying if the racer_name is already in winner_item_counts, if it not exists yet in that dictionary, it will be added with count 0 and then added 1 on the next row with '+='. For example, if our i would equal to racer_name_3, this racer isn't in the dictionary yet. So on the next row we would do winner_item_counts[i]+= 1, but winner_item_counts['racer_name_3'] not exists. I think the function of\\n\\\"if i not in winner_item_counts\\\" is just verify if the racer is in the dictionary or not, and if it isn't, it will be added.\", \"You have to follow the lines of the code.\\nConditional statement checks all elements inside 'items' one by one.\\nIf the element does not exist as a key in a dictionary 'winner_item_counts', it will add it as a new key to the dictionary. Next line of the code will increase value for one count. So if the element from 'items' already exists as a key in the dictionary 'winner_item_counts' it will add to the value one count more. If you immediately add value 1 to the new key `winner_itemm_counts[i] = 1, the next line of the code winner_item_counts[i] += 1will increase value to 2 and that will be mistake.\", \"Consider that in this part you need to change the counter \\\"i\\\" to other variable name in the last cycle for. Likewise, you will understand better that part.\"]}, {\"question\": \"i think there is a mistake in \\\"strings and dictionnaries\\\" course\\ni tried the same example in \\\"startswith\\\" methode in pycharm and i got false instead of true\\nit is 2nd time i got a difference (i cant remember the 1st one though)\", \"answers\": [\"Hi @abdeldjalillakehal, can you post the exact piece of code you are talking about?\"]}, {\"question\": \"Anyone here have learned Data Science on EdX or Simplilearn? I'm planning to apply for a Master's course on them. Please share me a review about them. If possible please advise me some good course.\\nThank you in advance.\", \"answers\": [\"Go for Learn bay, Bangalore, india. Its perfect for non programmerss\", \"Applied AI is best\"]}, {\"question\": \"I have completed the \\\"Booleans and Conditionals\\\" exercise but the progress is still 88%, can someone help?\", \"answers\": [\"Download the notebook and delete all the cells. Upload it again and the issue will be resolved. Let me know if it doesn`t work.\", \"I had the same problem, it took me awhile to figure out what was causing it. I didn't run the cell that had q2.solution(). Once I ran this cell I was at 100%. I hope that helps.\", \"Most of (if not all) similar issues are caused by skipping a code cell that the learner HAS to run as @frnunezfondeur pointed out.\", \"Hi all, have the same problem, and I tried the solutions above, none worked: (i) ran q2.solution() and even included the missing q2.check(), (ii) downloaded the notebook, cleaned all cells, uploaded, still get the same 88%.\\nhttps://www.kaggle.com/isissantoscosta/exercise-booleans-and-conditionals\", \"Hi @isissantoscosta, Please check your code cell at In[16].\", \"100% \\u2714\\ufe0f Many thanks, @desalegngeb\", \"@vishal2908 , can you please check mine? I've deleted everything and uploaded again. Then I ran it all and committed again. I even uncommented to run those hints in case it could get me to 100%.\", \"@frnunezfondeur\\nThanks, that worked for me.\\nThe comment was not in my version and i kept trying by inserting a \\\"q2.check\\\" which was answered with \\\"there is nothing to check\\\".\", \"I'm having the same problem.\\nClicked the 'Run All' button\\nUncommented every hint and solutions\\nDownloaded, deleted all cells and uploaded the notebook\\nNothing worked, i'm still with 88% completion\\nAny help?\", \"Have you already tried to insert a \\\"q2.solution()\\\" instead of \\\"q2.check()\\\"?\", \"It works for me!\", \"I have an issue with it as well. At Q3, it prints answer False but according to the check it has returned True. Am I missing something?\"]}, {\"question\": \"Can someone pls explain the 4th question from the exercise of Loops and List Comprehensions?\\nQ: Next to the Blackjack table, the Python Challenge Casino has a slot machine. You can get a result from the slot machine by calling play_slot_machine(). The number it returns is your winnings in dollars. Usually it returns 0. But sometimes you'll get lucky and get a big payday.\", \"answers\": [\"Hi Abhinav, I made this exercise yesterday\\u2026.\\nWe have a given function called play_slot_machine, wich return a random value.\\nThe excercise asks us the mean value of a large numer of runs for that function.\\nSo first, our function needs to create a loop that execute the play_slot_machine n_runs times.\\ndef estimate_average_slot_payout(n_runs):\\n    for n in range(n_runs):\\n        play_slot_machine()\\nThan, we need to put every return of the play_slot_machine in a list and get the mean value of them.\\ndef estimate_average_slot_payout(n_runs):\\n    result_list = [] # creates the list\\n   for n in range(n_runs):\\n        result = play_slot_machine() # store the result in a variable\\n        result_list.append(result-1) # add this result in the list we created\\n        # and than do this again n_runs times\\n    return sum(result_list) / len(result_list) # return the mean value of the list\\nThan it tell us that to get the average value 0.025 we need to run the funtion a large number o times.\\nWhen I tried with one billion times I get an aproximated value\\u2026\\nestimate_average_slot_payout(10**9)\\nRun this can take a few minutes, but you will get the average.\"]}, {\"question\": \"Question :\\nNext to the Blackjack table, the Python Challenge Casino has a slot machine. You can get a result from the slot machine by calling play_slot_machine(). The number it returns is your winnings in dollars. Usually it returns 0. But sometimes you'll get lucky and get a big payday. Try running it below:\\nBy the way, did we mention that each play costs $1? Don't worry, we'll send you the bill later.\\nOn average, how much money can you expect to gain (or lose) every time you play the machine? The casino keeps it a secret, but you can estimate the average value of each pull using a technique called the Monte Carlo method. To estimate the average outcome, we simulate the scenario many times, and return the average result.\\nComplete the following function to calculate the average value per play of the slot machine.\\nQuery: Can someone help me with the solution to this question?\", \"answers\": [\"hi Anisha,\\nI have already replied to your question, but the reply disappeared!\\nYou may use a for loop in order to play the slot machine a big number of times. The for loop will execute play_slot_machine() repeatedly. You have to sum all the winnings, subtract $1 for each run. Then, you only need to divide the resulting number for the number of runs. The number obtained in this way will be the output of your function.\\nIf you need further help, let me know.\", \"Hi,\\nThe \\\"play_slot_machine()\\\" gives the output of a bet. Each time we bet, it cost us $1 (no matter the result). So, the idea of the function \\\"estimate_average_slot_payout(n_runs)\\\" is to obtain the average of gains in \\\"n_runs\\\" of the slot machine. This function is supposed to calculate the values of n_runs and return their average gain.\\nFor example, if we bet three times (ie if we run three times the function \\\"play_slot_machine()\\\") and get the values [0,0,0, 0.25] we need to subtract [-1,-1,-1,-1] (the cost of each time we play); in this case we get [-1,-1,-1,-.75] . In this example, we only win in the fourth bet $0.25. Then, our average win is \\\"mean([-1,-1,-1,-.75]) = -0.9375\\\".\\nThe interesting part is that, although it is very uncommon to win and most of the time we have losses, there are runs of the slot machine that we gain a lot of money. That is why the long-run average is positive (long-run average = the value of estimate_average_slot_payout(n_runs) for a BIG value ofn_runs). Unfortunately, the average of a real slot machine is always negative; the house always wins!\", \"i have written code for this problem. Any suggestions?\\ndef estimate_average_slot_payout(n_runs):\\n\\\"\\\"\\\"Run the slot machine n_runs times and return the average net profit per run.\\nExample calls (note that return value is nondeterministic!):\\n>>> estimate_average_slot_payout(1)\\n-1\\n>>> estimate_average_slot_payout(1)\\n0.5\\n\\\"\\\"\\\"\\na=0\\nfor i in range(n_runs):\\na = a + play_slot_machine() - 1\\navg=a/n_runs\\nreturn avg\\nestimate_average_slot_payout(1000)\", \"I'm stuck on the same problem and I'm not sure if there's a problem with the notebook itself. I can't even seem to get it to print n_runs, let alone run my full solution. I've tried restarting the kernel and refreshing the web page and I still can't get something as simple as this to give an output on my screen. Any help is appreciated.\\ndef estimate_average_slot_payout(n_runs):\\n\\\"\\\"\\\"Run the slot machine n_runs times and return the average net profit per run.\\nExample calls (note that return value is nondeterministic!):\\n>>> estimate_average_slot_payout(1)\\n-1\\n>>> estimate_average_slot_payout(1)\\n0.5\\n\\\"\\\"\\\"\\nprint(n_runs)\", \"u can refer my solution provided in the above comment.. but i am also not sure about it.. if u can check and advise.. pls\", \"Hi @CKtheBK, try run your code in the first cell where it says play_slot_machine(). It's above the function definition cell. Mine works this way\"]}, {\"question\": \"What does uncomment call mean?\", \"answers\": [\"Hi @justiceakagbulem,\\nIf you change for example,\\n#print(\\\"hello kaggle\\\")\\nto\\nprint(\\\"hello kaggle\\\")\\nYou uncommented (removed the hashtage #) part of a code section in your notebook or python file.\", \"first to comment means to silent a code so that your program ignores it by adding \\\"#\\\" to the begining of the line. To uncomment means to remove the \\\"#\\\"\", \"This allows the tutorials to \\\"guide you to an answer\\\" only if you uncomment the code that will show you the hint, and later the answer.\", \"uncomment means transforming a comment to code by removing #.\", \"Uncomment means we are running the code by removing the #.\"]}, {\"question\": \"Can anyone please tell me how did they solved the black jack question( optional question) in booleans and conditions? I am stuck at 88% and can't complete the entire course.\", \"answers\": [\"@lannister98 there is no need to solve the black jack task to get 100%. But if you really want to, then https://www.kaggle.com/learn-forum/90901. Just make sure that you have solved all tasks where it says To get credit for completing this question, your code should return a Correct result\", \"BTW, is there a typo in docstring?\\nand therefore set player_total=20, player_low_aces=2, player_high_aces=1\\nshouldn't it be: player_high_aces=11?\", \"Same for me, still stuck at 88%\\u2026\", \"I was also stuck at 88% completion, maybe you are/were making the same mistake me. Its the question where they ask us to specify the inputs for which the function prepared_for_weather( ) would fail. The comment inside the function is a bit misleading '* # Don't change this code. Our goal is just to find the bug, not fix it*!'. They actually expect us to give the values to the parameters and only then the question is considered complete.\\nThe completeness has nothing to do with solving the Optional Blackjack problem.\", \"can you post the code for the 88% and source for the actual algorithm? tia\"]}, {\"question\": \"@alexisbcook\\nI still couldn't fix the Exercise: Booleans and Conditionals I have done all I know how to do, can you please point me in the right direction?\\nhttps://www.kaggle.com/jbolaifa/exercise-booleans-and-conditionals/edit\", \"answers\": [\"I cannot open the link you posted. Could you please clarify what is your problem? Send me the number of exercise number or screenshot.\", \"I have uploaded a snapshot. There is a share button using which you can make your notebooks public.\\nTry it and let me know.\\nCapture.PNG\", \"I just made it public\"]}, {\"question\": \"Minor error in Hello, Python (1 of 7)\\nThanks for the course! I think I spotted a minor error that might confuse readers.\\nIn cell In[1]:\\nviking_song = \\\"Spam \\\" * spam_amount\\nprint(viking_song)\\nThen later in In[5]:\\nviking_song = \\\"Spam Spam Spam\\\"\\nprint(viking_song)\\nThese two snippets should be the same as the later is the detailed explanation of the former. Also in the current version spam_amount is set to 4 which would even result in a different output.\", \"answers\": []}, {\"question\": \"Check out Introduction to Computer Science and Programming Using Python by MIT\\nIt's probably better than this course and goes in-depth too.\\nhttps://www.edx.org/course/introduction-to-computer-science-and-programming-7\", \"answers\": [\"thanks mate for the advice!\", \"The Georgia Tech edx course is a good option too!\\nhttps://www.edx.org/es/professional-certificate/introduction-to-python-programming\", \"Thanks for suggestion\"]}, {\"question\": \"I am not new to Python anymore, and yet, this tutorial taught me a lot. It's concise but incredibly helpful. Thank you for writing it.\", \"answers\": [\"same in my case \\u2026I learn much more from this tutorial.\"]}, {\"question\": \"The content of this course was really great!!\\ud83d\\udc4d\", \"answers\": [\"You bet \\ud83d\\udc4c\\ud83d\\udc4c\\ud83d\\udc4c\", \"Exactly @alifrahman .\"]}, {\"question\": \"Hi everyone! Thanks for share all this knowledge which continue grove up. I've been using kaggle for 2 months and I'll hope to give some feedbacks very soon.\\nBest regards!\", \"answers\": [\"Best of Luck @gabrielcaraven .\"]}, {\"question\": \"Isn't this an error when on line 13 you declare :\\nclaim = 'Pluto as planet'\\nand then on line 16, you typed,\\nclaim.startswith(planet) >>>>How can it return True\\u2026\\u2026.First of all, the string claim does not start with planet secondly for string.startswith() method you need to enclose the parameter inside quotes otherwise it will throw an error.\\nClarify me if I am wrong\", \"answers\": [\"I agree, it doesn't work the way it's written\", \"This is not an error!\\nArgument planet (pay attention it is without quotes!) is the statement defined in line 8 planet = 'Pluto'\\ncalim.startswith(planet)\\nTrue\", \"@petar2020 is right! Thanks; I hadn't gone back far enough in the code to see that.\"]}, {\"question\": \"Does somebody have a solution for the Black Jack exercice q7 Booleans and Conditionals?\\nThankfull for any help\\nThanks\", \"answers\": [\"I got 41% win with this.Dont know if i have implemented it right.\\nif player_total>21:\\nif player_high_aces>=1:\\nplayer_low_aces+=1\\nif player_total==(9 or 10):\\nif player_low_aces==1:\\nplayer_high_aces=1\\nreturn False\\nif player_total==9:\\nif player_low_aces==2:\\nplayer_high_aces=1\\nreturn False\\nif player_total=1:\\nplayer_high_aces=1\\nif player_total<19:\\nreturn True\\nelse :\\nreturn False\\nif player_total<16:\\nreturn True\", \"Great solution! I was wondering if there is a better way to do this.\", \"I got 41.5 - 42.0 win only with this:\\nif dealer_total > 21: \\n    return False \\nif player_total < 14:\\n    return True\\nelse:\\n    return False\"]}, {\"question\": \"I am trying to find the overloaded operators in the following line. referring to dataframes (lesson 7)\\ndf[(df['population'] > 10**6) & (df['continent'] == 'South America')]\\nindex operator [ ] here is used to define rows and columns.\\ncomparison operator > here is used to compare the context of a cell.\\ncomparison operator == here is used to compare the context of a cell.\\nbitwise operator & here is used to compine lines that following two different conditions.\\nWhat do you think?\", \"answers\": []}, {\"question\": \"This makes zero sense.\", \"answers\": []}, {\"question\": \"Python doesn't work like this. What the hell are you trying to teach?\", \"answers\": []}, {\"question\": \"Something is going wrong with the question.check functions of Lesson 5.. Where can I address?\", \"answers\": [\"I have found the answer. I had accidentally deleted set up code from exercise 6 and to fix that I copied the set up code from course 3. That effected the result after running the check() function for the followiing questions.\"]}, {\"question\": \"Hi everyone! Can anyone explain why round(9.9999,2) is 10.0 instead of 10.00? I thought the second argument indicated the number of decimal places. Thank you!\", \"answers\": [\"Hey, @wndybrntt\\nWhenever you round up the floating(real) number to integer or rounding the value\\nit converts more than 0.555 values to 0.56 with the 2 decimal number\\nthe same thing applied in your case.\\nHope you understood. \\ud83d\\udc4d\", \"Even if you call the methond round() with these arguments -> round(9.9999999,3) it will still return 10.0 instead of 10.000. This is because python would show only one trailing '0' even if there are two or more trailing '0's in decimal/fractional part of floating point numbers.\\ntry this,\\nassign x = 10.00000\\nThen call print(x)\\nThe result would be 10.0 and not 10.00000\", \"Thank you! It may seem like a detail but I couldn't figure out why in some cases Python seemed to be dropping a digit. I appreciate it.\", \"10.0 is enough to express it is float type and everybody knows that 10.0 equals 10.00.\\nI hope it will be helpful for you.\"]}, {\"question\": \"There is an error in the Strings lesson:\\nThis will return an error as written. It should read either:\\nclaim.startswith('planet')\\nWith an answer of False\\nor\\nclaim.startswith('Pluto')\\nTo maintain an answer of True\", \"answers\": [\"I agree, it doesn't work the way it's written\", \"This is not an error!\\nArgument planet (pay attention it is without quotes!) is the statement defined in line 8 planet = 'Pluto'\"]}, {\"question\": \"Hi everyone,\\nI've completed all exercices in the last lesson of Python 'Exercise: Working with External Libraries', but the Exercice percentage for this lesson is 67%, and the overall percentage for all lessons is 98%.\\nIs there anything else that I need to do in order to get the 100% for this course ??\\nThank you.\", \"answers\": [\"Hi @younesseljahidi\\nIt seems like you've missed running any relevant code cell which carries credit. Please go through the exercises of Working with External Libraries again and make sure to run all the code cells.\\nI hope this answers your question. Good luck!\", \"Hi Youness\\nI faced your problem today. Did you find what was wrong with it?\\nThanks,\\nKhosro\", \"Make sure youre code ends with this;\\n(example)\\n\\\"\\\"\\\" Check your answer\\\"\\\"\\\"\\nq3.check()\\nq3 depends on the question/exercise number. via this function they check youre code, and result must be\\ncorrect (in green)\"]}, {\"question\": \"Hello Kaggle Learner, \\u270b\\nToday, I Just update my worked notebook on Loan Eligibility Prediction For House Using Pandas Exploring Data Analysis Tools and Implement Machine Learning Module with Beautiful Explanation. \\ud83d\\udc4d\\ud83d\\udc4d\\ud83d\\udc4d\\nHope you Guys enjoying and Learn something interesting from this Kaggle Notebook Kernal\\nClick here to navigate to my Work\\nHope you love it and Upvote it.\\nRegards,\\nVikas Ukani.\", \"answers\": [\"Thanks for sharing.\"]}, {\"question\": \"pls can someone enlighten me more on the line of code from line 14, i mean the subtopic function applied to function, thank you\", \"answers\": [\"Hi Johnson, there is 3 parts for the code in line 14.\\nFirst part, I think is fairly simple, which you defined a function that will do arithmetic calculations.\\nFor the second part, it basically means that you defined a function \\\"call\\\" that has 2 inputs, the first part \\\"fn\\\" refers to the functions that you defined yourself or an in-built functions, and the second part \\\"arg\\\" refers to the input that you're going to throw inside the functions that you specify in the first part, which is the \\\"fn\\\" you entered.\\nWhile it may seems redundant to do this (as one can call a function straight away without defining another function to perform the function one is intended to perform), it's apparent why doing so might be helpful in the following part.\\nLastly, the function \\\"squared_call\\\" has the same 2 inputs as the second part, but what it does here is performing the function twice with the same argument.\\nfor example you have a function: (I'll write it in mathematical language as for me it is easier to comprehend)\\nyou have a function (the function you defined) f(x) = x^2,\\nand for the argument (which is the input) = 2.\\nAnd what part 3 did is calling the function twice, along with the argument, it will gives us:\\n((x^2)^2), given x is 2:\\nWhich gives us the answer 16.\\nHope that clarifies your question.\"]}, {\"question\": \"Python for Everybody by 'University of Michigan' is also good for beginners.\", \"answers\": []}, {\"question\": \"Hi,\\nCan someone help me with the Blackjack problem? I didn't understand it and would really appreciate if someone could help with that?\", \"answers\": [\"I also didn't understand it. Any help would be really helpful\", \"What part are you having trouble with? You should write code within the should_hit() function that allows you to on average outplay the dealer's decision-making algorithm. A very simple start would be to check the player_total against the dealer_card_value. Don't want to give too much away but I hope I helped some.\", \"Hi,\\nHow would I know that it was improving. The best I got is\\nPlayer won 19540 out of 50000 games (win rate = 39.1%)\\nIs there a way to know that I have really made an improvement?\\nThanks\", \"if player_total <= 16 or (player_total <= 18 and player_high_aces == 1) :\\n        return True\\nThis condition is giving win rate of 40.9%\\nEven I am not able to go any further than this.\"]}, {\"question\": \"In the first exercise itself, there's no method to check the q3.a and q3.b parts. I can't get 100% in the first exercise due to that.\", \"answers\": [\"Use q3.a.check() and q3.b.check()\"]}, {\"question\": \"I completed my first course at Kaggle today. It is the Python course. I want to utilize this platform to thank and appreciate @colinmorris the instructor of the course who has designed such an amazing course.\\nThe content of the course is very well-written and to the point. The exercise that is part of each lesson complements the whole lesson. The tasks in the exercises kept me engaged and quite a lot of tasks made me think about how should I formulate the solution. I thoroughly enjoyed the whole course.\\nThank You so much Kaggle and @colinmorris\", \"answers\": []}, {\"question\": \"thank you for accepting me in this community:\\nbut i don't have an idea were to star from\", \"answers\": [\"If you find the python tutorial here difficult to follow, then, you can watch Python Tutorials on YouTube by 'Telusko', they are very helpful. Link: https://youtu.be/YfO28Ihehbk .\", \"if you want to know how to start with kaggle then you can see this\\nhttps://www.kaggle.com/getting-started/180913\", \"really appreciate\", \"You can also follow Python Programmer on YouTube. Even though he does not have many tutorials in python, he does point you to resources about python. He also likes promoting free but high quality resources so you can supplement your learning without additional cost.\\nHappy Learning!\", \"Great sharing. Thank you.\", \"Thanks for sharing\"]}, {\"question\": \"facing problem of last lesson last problem (BlackJack problem).. please anyone help me out??\", \"answers\": []}, {\"question\": \"Hi I am facing difficulty in the blackjack question. At max , I was able to get 41.2% accuracy in the should_hit() question.\", \"answers\": []}, {\"question\": \"I just started using kaggle for learning python and i am enjoying it. If anyone wants to give any suggestions please reply to me :)\", \"answers\": [\"\", \"Great! I have also started recently to use Kaggle and so far it's very exciting. The free courses are provided at a standard level. I am planning to cover at least a lesson per day.\"]}, {\"question\": \"for the second problem in string and dictionaries, my code get a incorrect check and it says:\\nWhen calling your function with arguments [['The Learn Python Challenge Casino', 'They bought a car, and a horse', 'Casinoville?'], 'casino'], Python raised the following exception\\u2026 AttributeError: 'list' object has no attribute 'lower'.\\nHowever, when I using the same input to test the given solution, it returns the same AttributeError. It is clearly incorrect but I don't get why it uses a list which contains another list as an attribute to check the solution. Furthermore, what should be the correct solution that can deal with this situation? what about given a document that contains a list which contains a list? this could go on and on to infinity!\", \"answers\": [\"Hey, how's it going?\\nAccording to your error, you're trying to use lower on a list, instead of a string.\\nCan you show your code?\", \"Check this line\\\" for i, doc in enumerate(documents):\\\" and notice if the parameter of \\\"enumerate()\\\" and \\\"multi_word_search()\\\" is same.\", \"Thanks. It really helped\"]}, {\"question\": \"Thank you so much for making this course! It was really simple and concise and I learned a few new things even after taking similar tutorials on HackerRank and CodeAcademy. :)\", \"answers\": []}, {\"question\": \"I am not able to understand the blackjack example problem in the Conditionals part of the Python course. Can someone share the solution so that I can understand the concept better?\", \"answers\": [\"I did find it a little bit difficult to get my head around since it's not the sort of thing i do in my day to day work with data and I have not played black jack for a long time. The objective is to exit the game loop before the player total reaches exceeds 21. There is no one solution to the game. You have to try different criteria as to when to exit the game loop. The simplest approach to start with is to use the below code in the funciton body:\\nif player_total <= 16:\\n    return True\\nWhat you are saying with this statment is if the player's total is less than or equal to 16 you are prepared to play another round. You are prepared to take the risk the next card won't take your total over 21.\\nif that feels a bit risky, if you want to be a bit more conservative you then you might want to change the conditional to:\\nif player_total <= 16 and player_high_aces == 1:\\nreturn True\\nWith this new conditional you are saying your are prepared to draw another card if your total is less than or equal to sixteen and you have already drawn an ace which has according to the game rules taken on the high_aces value of 11 so if you draw another ace it will be a low_ace and take on the value of 1.\\nHope this helps you to think through it. Post back with your final solution if you like.\", \"Thanks a lot @andrewdmck . I understood it now. Will post my solution in a while.\", \"I think aces count in depends on total score, as the rules say. If sum of other cards on the hand < = 10 and you hit a ace, this ace count as 11; if dealer_total or player_total >= 11, then new ace count as 1 (because in this case total score don't exceed 21). Also, if you arleady have ace that counted as 11 and you hit a card, ace can be recounted as 1, if it \\\"helps\\\" don't exceed 21.\\n\\\"Player starts with Q and 5 (total = 15)\\nDealer starts with 7\\nPlayer's turn\\nPlayer stays\\nDealer's turn\\nDealer hits and receives 6. (total = 13)\\nDealer hits and receives A. (total = 14)\\nDealer hits and receives 7. (total = 21)\\nDealer stands.\\nDealer wins. 21 >= 15\\\"\\n\\\"Player starts with A and 5 (total = 16)\\nDealer starts with 9\\nPlayer's turn\\nPlayer hits and receives 10. (total = 16)\\nPlayer hits and receives 5. (total = 21)\\nPlayer stays\\nDealer's turn\\nDealer hits and receives 3. (total = 12)\\nDealer hits and receives 6. (total = 18)\\nDealer stands.\\nPlayer wins. 21 > 18\\\"\\nBut honestly I have no idea how to use player_high/low_aces :)\"]}, {\"question\": \"I did some courses online on python but this one is concise and incredibly helpful.\\nThank you for sharing.\", \"answers\": []}, {\"question\": \"The last problem, the average value is only valid (around 0.025) when the n_runs is larger than 10^7\\u2026\\u2026. took some time for my computer to run\", \"answers\": []}, {\"question\": \"the course content was good!\", \"answers\": [\"yeah, you are right @mtaha007 .\"]}, {\"question\": \"Hello,\\nI think there is an error in the losing_team_captain function defined in chapter 4 Lists of Python introduction. If you print out the teams variable you will obtain [['Paul', 'John', 'Ringo', 'George']].\", \"answers\": [\"hi Matteo,\\nare you using the code provided by Kaggle? The code works well:\\nHave you got some output to show?\", \"Found the error, my bad!\", \"Molto bene\"]}, {\"question\": \"Thanks, I've been looking for a course like this\", \"answers\": [\"One little suggestion.\\nTry IndiaAI\"]}, {\"question\": \"Amazing well structured course with different learning levels.\", \"answers\": []}, {\"question\": \"Hi ! can somebody help improve the winning rate of the player in this black jack game ?\\n`def should_hit(dealer_total, player_total, player_low_aces, player_high_aces):\\n\\\"\\\"\\\"Return True if the player should hit (request another card) given the current game\\nstate, or False if the player should stay.\\nreturn False if player_total >= 21 else True`\", \"answers\": [\"Try and think about the circumstances you would \\\"hit\\\" (ask for another card):\\nwhen you feel there's a low probability you will not go bust (e.g. if your hand value is below some value)\\nwhen you feel there's a strong chance the dealer has a better hand than you (e.g. if their hand value is above some value)\", \"Thank you I raised the winning percentage to 38.2 considering those two things !\"]}, {\"question\": \"Hi, I had a question on the last exercise with for loops, what was the written code for the machine slots payout average?\", \"answers\": [\"You need to call the play_slot_machine() function in a loop for n_runs times and add-up the result and take an average. When you execute the your function with a high value of n_runs you can see a pattern with the output close to 0.25 (e.g. 0.02304915) for each execution. Don't forget to deduct a $ for each execution of play_slot_machine().\\nFranck BRYCH wrote:\\nHi, I had a question on the last exercise with for loops, what was the written code for the machine slots payout average?\", \"Thank you!\"]}, {\"question\": \"Hello guys,\\nI am new to python and learning the course and facing some issue with \\\"round\\\" function\\nWould be glad if someone can help me in the following two codes below, can also see the snap in the attachments\\nI/P: print(round(9.9999, 2))\\nO/P: 10.0\\nShouldn't it be 9.99??\\nI/P: round(338.424, -3)\\nO/P: 0.0\\nShould't output be 338.000??\\n10.png\", \"answers\": [\"For first part\\nThe round up of a number is done with following rule:\\nLook at the last digit if it's greater or equal to 5\\nIf yes, increment the next digit by 1 and remove the last digit\\nIf no, remove the last digit\\nFor example\\nx = 6.4537\\nlast_digit = 7 (greater than 5), increment to next digit and remove 7\\nit will become x = 6.454\\nlast_digit = 4 (less than 5), remove 4\\nx = 6.45\\nlast_digit = 5 (equal to 5), increment to next digit and remove 5\\nx = 6.5\\nand so on\\nFor the second part, this is how it's doing\\nround(338.424, -1) --> 340.00 (rounded upto close Tenth)\\nround(338.424, -2) --> 300.00 (rounded upto close Hundredth)\\nround(338.424, -3) --> 0.0 (rounded upto close Thousandth, which is zero)\", \"Thank you very much\\nBut what code should I write then if I just want my output for\\n9.9999 as 9.99\\nand\\n338.424 as 338.00\\nwhat code can help me here if not round function?\", \"Dear Aayush,\\nIf you format 9.9999 by reducing a single digit, it will become 10.000. No other go it has. because 10 is much closer to 9.9999 than 9.9990\\n10.000 - 9.9999 = 0.0001\\n9.9999 - 9.9990 = 0.0009\\nNine times closer!\\nFormatting a number to lower decimal points do not just truncate the rightmost digits. it will round it automatically. so by converting your 'number' into 'string', for instance '9.9999', you can truncate to any number of digits. later convert it into float.\\nIn case of 338.424:\\nround(338.424 , 0) = 338.00\\nif you number is 338.524:\\nround(338.524 , 0) = 339.00\\nHope it helps!\"]}, {\"question\": \"I got a certificate on this course today. The course is very nice and clear. Thank you for sharing.\\nHowever, it was hard to get through the exercises, especially the list and string parts.\\nI think I need to study a bit more on this. I'm glad I found kaggle.\", \"answers\": [\"how did you solved strings and dictionaries last problem\\neven with same solution i am getting error\"]}, {\"question\": \"Hi all !\\nNew to the community.\\nFacing the below error(Attachment)\\nCan someone please guide.\\nAlso while performing other exercises on the same page.\\nEven after clicking the run button the program doesn't execute.\\nThank you in advance for helping.\\nCheers !\\nError.PNG\", \"answers\": [\"You might have missed to run these lines of code (available above question 0). Run it (ctrl+Enter) and you will be good to go! Refer attachment (snapshot of those codes). Since kaggle uses its own library and functions to perform exercises, it is essential to import those libraries.\\nkaggle-py-1.png\", \"Did you run the setup code? I think that should solve the problem\"]}, {\"question\": \"Hi there,\\nI have finsished the course and yet it is showing me that exercise of last chapter is pending. Can anyone help me out here?\", \"answers\": [\"I think some points are missing to complete,\\nPlease check again and try to complete again, Maybe it'll worked\"]}, {\"question\": \"s = 'steganograpHy is the practicE of conceaLing a file, message, image, or video within another fiLe, message, image, Or video.'\\nmsg = ''\\nprint all the uppercase letters in s, one at a time\\nfor char in s:\\nif char.isupper():\\nprint(char, end='')\\nthis gives me error?what's wrong in this?\", \"answers\": [\"Dear Roopa,\\nWithout knowing what error message you get, it is difficult to predict. Also your codes seem right.\\nHowever possibilities of mistake is in indentation:\\nfor char in s:\\nif char.isupper():\\nprint(char, end = '')\\nWhenever you share codes, please share a snapshot of it. Similarly error message too!\"]}, {\"question\": \"s = 'steganograpHy is the practicE of conceaLing a file, message, image, or video within another fiLe, message, image, Or video.'\\nmsg = ''\\nprint all the uppercase letters in s, one at a time\\nfor char in s:\\nif char.isupper():\\nprint(char, end='')\\nthis gives me error .why?\", \"answers\": [\"please share the error message.\"]}, {\"question\": \"Oh my bad. Noticed it changes stings, so everything is right\", \"answers\": []}, {\"question\": \"for planet, initial in planet_to_initial.items():\\nprint(\\\"{} begins with \\\\\\\"{}\\\\\\\"\\\".format(planet.rjust(10), initial))\\nwhat's the use of rjust(10) ?\", \"answers\": [\"rjust() is used in order to add spacing between planet items from planet_to_initial.\\nplanet.rjust(10) returns a string with planet value and 10-{length of planet value) spacings on the left of the string (supposing planet_to_initial is a list of strings)\"]}, {\"question\": \"can anyone give me solution of last question of boolean assignment ? unfortunately win rate decreases if we run code many times\", \"answers\": []}, {\"question\": \"can anyone tell me solution of last answer of boolean assignment any how I got 42% win rate unfortunately if we run same code for many time win rate reduces again\", \"answers\": []}, {\"question\": \"def word_search(documents, keyword):\\nindices = []\\nfor i, doc in enumerate(documents):\\ntokens = doc.split()\\nnormalized = [token.rstrip('.,').lower() for token in tokens]\\nif keyword.lower() in normalized:\\nindices.append(i)\\nreturn indices\\nPlease anyone let me know the problem with this code. Why is it not working?\", \"answers\": [\"The solution you provided is ok, but you need to indent each line in the correct way.\\nYour solution with correct indentation: https://pastebin.com/6qDyPBGS\\nMy solution: https://pastebin.com/MMsdrPsp\"]}, {\"question\": \"I have found that most of the courses online miss out on the fundamentals of mathematics and how to use them in real world scenarios. Can anyone suggest me online resources that teach the math for data science by actually applying the techniques in real world scenarios?\", \"answers\": [\"Hi, Khan Academy provides good courses for free: Algebra 1, Algebra 2, Linear algebra, Statistics and probability . In Coursera you can find a Machine learning course taught by Andrew Ng, there's a number of lessons about vectors, matrices, and so on. If you need something more, PM me and I'll send you some good books!\", \"Alright, I will do it!\", \"Between \\\"physical\\\" books, I'm using this one:\\nNorman Matloff\\nProbability and Statistics for Data Science: Math + R + Data\\nCRC Data Science Series\\nI like the approach for teaching probability and statistics. And it teaches R, for which we cannot find a course here. By the same author, there's also a good free introduction to R.\\nLet me give you the last link (from a great site called KDnuggets):\\nIf I had to start learning Data Science again, how would I do it?.\\nIt's suggested to start with Kaggle courses, so for now we're in the right direction \\ud83d\\ude01\", \"Thank you for the suggestions @tarukofusuki. Here is another amazing resource for statistics\\nhttps://www.bcfoltz.com/blog/stats-101/\"]}, {\"question\": \"I'm very happy with this course. I was already familiar with python, but I really wanted that Kaggle certification !\\nI am a bit confused with the BlackJack exercice tho. Can someone please help me with this ?\\nI don't see how I can change the player's aces values and how it's suppose to sum up to player_total ?\\nI don't understand how the other parameters should intervene in this\\nHow can I possibly know what value is the dealer's hidden card ?\\nI managed to get a wining rate of 40.7% with this simple code but I can't get better.\\nwhile(player_total < 17): return True\", \"answers\": []}, {\"question\": \"print(\\\"pi to 4 significant digits = {:.4}\\\".format(math.pi))\\noutput:\\npi to 4 significant digits = 3.142\\nPlease explain \\\".4\\\" is used for?\", \"answers\": [\"Its same as while you selecting some elements from list\\nExample\\nlists[0:3]\\nIn this case your output is 0, 1, 2\", \"In your case the '.4' signifies the amount of digits to be printed\"]}, {\"question\": \"indices=[]\\nfor i,doc in enumerate(doc_list):\\ntokens=doc.split()\\nnormalized=[token.rstrip('.,').lower() for token in tokens]\\nif keyword.lower() in normalized:\\nindices.append(i)\\nreturn indices\\nIn this solution I don't understand what is rstrip('.,') does? please explain. And also explain the code.\", \"answers\": [\"token.rstrip('.,') removes/deletes any commas (,) or full-stops (.) from every token string in tokens list.\"]}, {\"question\": \"def select_second(L):\\n\\\"\\\"\\\"Return the second element of the given list. If the list has no second\\nelement, return None.\\n\\\"\\\"\\\"\\nw = L[1]\\nif bool(w):\\n    print(L[1])\\n    w = L[1]\\n    return w\\nelse:\\n    return None\\n\\npass\\nCheck your answer\\nq1.check()\\nI wrote this code for finding the second element of the and got this error\\nWhen calling your function with arguments [[1]], Python raised the following exception\\u2026 IndexError: list index out of range\\nplease help\", \"answers\": [\"Try this oneliner\\ndef select_second(L):\\n    \\\"\\\"\\\"Return the second element of the given list. If the list has no second\\n    element, return None.\\n    \\\"\\\"\\\"\\n    return None if len(L) <= 1 else L[1]\"]}, {\"question\": \"I kind of binge worked most of the courses. It will help you refresh the basics in no time. For me, those courses are more like the warm-up session for the real work out. Hats off to all the people behind the course development. \\ud83e\\udd13\", \"answers\": [\"@jaseemck thats true it helps refresh everything quickly.\", \"Yes it is!\"]}, {\"question\": \"`def elementwise_greater_than(L, thresh):\\n\\\"\\\"\\\"Return a list with the same length as L, where the value at index i is\\nTrue if L[i] is greater than thresh, and False otherwise.\\nElement_Boolean = [True for num in L if num>thresh]\\nreturn Element_Boolean\\n`\\nFollowing error pops :\\nIncorrect: Expected return value of [False, False, True, True] given L=[1, 2, 3, 4], thresh=2, but got [True, True] instead.\\nCan someone help identify error in my code.\", \"answers\": [\"If I write your code without using list comprehension then it looks something like this:\\nElement_Boolean = []\\nfor num in L:\\n    if num > thresh:\\n        Element_Boolean.append(True)\\nreturn Element_Boolean\\nAlthough it handles the situation for True very well, but it misses the part when False is to be added to the list.\\nHope this helps :)\", \"Thank you clarifying. If you could also assist how can I modify my code (sticking to using list comprehension) to address the 'False' issue.\"]}, {\"question\": \"Can anybody please answer me on do we get certificates to share after completion of the course?\\nAnd do we need to pay for that like edX??\", \"answers\": [\"No,This is a free platform and we will get free certificates too after the completion of the course\"]}, {\"question\": \"Can someone tell me the logic behind this command line:\\nHere all the three variables are boolean type\\nreturn (ketchup + mustard + onion) == 1\", \"answers\": [\"@aayushbanerjee This is boolean-to-integer conversion where a boolean variable is getting converted into a integer. For example, doing boolean-to-integer conversion on variables ketchup = True and mustard = False will be 1 and 0 respectively.\\nketchup = True\\nint(ketchup) = 1\\nmustard = False\\nint(mustard) = 0\\nSo we can do return (int(ketchup) + (int(mustard) + int(onion)) = 1\\nBut we don't technically need to call int on the variables. Just by doing addition with booleans, Python implicitly does the integer conversion.\\nSo if only one of the variable among ketchup, mustard and onion has value True, it will return True, otherwise return False.\\nExample 1 : ketchup = True, mustard = False, onion = False\\nketchup + mustard + onion = 1, hence return True\\nExample 2: ketchup True, mustard = False, onion = True\\nketchup + mustard + onion = 2, hence return False\\nHope this clarifies you. Feel free to ask if you didn't get something.\", \"Nicely explained @mohdsaqibhbi\\nCheckout my new work on my notebooks\\nHope you guys like it and learn something interesting from my notebooks \\u2764\\ufe0f\\u2764\\ufe0f\\u2764\\ufe0f\", \"@vikasukani Thanks mate.\"]}, {\"question\": \"`def fashionably_late(arrivals, name):\\n\\\"\\\"\\\"Given an ordered list of arrivals to the party and a name, return whether the guest with that\\nname was fashionably late.\\n\\\"\\\"\\\"\\npass\\nif arrivals.index(name)>= len(arrivals)/2 and arrivals.index(name) != len(arrivals)-1: \\n    return \\\"Fashionably late\\\"\\nq5.check()`\\nThis is the code I have written for the last question of exercise of Unit 4: Lists.\\nFollowing error message is popping:\\nIncorrect: Got a return value of None given arrivals=['Adela', 'Fleda', 'Owen', 'May', 'Mona', 'Gilbert', 'Ford'], name='Adela', but expected a value of type bool. (Did you forget a return statement?)\\nCan someone help what is wrong with my code?\", \"answers\": [\"@mohammadtahasiddiqui This should be either like this\\nif arrivals.index(name)>= len(arrivals)/2 and arrivals.index(name) != len(arrivals)-1:\\nreturn True\\nelse: return False\\nOR\\nreturn arrivals.index(name)>= len(arrivals)/2 and arrivals.index(name) != len(arrivals)-1\\nbecause the statement under if-condition won't be executed if if-condition is False.\\nSecondly you only have to return True or False, not \\\"Fashionably late\\\"\\nHope this helps you.\", \"Thankyou @mohdsaqib!\"]}, {\"question\": \"Hey!! I am new to python and facing some issue in problem 0:\\nThere how to create a new variable called color?\\nI tried the following:\\nDef color():\\ncolor():\\ncolor\\nnone of them is working and how to exactly run it, the errors are always shown there!!\\nEven in hints and solotions the codes are not given to refer them\", \"answers\": [\"Hi, the question is just asking \\\"what is your favorite color?\\\" you don't have to define a function, it;s far more simple than that, it's just a warm up of sorts I suppose.\\nSo, maybe try something with an = sign in the answer, very short answer is required. You are basically just labeling a variable and giving it a value (your color).\\nI hope that was clear enough and helpful. Best of luck.\", \"In python you can create variable by using this\\ncolor = 'Red'\\nprint(color)\"]}, {\"question\": \"def is_odd(n):\\nreturn (n % 2) == 1\\nprint(\\\"Is 100 odd?\\\", is_odd(100))\\nprint(\\\"Is -1 odd?\\\", is_odd(-1))\\nIs 100 odd? False\\nIs -1 odd? True\\nCan someone please explain me how on earth is this possible if -1 is divded by 2 then remainder is 1\", \"answers\": [\"@sahilbhat619 In arithmetic a number (n) is expressed as follows:\\nn = q*m + r, where r must be a non-negative integer\\nSo expressing -1 = -1 * 2 + 1, we have r = 1 i.e -1 % 2 = 1\\nI hope this helps to answer your question.\"]}, {\"question\": \"Hi all!\\nCould anyone tell me if I did the last loop point correctly???\\ndef estimate_average_slot_payout(n_runs):\\n    \\\"\\\"\\\"Run the slot machine n_runs times and return the average net profit per run.\\n    Example calls (note that return value is nondeterministic!):\\n    >>> estimate_average_slot_payout(1)\\n    -1\\n    >>> estimate_average_slot_payout(1)\\n    0.5\\n    \\\"\\\"\\\"\\n    win = 0\\n    for i in range(n_runs):\\n        win = play_slot_machine()-1\\n    return win/n_runs\\n\\nestimate_average_slot_payout(1)\\nBest regards!\", \"answers\": [\"Is there any problem in this code?\\nCouse, It's seems correctly.\", \"Hi Luciano,\\nIt seems that your code will correctly work if n_run is 1.\\nFor n_run > 1, do add the profit(win) inside the for loop\", \"Thank you for your answers!\"]}, {\"question\": \"after running a cell, i am not able to see any output. can anybody tell me how to see output after running a cell ? & also how to use console present at bottom of the page. Thanks\", \"answers\": [\"Hi Ganesh, in order to run a cell and see its output, you have to press SHIFT + ENTER.\\nBelow, a list of keyboard shortcuts (source):\"]}, {\"question\": \"Can someone please explain the answer to the last question on Lists and Tuples?\", \"answers\": [\"Hi Grace,\\nA guest is considered fashionably late:\\n-if they arrived after at least half of the party's guests:\\narrivals.index(name) >= (len(arrivals)/2),\\nbeing (len(arrivals)/2 index of guest arrived when exactly (including him) half of invited guests had been already arrived;\\nif the guest is not the very last guest:\\narrivals.index(name) != len(arrivals) - 1,\\nbeing len(arrivals) - 1 index of last guest. This line of code would work too with < instead of !=.\\nAbove you can see my solution, some line of code bigger than the Kaggle one, maybe you'd prefer it:\\ndef fashionably_late(arrivals, name):\\n    \\\"\\\"\\\"Given an ordered list of arrivals to the party and a name, return whether the guest with that\\n    name was fashionably late.\\n    \\\"\\\"\\\"\\n    if arrivals.index(name) < (len(arrivals)-1) and arrivals.index(name) >= (len(arrivals)/2):\\n        return True\\n    else:\\n        return False\", \"the blackjack question in loops and list can you explain what is happening there\", \"i also didn't understand a single thing about the blakjack..can someone please explain it?\", \"Hi,\\nI got same problem\\u2026 Never played at blackjack! But don't worry. For what is needed in Python lessons, you have to focus on the value of each card:\\n\\nYou have to count the value of each card of you hand: the sum of those values must be less or equal to 21. If sum is greater than 21, you lose. Aces are a little tricky: they can count as either 1 or 11, it depends: if you have [1,2,A], sum will be 1+2+11=14. If you have [Q,2,A], sum would be 10+2+11=23 > 21, but in this case, you have to count ace as it is valued 1, in order to not exceed the sum limit of 21. If you get [A,A], sum=11+11=22>21, so, in order to not exceed 21, you will count one of those two aces as 1, and the sum is 11+1=12. So, in general: if sum could exceed 21 and you got aces, switch their value from 11 to 1 in order to not exceed the limit of 21, if possible (it's not always possible).\", \"the blackjack question in loops and list can you explain what is happening there\\nDon't worry about questions about blackjack in Loops. You aren't going to need a good understanding of blackjack until you do exercises for last Python lesson, Working with External Libraries\", \"My understanding was from the one time I played blackjack at a casino.\\nIf the sum was below a threshold value, I'd continue to hit. Else I'd stay. I used to set this threshold to 17. I tried the same logic here (with a simple if else condition) with simulation giving a 40% win rate.\\nI was trying to understand how we'd use the 3 arguments apart from player_total (dealer_total , aces_low and aces_high) in decision making of this optional exercise in boolean conditions. Any hints/suggestion on using these variables in decision making in this optional exercise would be great.\"]}, {\"question\": \"Hey, quick question. I'am pretty new to python and I'am struggling at this course should I look for different resources to help me get started? Any that ye would reccomend? Any advice or help would be appreciated, just getting started.\", \"answers\": [\"No,\\nDon't looking for other resources.\\nKaggle is the world largest Data Science community.\\nEven also I started with kaggle when i was newbie in python\\nNow you can see My Profile Here \\ud83d\\ude42\", \"May I know what kind of resources youre looking for?\\nIf its for learning Python you may check out towardsdatascience publication! They have lots of resources for you to read and get going.\\nIf you're looking for ML you may always check out Coursera!\", \"HI Tiernan Burke,\\nI started learning python exactly one year ago, coming from non programming background. Now I am still learning , but very much comfortable. while I don't know if i ever used only one source, but getting hands dirty and trying to leaning from mistakes has helped me a lot. copy errors at end and post to online , will never disappoint you; you always get an answer\\nFew resources like www.geeksforgeeks.org, https://www.w3schools.com/python/ .. are the sources that help me in my journey. I also took few courses from Udemy and Udacity. As I said, I am still learning, but just keep practice and never get tired of asking questions online.\\nWhat motivated me to learn python; my background in Mathematics and my jobs as data analyst has motivated me to learn new ways of data visualization ,data manipulation and ML, and the fancy of venturing into the world of data science.\", \"Don't stop\\u2026 Just Keep learning @omarabdi\"]}, {\"question\": \"How can we reset a notebook to its original state? I'm doing the intro to Python course and it is stuck at 67% complete for one of the tutorials. There are no hints or tips for that section. I saved the notebook but now I'd like to reset it so I can see the original code. I can only delete cells and not the whole notebook (AFAIK).\\nI'd like to be able to restart that practical.\", \"answers\": [\"i dont think we can\", \"we can only delete the notebook or if u want to use the 1st version you can do that @burdgis\", \"Right! I think it'll work.\", \"Thanks @shubrajain99 that works. I had to find my notebooks through my profile (dashboard) and delete the saved notebook there.\"]}, {\"question\": \"Hi there! I was working on the final exercise \\\"Working with External Libraries\\\" which stated there are 4 questions, but I can only see 3 - after I have completed the 3 questions, it only shows 67% completion. Have I accidentally deleted something?\", \"answers\": [\"Make sure you have executed even the code cells for the optional assignments also\", \"@philipwangfeike you can checkout my notebook\\nhttps://www.kaggle.com/shubrajain99/exercise-working-with-external-libraries\\npls do upvote if it helps.\\nbtw there are only 3 ques.\", \"I've executed all cells and also tried running all cells, but it's still stuck at 67%; also it states at the beginning that there are four questions, but I could only find three.\"]}, {\"question\": \"Amazing! the way kaggle works while teaching a coding course. I get more interest now in improving my python skills. Thank you kaggle.\", \"answers\": [\"Exactly, @rajkumarl\\nI learn a lot of thins and new concepts from kaggle and I got 3X Expert in the mean-time.\\nLook at my profile Here\"]}, {\"question\": \"Thank you for this learning opportunity, Colin Morris and the Kaggle team.\", \"answers\": []}, {\"question\": \"I really like this course. It's a little bit hard, but you don't need to worry about it.\\nRemember one thing, everything is important and we need to work for that particular thing.\\nSo Don't stop, Keep Learning. And do something Great. \\ud83d\\ude0e\", \"answers\": []}, {\"question\": \"3.\\na) Add parentheses to the following expression so that it evaluates to 1.\\nq: 5 - 3 // 2\\nmy answer: (5 - 3) // 2\\nbut q asked me # Check your answer (Run this code cell to receive credit!)\\nso I wrote q3.a.check()\\nbut it didnt work!!! and show some codes\\nalso i did same for part 3-b q3.b.check() but its working.\\nwhats wrong here?!!\\nCapture.JPG\", \"answers\": [\"Before 0. there is below code:\\nfrom learntools.core import binder; binder.bind(globals())\\nfrom learntools.python.ex1 import *\\nprint(\\\"Setup complete! You're ready to start question 0.\\\")\\nPlease run that code block, it will setup the questions,i.e. q1, q2, etc.\\nThen run your code again. :)\"]}, {\"question\": \"Hi, I was doing question 2 in Strings and Dictionaries and came up with this solution:\\n\\nIs there any way to more concisely ignore punctuation besides using .replace() 3 times? Or is there a way to use .strip() to do this?\", \"answers\": [\"doc_list = doc_list.replace( ' , ' , ' ' )\\nThis will replace all the commas in the list with a blank space\", \"I tried using regex,\\nimport re\\nre.sub(\\\"\\\\,|.\\\", \\\"\\\", word)\"]}, {\"question\": \"good basic course\", \"answers\": []}, {\"question\": \"question about Monte Carlo method in lists and list comprehensions exercise to calculate slot machine average payout . I wrote the following code and was hoping to generate a random win between 0(inclusive) and infinity but the infinity character \\u221eis not recognized in python. what is the limit that others used . import random\\ndef estimate_average_slot_payout(n_runs):\\n\\\"\\\"\\\"Run the slot machine n_runs times and return the average net profit per run.\\nExample calls (note that return value is nondeterministic!):\\n>>> estimate_average_slot_payout(1)\\n-1\\n>>> estimate_average_slot_payout(1)\\n0.5\\n\\\"\\\"\\\"\\nwin = 0\\nfor i in range(n_runs):\\nwin1 = random.uniform(0,9999999999999999999999999999)\\n#print('win is ', win1)\\nwin = win1 + win\\n#print ('total win is ', win)\\nprint ('total profit is', win - n_runs)\\nreturn (win - n_runs)/n_runs\\nprint(estimate_average_slot_payout(int(input('enter number of runs : '))))\", \"answers\": [\"Any thoughts anyone?\", \"You can use range so that you don't need to put limit.\\nfor i in range(n_runs):\\nwin=win+1\\nreturn win/n_runs\", \"I see that you are using a random function for the wins. You should use the play_slot_machine() function above it for the same.\"]}, {\"question\": \"Hello, I'm having trouble with the course credit. I have finished everything in the course but the overall course progress is stuck at 98%. It suggests that Exercise 7 is incomplete (67%) but finishing all of these exercises again still does not bump it up to 100%. Is there something I'm missing here?\", \"answers\": [\"I think so. You can pass the exercise if all the sub-exercises were correct.\", \"Is there a way to check which question it considers incomplete? I just ran every code block in Exercise 7 again using the \\\"Run All\\\" button, which would include the \\\"# Check your answer (Run this code cell to receive credit!)\\\" blocks. I also checked my solutions against the official solutions. Finally, I made sure to scroll all the way to the bottom in case it measures that. It still says 67% complete.\", \"Oh, that is so weird. Maybe you could have a look at my exercise 7.\\nMy exercise 7\", \"Thanks so much, that fixed my problem! The line \\\"q3.check()\\\" was somehow missing in my answer.\", \"String and dictionary: exercise 3\\nPlease share the solution.\\nThanks\", \"Thank you, I had the same issue of being stuck at 67%. Adding q3.check() successfully completed the course. \\ud83d\\udc4d\"]}, {\"question\": \"I found a strange spelling. Can anyone help to fix it? Check the image for details.\\nkaggle_python_course_text_issue.png\", \"answers\": []}, {\"question\": \"The working with External Library is kind of difficult to understand. any suggestion to make a novice get more in-depth in this?\", \"answers\": [\"I suggest you complete the courses provided by kaggle if you're stepping into data science for the first time. For external libraries i suggest you go though the documentation of the libraries it'll be helpful. You can also learn how people use these libraries by learning from the public kernels provided by them.\"]}, {\"question\": \"hello,\\ni want help,\\nactually i am new to kaggle and was doing a free course but now i'm stucked in between.\\nthe notebook says to use the #hint function but honestly i dont know how to use it, please someone help me!!\", \"answers\": [\"Hello! You just need to erase the \\\"#\\\" from the line, and then click the Run button.\\nThat symbol is acting as a way to turning the code line into a comment, so in order to see the hint or the solution just delete it\", \"Just basically uncomment, or take off # before the hint. i.e\\nq5.hint()\"]}, {\"question\": \"Hello guys, I think I have the solution for question 4 in Conditionls and booleans section, but it just doesn't show it's correct. Can someone tell me what is the problem?\\nCapture.PNG\", \"answers\": [\"Hi,\\nYou missing something here. Question 4 in Booleans and Conditionals will check the function concise_is_negative(number). You have not defined the function yet.\"]}, {\"question\": \"Useful course, thanks!\", \"answers\": []}, {\"question\": \"A great course with helpful hands on exercises. Thanks Kaggle Team \\ud83d\\udc4d\", \"answers\": []}, {\"question\": \"Thanks for designing such a useful and interesting python crash course!\", \"answers\": []}, {\"question\": \"Hello, I just read up on \\\"Tuples\\\" in the tutorial \\\"Lists\\\" and I don't get how it provides insight on the \\\"Stupid Python Trick\\u2122\\nfor swapping values for variables, like under:\\na = 1\\nb = 0\\na, b = b, a\\nprint(a, b)\\ncan anyone explain please?\", \"answers\": [\"I have the same problem, but I think the basics are hidden in the line\\n\\\"t = 1, 2, 3 # equivalent to above \\\" -> meaning \\\"t = (1, 2, 3)\\\" and a tuple.\\nso:\\na,b = (b,a) = (0,1).\\nThe step I do not understand is the way Python understands the part on the left. The example with the \\\"numerator, denominator = \\\" shows you can declare two variables like this (not explained further). Also Python \\\"seems to be capable\\\" to link it to the two values of the tuple (also not explained).\\nIt looks like the math teacher line \\\"and now you see\\\" \\u2026 exactly where the magic is hidden.\", \"That \\\"Stupid Python Trick\\u2122 is quite simple.\\nEx:- 1\\na = 1\\nb = 0\\na, b = b, a\\nprint(a, b)\\nOutput = 0 1\\nWill swap the values as the variables on the left simply point to the values of the variables on right. Here, comma act as a separator between the values on the left and on the right. As you must have read in lists and tuples. Like it is done here,\\ne.g.\\nmy_list = [ 1,2,3,4]\\n        a, b, c, d = my_list\\nNote that comma works as the separator.\\nEx:- 2\\na = 1\\nb = 0\\na = b\\nb = a\\nprint(a, b)\\nOutput = 0 0\\nIn other programming languages like c and c++ we can't use this type of swapping as they are compiled languages and compile the entire program at once. Where as python being an interpreted language, dynamically executes a line at a time. Hence, in the first example it swaps the values (actually points to the object containing the value) and in the second example it simply assigns the value on the right to the variable on the left using the assignment on the left.\\nThis is my first try at answering to questions in forum. If anything is wrong please correct it ;-)\", \"Hi Shivam,\\nThanks for the insightful explanation.\\nThe main point it brings me is that you can list multiple variables on the left of the \\\"=\\\" and that this positioning is magically linked to the left. As one that was mostly trained in Pascal, bash and SQL this is not what I ever met before.\", \"Maybe this is a kinda built-in syntax. Just remember it :)\", \"It's too simple buddy, (a, b) = (b, a)\\nSimple a = b and b = a.\\nHope you understand\"]}, {\"question\": \"Hello guys \\ud83d\\udc99 I just updated mu work here \\ud83d\\ude0a\\nLook at my Updated DataSets for Disease\\nAnd Kernal Notebooks\\nPlease upvote my work\\nThanks\", \"answers\": []}, {\"question\": \"It's so useful for learning Python\", \"answers\": []}, {\"question\": \"The Python course is great at spinnig fine. Good job Kaggle people \\ud83d\\ude09\", \"answers\": []}, {\"question\": \"its' very useful thanks\", \"answers\": []}, {\"question\": \"The second and third challenge is too difficult for beginners. It has many concepts like enumeration and rstrip which wasn't covered in the tutorial. I think Kaggle should make changes to this section of the course\", \"answers\": []}, {\"question\": \"I believe there is discrepancy between question and solution for Question 6. The question is asking to count the number of times each word has appeared in the description. So something like\\nreviews[\\\"countf\\\"] = reviews.description.str.count(\\\"fruity\\\")\\nreviews[\\\"countt\\\"] = reviews.description.str.count(\\\"tropical\\\")\\ndescriptor_counts = pd.Series([reviews.countt.sum(), reviews.countf.sum()], index = [\\\"tropical\\\", \\\"fruity\\\"])\\nwould address the task required. However, the solution provided (of type x in list) only counts the number of rows, where each word was mentioned at least once. This is perfectly fine, and may even be a better measure if one wanted to find out the number of wines that were fruity and tropical (assuming wines are mostly either fruity or tropical). But the issue is that the question clearly asks for \\\"how many times each of these two words appears in the description column in the dataset.\\\"\\nI believe the question should be changed to match the solution better.\", \"answers\": []}, {\"question\": \"I have completed the second lesson \\\"Functions and Getting Help\\\" but in home page it is not showing as completed. Am I missing something ? Thanks for your help.\", \"answers\": [\"This comment was deleted.\"]}, {\"question\": \"Hello, I\\u2019m having a problem with the final exercise, data visualisation, I hit the delete key on the feedback code and now just get errors. There isn\\u2019t any undo key. Is there a way to recover this code? Or can someone tell me what I need to input? Thanks\", \"answers\": [\"@stuart2020 you can try reloading it.\", \"Fix the problem in the end by copying the code from first exercise in the course and changing the number from 1 to 7. Then exercise ran with no problems. Tried to reload but the code didn\\u2019t return. Thanks for the suggestion.\"]}, {\"question\": \"I have a question for Python 4 List q5\\n(my code has error message: TypeError: list indices must be integers or slices, not tuple):\\ndef fashionably_late(arrivals, name):\\n\\\"\\\"\\\"Given an ordered list of arrivals to the party and a name, return whether the guest with that\\nname was fashionably late.\\n\\\"\\\"\\\"\\nif len(arrivals)%2 == 0:\\nreturn arrivals[len(arrivals)//2+1, -1].count(name) >0\\nelse:\\nreturn arrivals[len(arrivals)//2+2, -1].count(name) >0\\nI got stuck on how to create a shorter list of names who are fashionably late.\\nThanks!\", \"answers\": [\"1. To create list of names who are fashionably late, use colon \\\":\\\" instead of coma \\\",\\\". And also if the len(arrivals)%2 == 0 you don't have to add +1 for the start index.\\nSo, to create list of names who fashionably late if len(arrivals)%2 == 0, your code should be:\\narrivals[len(arrivals)//2: -1]\\n2. The function main purpose is to check whether 'name' is in the list. It must return a boolean (True of False). So, your overall code must be:\\ndef fashionably_late(arrivals, name):\\n    \\\"\\\"\\\"Given an ordered list of arrivals to the party and a name, return whether the guest with that name was fashionably late.\\n    \\\"\\\"\\\"\\n    if len(arrivals)%2 == 0:\\n        return name in arrivals[len(arrivals)//2: -1]\\n    else:\\n        return name in arrivals[len(arrivals)//2+1: -1]\"]}, {\"question\": \"QUESTION 5 from Lists exercise\\nWe're using lists to record people who attended our party and what order they arrived in. For example, the following list represents a party with 7 guests, in which Adela showed up first and Ford was the last to arrive:\\nparty_attendees = ['Adela', 'Fleda', 'Owen', 'May', 'Mona', 'Gilbert', 'Ford']\\nA guest is considered 'fashionably late' if they arrived after at least half of the party's guests. However, they must not be the very last guest (that's taking it too far). In the above example, Mona and Gilbert are the only guests who were fashionably late.\\nComplete the function below which takes a list of party attendees as well as a person, and tells us whether that person is fashionably late.\\nin above question from the series the solution provided is\\n1 def fashionably_late(arrivals, name):\\n2 \\\"\\\"\\\"Given an ordered list of arrivals to the party and a name, return whether the guest with that\\n3 name was fashionably late.\\n4 \\\"\\\"\\\"\\n5 order = arrivals.index(name)\\n6 return order >=len(arrivals) / 2 and order != len(arrivals) - 1\\n7 pass\\nCheck your answer\\nq5.check()\\nhere is my doubt in line 6 as there is nothing mentioned about the datatype of len(arrivals)/2 it will take the round of that which is 7/2=3 not 3.5 as it will take by default datatype as int() not float() in this case from above question \\\"may\\\" will also be considered as late which will be wrong i guess\\nplease clarify my doubt am i understanding it wrong or you think the same\", \"answers\": [\"\", \"In Python, if you do 7/2(Lets say) then it will be 3.5. This operation is called true division. If you want the integer value, you need to do 7 // 2. This operation is called floor division.\\nHope it helps.\", \"Bro, I think return data type doesn't matter, as in the question it is clearly mentioned that only 2 people are fashionably late and the list is already sorted with the time of arrival so 1st person in the list came 1st and the last person came in the last.\\nlength of the list is 7 half will be 3.5\\nit is returning true iff index value is greater than 3.5 but less than 6 (as 7-1=6)\\nso we will get true only in case of an index value of 4 and 5.\\nPlease check the attached image for more clarification\\nalso see the output section\\nHope it was helpful\\nPeace Out\\nDoubt.jpg\"]}, {\"question\": \"If anyone is looking for another source of small, engaging coding challenges I recommend Challenge Rocket website. I described a little bit more about what it offers in a separate post in the Getting Started section of the discussion forum. Hope you'll find it useful \\ud83d\\ude0a\", \"answers\": []}, {\"question\": \"Very good course work and starting on Python \\u2026 exercises with spice levels !!!\\nTo get zero output: 8 - 3 * 2 - 1 + 1\\nHint was to use multiple parentheses and solution was (8 - 3) * (2 - (1 + 1))\\nOne more possible solution is 8 - 3 * 2 - (1 + 1)\", \"answers\": [\"Yes, There are lots of way to get the same output.\\nYou can try multiple way to get same results.\"]}, {\"question\": \"Hi All,\\nis this looking right? why is it said \\\"NameError\\\" but scripted as the way it was \\\"q1.check\\\"?\\nNameError Traceback (most recent call last)\", \"answers\": [\"@moz999\\nq1.check()\\ntry this?\\nlet me know if it works. :)\"]}, {\"question\": \"In Researcher problem of Strings and Dictionaries, the output is not coming\", \"answers\": []}, {\"question\": \"Thanky kaggle Team for this best python courses :)\", \"answers\": []}, {\"question\": \"Hello @alexisbcook I am new in Kaggle, I get a problem in python exercise: functions and getting helps,what should I do to complete the exercise I tried to overwrite the code but the progress is still not 100% ..I will appreciate any kind of help or explanation\", \"answers\": [\"hi ,what issues you are facing !\\nhave you tried run all command?\"]}, {\"question\": \"Hello everyone! Actually my question is I can't understand after completing my coding it is not showing 100%\\u2026How could I understand which part need to complete then it will complete 100 % ??\", \"answers\": [\"@payelpatra\\nrun \\\"run all\\\" or send the screenshot of the incomplete exercise for me to check if the problem is still there\"]}, {\"question\": \"Hello, I have passed all the questions of Booleans and conditions lesson, but I'm still 88%!\", \"answers\": [\"Please share the screenshot.\\nMay be you have missed running them all in one go.\\ntry run all and then save version.\\nFor any help ! you can check my notebook\\nhope this helps !\\npls upvote if this helps you\", \"Check all of qx.check() in your sub_exercises. I guess you delete something by mistake.\"]}, {\"question\": \"please,say more about abs() in python\\n9\", \"answers\": [\"just type\\nhelp(abs)\"]}, {\"question\": \"I have a doubt about word_search function. I copied the same function to my local machine and it is running just fine. When I am running it in the online notebook it gives me a error that my answer is incorrect.\", \"answers\": [\"there may be some hidden test cases ! do try all .\\nAll the best\\nhope this helped u\\nDo pls upvote if this helped\"]}, {\"question\": \"Hi,\\nI don't know if I'm doing something wrong, but the the progress for my first exercise is not showing up even though I've completed the exercise and submitted.\\nIssue With Hello Python.PNG\", \"answers\": [\"After submission, you need to commit it.\\nFirst run all then click on save version.\\ndialog box appears -> click on commit (second option)\\nhope this helps!\\npls upvote if this helped.\"]}, {\"question\": \"Nice course! Really appropriate for a beginner. I have some experience in C and C++, this course was really useful to understand the Python MO!\", \"answers\": [\"Yeah, And it's easy to learn.\", \"I am in the same boat. It's a nice course!\"]}, {\"question\": \"couldnt understand this ^\", \"answers\": [\"I am not yet 100% conversant with the syntax\\u2026but this is an example of using the string format method. The curly brackets are a place holder. When the string is formated the first curly bracket is replaced by the value of 'planet; (it is also right justified with 10 character spaces total) and the second curly bracket is replaced by the value of 'initial'\\nHere is a place for information:\\nhttps://docs.python.org/3/library/stdtypes.html#str.format\\nI think there is also some list comprehension happening.\"]}, {\"question\": \"nice stuff !\\nLinear Regression From Scratch\\nhttps://www.kaggle.com/rahulrajpandey31/diabetes-analysis-linear-reg-from-scratch\\n**Numpy Basics **\\nhttps://www.kaggle.com/rahulrajpandey31/numpy-basics-for-data-science\", \"answers\": []}, {\"question\": \"In the last blackjack question why aces -=1 is used when we are Upgrading an ace from 1 to 11??\", \"answers\": [\"Without aces -= 1, the while loop would iterate and increase total by 10 in each iteration as long as the total is <= 21, even if the player did not have any aces!\\naces is used as a kind of counter here. For example, if the payer has 2 aces, then the loop may iterate max. 2 times. This is achieved by decreasing aces by 1 (aces -=1) in each iteration and checking for aces > 0 in the condition!\", \"I also have question about this exercise:\\nWhy would someone receive a hand like this:\\nhand_1=['J', 'A', 'A', '2']\\nTo me it doesn't make sense. As soon as I recieve a Jack and an Ace I count a total of 21 points. I would not ask for another card to be dealt. Am I wrong?\", \"I think you are right. Is this example of a hand somewhere found in the exercises? Anyway: It is still a valid hand so a program should be able to handle it.\", \"Unfortunately \\\"Yes\\\". I went down a different route with my program and wasn't able to handle this case right at first. While trying to fix it I realized that I made a wrong asumption about the Inputdata. Thanks for your answer though!\", \"In case when there are more that one aces on hand we don't want to count all as 11's. Therefore, in a while loop we need to gradually increase ace points. For example, hand_1 = ['A', 'A', '9'] gives us 11 points total and aces = 2. So the while loop adds 10 point to get total = 21 and stops at it leaving the second 'A' as 1 point.\"]}, {\"question\": \"In exercise of 7th module, how are we supposed to check the 1st and 2nd questions?\\nI have passed the 3rd question and stuck at 33%.\", \"answers\": [\"you need to add q2.check() at the end of second code block\", \"Add q1.check() and q2.check() at the end of first and second code block respectively\"]}, {\"question\": \"This is a useful quick intro!\", \"answers\": []}, {\"question\": \"Exercise: Functions and Getting Help\\nI did not understand the example, once I am getting 0.0\\nround(338.424, ndigits=-3)\\n0.0\\nBut in the example shows 338.000 as return.\\nThanks\", \"answers\": [\"If you use -3 then it will round to the left hand side of decimal. In the example there is typo.\", \"This comment was deleted.\", \"To figure out what place value this number is being rounded to, you must in your mind, move the decimal place 3 digits to the left (because ndigits is negative). In your mind, the number would look like this: .338424. Now, whatever place value is to the left of that decimal point is the place value that you are rounding to. In this case, round(338.424, ndigits=-3) is rounding to the \\\"thousands\\\" place value. So, 338.424, when rounded to the nearest \\\"thousand\\\" would result in 0. This makes sense because 388 is definitely closer to 0 than it is to 1,000. Does this make sense?\\nSimplified Explanation\\nWhen ndidgets is positive, for instance 2, round to the place value that would be to the right of the decimal point if the decimal point was moved to the right 2 times - the hundredths place value.\\nWhen ndidgets is negative, for instance -2, round to the place value that would be to the left of the decimal point if the decimal point was moved to the left 2 times - the hundreds place value.\", \"I made a typo! Oops!!! Here's the correct way to think about it!\\nWhen ndidgets is positive, for instance 2, round to the place value that would be to the LEFT of the decimal point if the decimal point was moved to the RIGHT 2 times - the hundredths place value.\\nWhen ndidgets is negative, for instance -2, round to the place value that would be to the LEFT of the decimal point if the decimal point was moved to the LEFT 2 times - the hundreds place value.\"]}, {\"question\": \"Hello\", \"answers\": []}, {\"question\": \"hello\", \"answers\": []}, {\"question\": \"I'm doing the Exercise: Syntax, Variables, and Numbers from the Python course and I find that none of the code cells in the Notebook run. I keep pressing the play button but nothing happens. Been over a week now. Any ideas what I could be missing?\", \"answers\": [\"have u run the first code that is the setup code?\"]}, {\"question\": \"I deleted a code cell which had an excercise to be completed how do I get that back?\", \"answers\": [\"yea I also would like to know how to reset the exercises for practise purposes; without deleting cookies for example\"]}, {\"question\": \"I have a problem in (Exercise: Booleans and Conditionals) question 7 which is optional , please help me to solve out this question\", \"answers\": [\"\", \"def should_hit(dealer_total, player_total, player_low_aces, player_high_aces):\\nif dealer_total <= player_total and player_total >= 15:\\n    return False\\n\\nelif dealer_total >= player_total and player_total <= 15:\\n    return True\\nelif dealer_total >= player_total and player_total >=15:\\n    return True\\nif player_total <= 21:\\n    return True\\nq7.simulate(n_games=50000)\\nI tried with the above code and the simulation result was 42.1 %\", \"I tried many codes and I think this is best code among them but still cant get simulation result more than 42 %\\nif player_total<=11:\\nreturn True\\nelse:\\nreturn False\", \"I'm thinking we should be using the player_low_aces and player_high_aces values, but the exercise doesn't explain whether player_total includes them in it's count, or not. I guess we could assume they are included? A bit confusing.\\nBy the way, very nice course. Thank You!\", \"Checking again this is 'defined' in the comment block example. Although it would have been clearer if it was defined in the problem statement:\\n\\\"\\\"\\\"\\nFor example, if the player's hand is {A, A, A, 7}, we will count it as 11 + 1 + 1 + 7,\\nand therefore set player_total=20, player_low_aces=2, player_high_aces=1.\", \"The best I could get is with this simple condition and it was 42.3:\\nreturn player_total < 15\\nI tried different thresholds but actually there was not much difference in the results with:\\nreturn player_total < 16\\nor\\nreturn player_total < 14\\nand return player_total < 15\"]}, {\"question\": \"Hello everyone,\\nIn the Strings and Dictionaries exercise no. 2, how is this:\\nnormalized = [token.rstrip('.,').lower() for token in tokens]\\ndifferent from the following:\\nfor token in tokens:\\n(indent here)normalized = token.rstrip('.,').lower()\\nThank you!\", \"answers\": [\"Hi Michael, the first one is creating a list and assigning it list to 'normalized' variabel, and second is just assigning a string value for 'normalized', replacing a new value in each iteration. If you want to do that without using list comprehension syntax, you need to create this list explicitly\\u2026\\nnormalized = []\\n\\nfor token in tokens: \\n    normalized.append(token.rstrip('.,').lower())\", \"Thank you for replying. I tried it out, but the answer comes out different. Using the list comprehension, the output is [0], whereas with the explicitly done for loop you showed, output is [0,1,1,1,2].\", \"You need to keep the other parts of the solution, @michaellflores, as the following code\\u2026\\ndef word_search(documents, keyword):\\n    indices = []\\n    # Iterate through the indices (i) and elements (doc) of documents\\n    for i, doc in enumerate(documents):\\n        # Split the string doc into a list of words (according to whitespace)\\n        tokens = doc.split()\\n        # Make a transformed list where we 'normalize' each word to facilitate matching.\\n        # Periods and commas are removed from the end of each word, and it's set to all lowercase.\\n        normalized = []\\n        for token in tokens:\\n            normalized.append(token.rstrip('.,').lower())\\n        #normalized = [token.rstrip('.,').lower() for token in tokens]\\n        print(normalized)\\n        # Is there a match? If so, update the list of matching indices.\\n        if keyword.lower() in normalized:\\n            indices.append(i)\\n    return indices\\nJust replacing that list comprehension for\\u2026\\n    normalized = []\\n    for token in tokens: \\n        normalized.append(token.rstrip('.,').lower())\\nI tested and it brings the correct result. I hope it helps.\", \"Thank you so much, Bruno! I finally understood it.\"]}, {\"question\": \"Hello everyone!\\nI wanna do the exercise of the last part, \\\"working with libraries\\\" but nothing shows up and I don't know actually how to fix it, because I don't know the problem.\\nSo any help would be highly appreciated.\\nHere's how I see the page: https://ibb.co/5L2BFCh\", \"answers\": []}, {\"question\": \"Hi guys\\nCould someone explain me how the function lambda works? I already read some things about it, but I still do not understand.\\nThanks\", \"answers\": []}, {\"question\": \"While I am in part 3 of the Titanic tutorial, and trying to run this code on my notebook.\\nwomen = train_data.loc[train_data.Sex == 'female'][\\\"Survived\\\"]\\nrate_women = sum(women)/len(women)\\nprint(\\\"% of women who survived:\\\", rate_women)\\nI got this error, Please someone help me out what the problem is here? and how to get rid of it?\\nKeyError Traceback (most recent call last)\\n/opt/conda/lib/python3.7/site-packages/pandas/core/indexes/base.py in get_loc(self, key, method, tolerance)\\n3079 try:\\n-> 3080 return self._engine.get_loc(casted_key)\\n3081 except KeyError as err:\\npandas/_libs/index.pyx in pandas._libs.index.IndexEngine.get_loc()\\npandas/_libs/index.pyx in pandas._libs.index.IndexEngine.get_loc()\\npandas/_libs/hashtable_class_helper.pxi in pandas._libs.hashtable.PyObjectHashTable.get_item()\\npandas/_libs/hashtable_class_helper.pxi in pandas._libs.hashtable.PyObjectHashTable.get_item()\\nKeyError: 'Survived'\\nThe above exception was the direct cause of the following exception:\\nKeyError Traceback (most recent call last)\\nin\\n----> 1 women = train_data.loc[train_data.Sex == 'female'][\\\"Survived\\\"]\\n2 rate_women = sum(women)/len(women)\\n3\\n4 print(\\\"% of women who survived:\\\", rate_women)\\n/opt/conda/lib/python3.7/site-packages/pandas/core/frame.py in getitem(self, key)\\n3022 if self.columns.nlevels > 1:\\n3023 return self._getitem_multilevel(key)\\n-> 3024 indexer = self.columns.get_loc(key)\\n3025 if is_integer(indexer):\\n3026 indexer = [indexer]\\n/opt/conda/lib/python3.7/site-packages/pandas/core/indexes/base.py in get_loc(self, key, method, tolerance)\\n3080 return self._engine.get_loc(casted_key)\\n3081 except KeyError as err:\\n-> 3082 raise KeyError(key) from err\\n3083\\n3084 if tolerance is not None:\\nKeyError: 'Survived'\", \"answers\": [\"I just ran a copy of that tutorial in a notebook without any problem (all cells). I think the problem in your notebook isn't in this code you posted. Did you run all cells above this one?\", \"Yes, I run all the cells above this code in the sequence. train.csv and test.csv files loaded successfully. but I don't know why this particular code gave error \\u2639\\ufe0f. I tried it several times but faced error every time.\"]}, {\"question\": \"Hi I have question, i always get the similar problem when i try fixing this below code :\\ndef f(x):\\ny=abs(x)\\nreturn y\\nprint(f(5))\\nFile \\\"\\\", line 2\\ny=abs(x)\\n^\\nIndentationError: expected an indented block\\ndef f(x):\\nreturn y=abs(x)\\nprint(f(5))\\nFile \\\"\\\", line 2\\nreturn y=abs(x)\\n^\\nIndentationError: expected an indented block\\ni keep getting the same error. please help how to fix this code.\\nthanks\", \"answers\": [\"Indentation is requested in Python\\u2026\\ndef f(x):\\n    y=abs(x)\\n    return y\\nprint(f(5))\\nThis code bellow is inside your function, so it needs to recive 4 spaces\\u2026\\n    y=abs(x)\\n    return y\\nBut you can also press 'tab' to create an indentation.\"]}, {\"question\": \"reviews['index_backwards'] = range(len(reviews), 0, -1)\\nreviews['index_backwards']\\nwhat does this code do? specifically, \\\"range(len(reviews), 0, -1)\\\" this one\", \"answers\": [\"The following code reverses the index value in your Data Frame or Series. So if suppose you have an index from 1 to 100, it will be reversed from 100 to 1 and will be displayed. So we are basically assigning backward index values to our Data Frame.\"]}, {\"question\": \"please, some one explain me how to code this?\\n\\ud83c\\udf36\\ufe0f\\nNext to the Blackjack table, the Python Challenge Casino has a slot machine. You can get a result from the slot machine by calling play_slot_machine(). The number it returns is your winnings in dollars. Usually it returns 0. But sometimes you'll get lucky and get a big payday. Try running it below:\\nplay_slot_machine()\\nBy the way, did we mention that each play costs $1? Don't worry, we'll send you the bill later.\\nOn average, how much money can you expect to gain (or lose) every time you play the machine? The casino keeps it a secret, but you can estimate the average value of each pull using a technique called the Monte Carlo method. To estimate the average outcome, we simulate the scenario many times, and return the average result.\\nComplete the following function to calculate the average value per play of the slot machine.\\ndef estimate_average_slot_payout(n_runs):\\n\\\"\\\"\\\"Run the slot machine n_runs times and return the average net profit per run.\\nExample calls (note that return value is nondeterministic!):\\n>>> estimate_average_slot_payout(1)\\n-1\\n>>> estimate_average_slot_payout(1)\\n0.5\\n\\\"\\\"\\\"\\npass\", \"answers\": [\"We have a given function called play_slot_machine, wich returns a random value.\\nThe excercise requests us to create another function that gets the mean value of play_slot_machine running it a large numer of times.\\nOur function needs to create a loop that execute the play_slot_machine n_runs times.\\ndef estimate_average_slot_payout(n_runs):\\n    for n in range(n_runs):\\n        play_slot_machine()\\nThan, we need to put every return of play_slot_machine in a list and get the mean value of this list.\\ndef estimate_average_slot_payout(n_runs):\\n    result_list = [] # creates the list\\n    for n in range(n_runs):\\n        # store the result in a variable...\\n        result = play_slot_machine()\\n        # add this result in the list we created...\\n        result_list.append(result-1)\\n        # -1 for the cost\\n        # than, do this again n_runs times\\n     return sum(result_list) / len(result_list) # return the mean value of the list\\nThe excercise also requests us to get an average value about 0.025. So we need to run the function a large number of times.\\nWhen I tried with one billion times I got an aproximated value\\u2026\\nestimate_average_slot_payout(10**9)\\nIt can take a few minutes, but you will get the average.\"]}, {\"question\": \"In the exercise for Lists, why is this incorrect?\\ndef select_second(L):\\n\\\"\\\"\\\"Return the second element of the given list. If the list has no second element, return None. \\\"\\\"\\\"\\nif len(L) < 2:\\n    print (\\\"None\\\")\\nelse :\\n    print (L[1])\\n\\npass\", \"answers\": [\"Can you explain more specifically what's your doubt? In this code above, first we are verifying if the list has a second element (if it has more than 1 element) and if it returns True, the code prints 'None', if returns False, prints the second element of that list (L[1]).\", \"That's also my thought process, but my issue is that the Kaggle exercise deem it Incorrect and I don't quite get why. \\\"Return the second element of the given list. If the list has no second element, return None\\\" is Kaggle's docstring, and I assume my code fulfills what Kaggle requested.\\nAnyway, this is Kaggle's solution:\\nif len(L) < 2:\\n        return None\\n    return L[1]\\nThe only difference I can see is that Kaggle used return syntax - am I incorrect in my answer simply because the Kaggle docstring requested \\\"Return\\\" and not because there's any actual thought process difference?\\nThanks.\", \"Yes, I think it's because you are programming this code inside a function, so if you don't use 'return' command, your result won't be consider as 'correct'. Your answer needs to be returned (not printed) by a function. For us, this two processes are similar, but for Python iterpreter, they aren't related.\"]}, {\"question\": \"Hi,\\nIn the List exercise I encountered with this question,\\nThe next iteration of Mario Kart will feature an extra-infuriating new item, the Purple Shell. When used, it warps the last place racer into first place and the first place racer into last place. Complete the function below to implement the Purple Shell's effect.\\ndef purple_shell(racers):\\n\\\"\\\"\\\"Given a list of racers, set the first place racer (at the front of the list) to last\\nplace and vice versa.\\n>>> r = [\\\"Mario\\\", \\\"Bowser\\\", \\\"Luigi\\\"]\\n>>> purple_shell(r)\\n>>> r\\n[\\\"Luigi\\\", \\\"Bowser\\\", \\\"Mario\\\"]\\n\\\"\\\"\\\"\\nracers[0], racers[2] = racers[2], racers[0]\\nCheck your answer\\nq3.check()\\nbut here while executing the code it gives error of\\nIndexError Traceback (most recent call last)\\nin\\n11\\n12 # Check your answer\\n---> 13 q3.check()\\n/opt/conda/lib/python3.7/site-packages/learntools/core/problem_view.py in wrapped(self, *args, **kwargs)\\n22 def wrapped(self, *args, **kwargs):\\n23 self.interactions[method.name] += 1\\n---> 24 return method(self, *args, **kwargs)\\n25 return wrapped\\n26\\n/opt/conda/lib/python3.7/site-packages/learntools/core/problem_view.py in wrapped(*args, *kwargs) 13 @functools.wraps(fn) 14 def wrapped(args, *kwargs): ---> 15 res = fn(args, **kwargs)\\n16 display(res)\\n17 # Don't propagate the return to avoid double printing.\\n/opt/conda/lib/python3.7/site-packages/learntools/core/problem_view.py in check(self)\\n89 args = ()\\n90 self.problem.check_whether_attempted(args) ---> 91 self.problem.check(args)\\n92 except NotAttempted as e:\\n93 self._track_check(tracking.OutcomeType.UNATTEMPTED)\\n/opt/conda/lib/python3.7/site-packages/learntools/python/ex4.py in check(self, fn)\\n60 copy_for_user_fn = l.copy()\\n61 sol_fn(copy_for_soln_fn) # create desired output for comparison\\n---> 62 user_output = fn(copy_for_user_fn) # also applies swap in this line\\n63 assert(type(user_output) == type(None)), (\\\"Your function should not return anything.\\\"\\n64 \\\" Instead, change the list without returning it.\\\")\\nin purple_shell(racers)\\n8 [\\\"Luigi\\\", \\\"Bowser\\\", \\\"Mario\\\"]\\n9 \\\"\\\"\\\"\\n---> 10 racers[0], racers[2] = racers[2], racers[0]\\n11\\n12 # Check your answer\\nIndexError: list index out of range\\nHere my question is How does list index out of range? isn't is the case that range of the list goes from 0 to 2?\\nwhere I am just swaping the 1st and last element of the list i.e. element of index 0 with element of index 2\", \"answers\": [\"You need to program a function that works for any list size, not only for 3 elements. When you call .check, it tests your code and probably when it gives a list with 1 or 2 elements your code returns this error. Instead of [2], you can use [-1] in reference to the last element.\"]}, {\"question\": \"i need a help for the second exercice in the last tutoriel about librairies\", \"answers\": [\"Hi @akrem008benjamie, note that we have a loop inside a loop, and we are using the i variable to interate both in each element of reange(len(racers), because we are using \\\"for i in range(len(racers)\\\", and racer['items], because we are using \\\"for i in racer['items']\\\". This variables can conflict, because they are stored with the same name. So when you program nested loops is highly recommended to use different variables to control the iteration of each loop.\\nInstead of this code bellow\\u2026\\n    for i in range(len(racers)):\\n        # The i'th racer dictionary\\n        racer = racers[i]\\n        # We're only interested in racers who finished in first\\n        if racer['finish'] == 1:\\n            for i in racer['items']:\\n                # Add one to the count for this item (adding it to the dict if necessary)\\n                if i not in winner_item_counts:\\n                    winner_item_counts[i] = 0\\n                winner_item_counts[i] += 1\\nWe can use\\u2026\\n    for i_1 in range(len(racers)):\\n        # The i'th racer dictionary\\n        racer = racers[i_1]\\n        # We're only interested in racers who finished in first\\n        if racer['finish'] == 1:\\n            for i_2 in racer['items']:\\n                # Add one to the count for this item (adding it to the dict if necessary)\\n                if i_2 not in winner_item_counts:\\n                    winner_item_counts[i_1] = 0\\n                winner_item_counts[i_1] += 1\\nDifferentiating those two variables used to iterate.\"]}, {\"question\": \"Hello everyone, I have already completed my course in Python and I am just here for a brush up\\nSo can someone explain me how the enumerate function works pls ?\", \"answers\": [\"Hello @jeniths. In this page you can find more specific and useful information about enumate. Certainly, you can do a lot of things with enumerate. In the Python course, you use enumerate in a loop to access to the index of a element.\\nTry tris:\\ngrocery = ['bread', 'milk', 'butter']\\nfor item in grocery:\\nprint(item)\\nfor item2 in enumerate(grocery):\\nprint(item2)\\nfor item3, count in enumerate(grocery):\\nprint(item3,count)\\nAs you can see, in the first example, it returns the value of elements in grocery, however if you use enumerate you can obtain the values and its indexes. In the third example, you can see that item3 has the values of grocery and count has the indexes of each one.\"]}, {\"question\": \"The Blackjack question (7) in Booleans and Conditionals almost broke me because I couldn't figure out how to factor in player_low_aces and player_high_aces (also I have never played Blackjack which I think made it harder to come up with a good solution). For anyone else struggling I started with a very simple:\\ndef should_hit(dealer_total, player_total, player_low_aces, player_high_aces):\\nif dealer_total >= 17 and player_total >17:\\nreturn False\\nelif player_total <=17:\\nreturn True\\nThis got me about 39% wins. I tried to add some conditionals using the aces variables as below:\\ndef should_hit(dealer_total, player_total, player_low_aces, player_high_aces):\\nif dealer_total >= 17 and player_total >17:\\nreturn False\\nelif player_total = 11:\\nplayer_high_aces == 11 and player_low_aces == 1\\nelse:\\nplayer_high_aces == 1 and player_low_aces ==1\\nreturn True\\nThis only increased my wins to 40.1% but I am not convinced that I am using the aces variables correctly.\", \"answers\": [\"This comment was deleted.\"]}, {\"question\": \"Hello, I have a problem with first exercise. When I have done all tasks, I can't run a hint or solution, and see the following code. Can somebody help me?\\nNameError Traceback (most recent call last)\\nin\\n3\\n4 # Check your answer\\n----> 5 q0.check()\\nNameError: name 'q0' is not defined\", \"answers\": [\"Hi @kirillchirkin, did you run the setup cell at the beginning of the exercise? Note that if you close the exercise and open it again you need to run the setup again.\"]}, {\"question\": \"Hey, I am stuck at the practice exercise of Lists question no 4 can anybody help?\", \"answers\": [\"where are you stuck ..? can you elaborate .? are you getting any error .?\", \"Can you post the question please @vridhiparmar\"]}, {\"question\": \"I tried to run this code but it tell me that q1 is undefined, Could you help ?\\ndef round_to_two_places(num):\\n\\\"\\\"\\\"Return the given number rounded to two decimal places.\\n>>> round_to_two_places(3.14159)\\n3.14\\n\\\"\\\"\\\"\\n# Replace this body with your own code.\\n\\nreturn(round(num,2))\\n# (\\\"pass\\\" is a keyword that does literally nothing. We used it as a placeholder\\n# because after we begin a code block, Python requires at least one line of code)\\npass\\nround_to_two_places(3.14159)\\nCheck your answer\\nq1.help()\\nq1.check()\\nthis the error msg:\\nNameError Traceback (most recent call last)\\nin\\n14 # Check your answer\\n15 #q1.help()\\n---> 16 q1.check()\\nNameError: name 'q1' is not defined\", \"answers\": [\"You need to run the first code lines where is setting condigurations of Kaggle notebooks. Try to run all the earlier code lines.\"]}, {\"question\": \"Nice! (message must have at least 10 characters.)\", \"answers\": []}, {\"question\": \"Very Good course!!\", \"answers\": []}, {\"question\": \"Good for begginers, thanks\", \"answers\": []}, {\"question\": \"i am not bale to understand the code\\nVariables representing the number of candies collected by alice, bob, and carol\\nalice_candies = 121\\nbob_candies = 77\\ncarol_candies = 109\\nprint(alice_candies+bob_candies+carol_candies)\\nYour code goes here! Replace the right-hand side of this assignment with an expression\\ninvolving alice_candies, bob_candies, and carol_candies\\nto_smash = -1\\nCheck your answer\\nq4.check()\", \"answers\": []}, {\"question\": \"Hi , Today is the first time i am using Python exercise . What does it mean \\\"#q0.hint()\\nq0.solution() \\\" ?\", \"answers\": [\"Hi Deepali @deepalidhanvijay, Welcome to the world of python!\\nThese are local functions made by the course team to give us hint and solution to the question in hand whenever we need them.\\nIn your example, while doing your exercises you can get hint to the question (q0)\\nwhen you uncomment (remove) the # sign infont of the q0.hint and run the code cell\\nIf that is not enough or would like to see the solution given by the instructors you can do so\\nby uncommenting the # infront of the q0.solution\\nGood luck!\"]}, {\"question\": \"Can someone please explain me the solution to this problem (Problem 2) under strings:\\nA researcher has gathered thousands of news articles. But she wants to focus her attention on articles including a specific word. Complete the function below to help her filter her list of articles.\\nYour function should meet the following criteria:\\nDo not include documents where the keyword string shows up only as a part of a larger word. For example, if she were looking for the keyword \\u201cclosed\\u201d, you would not include the string \\u201cenclosed.\\u201d\\nShe does not want you to distinguish upper case from lower case letters. So the phrase \\u201cClosed the case.\\u201d would be included when the keyword is \\u201cclosed\\u201d\\nDo not let periods or commas affect what is matched. \\u201cIt is closed.\\u201d would be included when the keyword is \\u201cclosed\\u201d. But you can assume there are no other types of punctuation.\", \"answers\": [\"Hi @mohangauri, I will try to explain based on the topics.\\n\\\"Do not include documents where the keyword string shows up only as a part of a larger word. For example, if she were looking for the keyword \\u201cclosed\\u201d, you would not include the string \\\"enclosed\\\".\\\". You can solve this issue adding a space in the first character of the string keyword.\\n\\\"She does not want you to distinguish upper case from lower case letters. So the phrase \\u201cClosed the case.\\u201d would be included when the keyword is \\u201cclosed\\u201d.\\\". You can solve this issue with the .lower() method, which convert a string to lower case only.\\nDo not let periods or commas affect what is matched. \\u201cIt is closed.\\u201d would be included when the keyword is \\u201cclosed\\u201d. But you can assume there are no other types of punctuation. With the solution I'm using, you don't need to worry about this issue.\\nThis solution below is different from the author's solution, but also brings a correct result for the excercise with two rows of coding\\u2026\\nkeyword_2 = ' ' + keyword.lower()\\nreturn [doc_list.index(doc) for doc in doc_list if keyword_2 in doc.lower()]\\nNote that I'm using a list comprehension. I suppose that you already learn how to use it in lesson five.\", \"Thank You.\\nI have a little doubt. The specific word 'Keyword' is to be searched or there are some other words specified as keywords.\\nThe question is a bit confusing.\", \"The word to be searched is only the argument received in \\\"keyword\\\".\"]}, {\"question\": \"Help! I completed every tasks but the 7th exercise got no progress at all. This is my link: https://www.kaggle.com/julanove/exercise-working-with-external-libraries. Could someone check it for me. Tks so much\", \"answers\": [\"\\u81ea\\u5206\\u3067\\u4fee\\u6b63\\u3057\\u307e\\u3057\\u305f\\u3002\\u306a\\u305c\\u4ffa\\u3060\\u3051\\u56db\\u3064\\u306e\\u30a8\\u30af\\u30b5\\u30b5\\u30a4\\u30ba\\u304c\\u3042\\u3063\\u305f\\u306e\\u304b\\u308f\\u304b\\u3089\\u306a\\u3044\\u3067\\u3059\\u3002\\u3044\\u3044\\u7df4\\u7fd2\\u3060\\u3063\\u305f\\u3093\\u3060\\u3002\\nFor someone who've been stuck at me. Just save your work, go to here: http://www.kaggle.com/notebooks. Delete [Your Work] and start again that exercise.\", \"from learntools.python import roulette\\nimport random\\n\\ndef my_agent(wheel):\\n    last_number = 0\\n    jula = {}\\n    while wheel.num_remaining_spins() > 0:\\n        if last_number == 4:\\n            # Unlucky! Don't bet anything.\\n            guess = None\\n        else:\\n            guess = -1\\n            temp = sorted(jula, key=jula.get, reverse=True)\\n            for key in temp:\\n                if (last_number == int(key.split('-')[0])):\\n                    guess = int(key.split('-')[1])\\n                    break\\n\\n            if guess == -1:\\n                guess = random.randint(0, 10)\\n\\n        x = wheel.spin(number_to_bet_on=guess)\\n\\n        pair = str(last_number) + '-' + str(x)\\n        if (pair not in jula):\\n            jula[pair] = 0\\n        jula[pair] += 1\\n\\n        last_number = x\\n\\nroulette.evaluate_roulette_strategy(my_agent)\"]}, {\"question\": \"hello\\nThanks for good cource!\\nFor some reason i can't finish 3 lesson (88% only)\\nAlso I lost one task. Can you help me reset tasks and return it to the begining - so I can work on them again\\nOr show how to see history of my changes\\nThank you advanced for help\", \"answers\": []}, {\"question\": \"def fashionably_late(arrivals, name):\\n\\\"Given an ordered list of arrivals to the party and a name, return whether the guest with that\\nthe name was fashionably late.\\n\\\"\\\"\\\"\\nI don't understand this, please help me\", \"answers\": [\"Hello @adeelsherazi. In a earlier statement of that exercise, it is mentioned a meaning of \\\"fashionably late\\\", which corresponds to people which arrive between the person who arrive in the middle (considering the total number of people) and the person who arrived in last place. You need to create a function where you indetify the lenght of people and select people between the half of guests and the person who arrives later.\", \"Hi @adeelsherazi, you need to program a function that return what guests are fashinably late. According to the instructions, a guest is considered fashionably late if he/she \\\"arrived after at least half of the party's guests. However, they must not be the very last guest (that's taking it too far)\\\". So you will receive a list of guests odered by arrive, then you can split this list at half. The second split contains fashionably late guests, except the last one, which isn't fashionably late. If you receive an odd number of guests, you need to consider the split after the middle candidate, because the instruction says \\\"after at least half\\\".\", \"Thanks bro\"]}, {\"question\": \"Exercise 1.2 in Python Course:\\ntemp = a[:]\\na = b[:]\\nb = temp[:]\\nHow is this code wrong and the:\\ntemp = a\\na = b\\nb = temp\\nis correct? Does anyone even checked the content of this courses?\", \"answers\": [\"Hi @dominikstrzalko, maybe it's because your code works only for lists, but the exercise wants a solution that switch values between any object (variable).\", \"Hi @dominikstrzalko. The first example is wrong because in that exercise you are working with only a value, not a list or dataframe. You can use [] when you are working with list or dataframes or other similar objects, but if the value of a is for example 3 (a = 3), you cannot use []. This is the main reason why your example is wrong.\", \"@brunotly I guess that you're right.\\n@vcaquilpan This exercise uses a lists as an example:\\na = [1, 2, 3]\\nb = [3, 2, 1]\\nNot an integer. So I guess that it's not the main reason why my example is wrong. I do know what's the difference between list and a single value \\ud83d\\ude0f.\\nps. I just wanted to say, that assigning variable, is not the best way to swap values in the lists. If you had changed any index of the \\\"temp\\\" variable, you would've also changed the value in the b.\"]}, {\"question\": \"Liking it so far\", \"answers\": []}, {\"question\": \"Can anyone please explain me how this swap code works:\\nx[0], x[-1] = x[-1], x[0]\", \"answers\": [\"This code line change the value of X[0] and X[-1] themselves. Recall that -1 corresponds to the last element of a list and 0 means the first.\\nTry these lines:\\nx = ['pocho','pancho','pepe']\\nprint(x[0],x[-1])\\nx[0], x[-1] = x[-1], x[0]\\nprint(x[0],x[-1])\", \"@vcaquilpan Thanks. Can you please explain how it works and assigns the values so that they are swapped. I am unable to understand the flow of code. I was using the temp variable method to swap.\", \"The basis is that you use the equal symbol to assign the value of the right size to the left size (variable). In your example, you assign two values at the same time, thereby you don't need a temporal variable.\"]}, {\"question\": \"I'm sorry, it's all ok now :) You can delete my first Post on this Forum, thanks\", \"answers\": []}, {\"question\": \"I have completed some exercises, but do not compare the green circle under the heading 'Exercise', what should I do?\", \"answers\": []}, {\"question\": \"hello, I want to make a dogs and cats classifier but i am confused that how to to load dataset in jupiter\", \"answers\": [\"Hello @hareem23. If you want to load data in Kaggle notebooks, you only should create notebook and\\nClick in the right upper corner where appears the text \\\"add data\\\"\\nAfter that, a new windows shows and you can click in \\\"update data\\\"\", \"actually i want it on jupiter\"]}, {\"question\": \"Exercise: Working with External Libraries\\n` results = []\\nfor hand in [hand_1, hand_2]:\\n\\n    hand = \\\" \\\".join(hand).replace(\\\"K\\\", \\\"10\\\").replace(\\\"Q\\\", \\\"10\\\").replace(\\\"J\\\", \\\"10\\\").split()\\n    result = [int(card) if card != 'A' else 1 for card in hand]\\n\\n    if sum(result) <= 11 and 1 in result:\\n        result = sum(result)+10\\n    else:\\n        result = sum(result)\\n\\n    results.append(result)\\n\\nreturn ((results[0] > results[1]) or (results[1]>=21)) and results[0]<22`\", \"answers\": []}, {\"question\": \"Hi everyone,\\nI did not understand this part;\\ntotal += aces\\nwhile total + 10 0:\\ntotal += 10\\naces -= 1\\nreturn total\\nwhy did we use \\\"ace -=1\\\"?\", \"answers\": [\"Hello @leokip. In this case you use \\\"ace -=1\\\" because when you while loop is true, a novel \\\"as\\\" counts as 10, however, before the while loop, you sum \\\"as\\\" as 1, thereby if you while loop is TRUE, apart from changing the value of \\\"as\\\" you need to reduce in 1, due to you summed it in the last step.\"]}, {\"question\": \"I got 41.5 - 42.0% win only with this:\\nif dealer_total > 21: \\n    return False \\nif player_total < 14:\\n    return True\\nelse:\\n    return False\", \"answers\": []}, {\"question\": \"I'm literally starting from scratch. Is Kaggle course on Python really worth my time ?\", \"answers\": [\"Hello @bhanuprasanth2401. I think the answer is yes. In my case, I have done other introductory courses with Python, however, I believe that Kaggle courses give us the main knowledge to learn about the use of Python in data science and ML context. I recommend that you take the courses availables in Kaggle, such as Python, Pandas, Clean Data and others. For me, these courses have been very useful.\", \"The Kaggle Pyhton course is very good, but didn't cover some key concepts like object orientation, which in my opinion is very important to unterstand and write an algorithm. However, it's a good course to start. After you finish it, I would recommend you to study with a more complete Python course. If you search on Kaggle discussions about that, you will find several course suggestions. Answering your question\\u2026 yes, it's worth your time. Note that a great advantage of this course is that you have a community here to ask about any lesson you did'nt understand and contact other users that are studying the same course. Actually this is an advantage of all Kaggle courses.\", \"In addition, I took courses availables in IBM. Here, you have different courses of Python in Data Science context. It is a good complement to your learning path and besides, you can get certifications.\"]}, {\"question\": \"Hie peers,\\nI am a beginner at Kaggle, Kindly help me with this question.\\nThis is my first exercise- Syntax, Variables, and Numbers. Here, I m not getting the correct output.\\nQues: 4.\\nAlice, Bob, and Carol have agreed to pool their Halloween candy and split it evenly among themselves.\\nFor the sake of their friendship, any candies left over will be smashed. For example, if they collectively\\nbring home 91 candies, they'll take 30 each and smash 1.\\nWrite an arithmetic expression below to calculate how many candies they must smash for a given haul.\\nVariables representing the number of candies collected by alice, bob, and carol\\nalice_candies = 121\\nbob_candies = 77\\ncarol_candies = 109\\nCODE:\\nYour code goes here! Replace the right-hand side of this assignment with an expression\\n(alice_candies + bob_candies + carol_candies) % 3\\ninvolving alice_candies, bob_candies, and carol_candies\\nto_smash = -1\\nCheck your answer\\nq4.check()\\nBut when I run this code, it gives me this comment check. Kindly resolve my query.\\nCheck: When you've updated the starter code, check() will tell you whether your code is correct. You need to update the code that creates variable to_smash\\nThank You!!\", \"answers\": [\"Try this:\\nto_smash = (alice_candies + bob_candies + carol_candies) % 3\", \"@r2j1d2 Thnks sir!! it is working\\ud83d\\udc4d\"]}, {\"question\": \"Python Couse, Strings and Dictionaries: I am working through the exercises and am confused by an outcome. For the final two exercises the keyword is 'casino'. 'Casino' is clearly in the document list we are required to search through and meets the requirements given, yet it is expecting a return value of 0, as opposed to 1. Can someone help me see what I am missing here? I appreciate the feedback.\\nA researcher has gathered thousands of news articles. But she wants to focus her attention on articles including a specific word. Complete the function below to help her filter her list of articles.\\nYour function should meet the following criteria:\\nDo not include documents where the keyword string shows up only as a part of a larger word. For example, if she were looking for the keyword \\u201cclosed\\u201d, you would not include the string \\u201cenclosed.\\u201d\\nShe does not want you to distinguish upper case from lower case letters. So the phrase \\u201cClosed the case.\\u201d would be included when the keyword is \\u201cclosed\\u201d\\nDo not let periods or commas affect what is matched. \\u201cIt is closed.\\u201d would be included when the keyword is \\u201cclosed\\u201d. But you can assume there are no other types of punctuation.\\ndef word_search(doc_list, keyword):\\nkw_shown = []\\ncount = 0\\n\\nfor doc in doc_list :\\ndc = doc.split()\\nfor d in dc :\\nadjust = [d.rstrip('.,').lower()]\\nfor adj in adjust :\\nif adj == keyword.lower():\\ncount += 1\\nkw_shown.append(count)\\nreturn(kw_shown)\\nCheck your answer\\nq2.check()\\nIncorrect: Expected return value of [0] given doc_list=['The Learn Python Challenge Casino', 'They bought a car, and a horse', 'Casinoville?'], keyword='casino', but got [1] instead.\", \"answers\": [\"The function returns the list index, not the match count. The zero means the first entry (index = 0) in the doc_list is the only one containing the word casino.\", \"Thank you so much! I was completely overlooking that. Thank you!\"]}, {\"question\": \"hi Everyone I accidentally deleted the length of lists question List and Strings topic and I now can't get it correct. Can you tell me how to complete that section\", \"answers\": [\"Hi @gursimarsahota, you can copy the notebook link and then open it in an incognito window to see the original version.\"]}, {\"question\": \"Hi,\\nI am on Exercise: Booleans and Conditionals and trying to complete the problem with define statement def exactly_one_sauce(ketchup, mustard, onion): My return statement looks like return (ketchup not mustard) or (mustard not ketchup)\\nI am getting an error \\\"invalid syntax\\\". Can anyone explain why is that?\", \"answers\": [\"I just noticed my mistake in my command after making this comment :)\"]}, {\"question\": \"Hi, I'm having a problem regarding the first notebook. I did all the correct solutions required but it always shows it's not completed in the course progress page. I even finished later notebooks without any problem.![https://drive.google.com/file/d/1w7kJSLNX7qlXcDBqn32JyZbGxhQiI1YT/view?usp=sharing](url to embed)\", \"answers\": [\"On the last of the regular questions I see this:\\nCheck your answer (Run this code cell to receive credit!)\\nq3.a.solution()\\nFollowing this, the there is a spicy pepper icon and some more questions that I think are optional. But, if you don't run the above code for question 3, maybe that would cause your problem.\"]}, {\"question\": \"Welcome to the Python course discussion!\\nTo begin, please read our Kaggle Community Guidelines. Then, chat with other learners below!\\nhello, my Q is regarding booleans:\\nwhen we need to return a plain hotdog with no toppings\\nwhy not (ketchup and mustard and onion) is incorrect. I did not understand please explain me\", \"answers\": [\"Hi @preet881997, I suggest you to post the number of the question and the name of the lesson you refer to, so it would easiest to find it in the course and help you.\", \"What you suggest still returns True for cases where only 1 or 2 condiments are chosen.\", \"How does this return true??\", \"This is from Booleans and conditionals and Q5\", \"And the last function in Q5\", \"\\\"not (ketchup and mustard and onion)\\\" will evaluate inside the parentheses first. So it will get \\\"not(False)\\\" (aka True) whenever the person selects only 1 or 2 condiments, but not all three.\\n\\\"not ketchup and not mustard and not onion\\\" is correct\\n\\\"not (ketchup or mustard or onion)\\\" is also correct\"]}, {\"question\": \"Ques-in the following idont get the scond line can anyone explain?\\ndef fashionably_late(arrivals, name):\\norder = arrivals.index(name)\\nreturn order >= len(arrivals) / 2 and order != len(arrivals) - 1\", \"answers\": [\"Hello @rawatsagar.\\nThe second line retrieves the index/position of arriving of a certain person (based on his name) with respect to the all elements in the list of arrivals. In this way, you can use a diferentes name and this retrieves a different Index, to the evaluate that position in the next line.\"]}, {\"question\": \"Hello!\\nIs there a bug with the exercise Notebooks for this course?\\nI am getting the following error is my first exercise declaring color = \\\"blue\\\", checking q0.hint() also returned a NameError: name 'q0' is not defined error\\n`NameError Traceback (most recent call last)\\nin\\n1 # create a variable called color with an appropriate value on the line below\\n2 # (Remember, strings in Python must be enclosed in 'single' or \\\"double\\\" quotes)\\n----> 3 __\\n4\\n5 color = \\\"blue\\\"\\nNameError: name '__' is not defined`\", \"answers\": [\"Maybe you forgot to run the setup code at the top of those exercises?\", \"The comment above is correct, you can solve this running the setup code, it's usually the first cell in Kaggle courses excercises.\"]}, {\"question\": \"Hi,\\nI know this is very basic, but I don't know what I get an error when I run the following:\\nsquares = ['red', 'yellow', 'green', 'purple', 'blue']\\ni=0\\nfor i in squares[i]:\\nprint(\\\"Before square \\\", i, 'is', squares[i])\\nsquares[i] = 'white'\\nprint(\\\"After square \\\", i, 'is', squares[i])\\nI get the error \\\"TypeError: list indices must be integers or slices, not str\\\" in the first print statement . But if I do something different with the same print statment in it I don't get the error:\\nsquares = ['red', 'yellow', 'green', 'purple', 'blue']\\nN=len(squares)\\nfor i in range(N):\\nprint(\\\"Before square \\\", i, 'is', squares[i])\\nsquares[i] = 'white'\\nprint(\\\"After square \\\", i, 'is', squares[i])\\nI know it's just I can't see it and it must be very simple but could someone help, please? Thanks!\", \"answers\": [\"Hello @estitxularralde. In the first case in the for, you go through the elements of the list, which are strings, then \\\"i\\\" takes the value of \\\"red\\\" and then \\\"blue\\\" and so on. I think you don't want this. In the second example, the for goes through the length of the list \\\"squares\\\". So, this is a number and is easier to interpretate. In this case, \\\"i\\\" takes the value of 0 and then 1 and so on.\", \"Thank you! Do you see a way to change the first chunk of code without including range to make it right?\\nI've tried the following:\\nsquares = ['red', 'yellow', 'green', 'purple', 'blue']\\ni=0\\nsquare=squares[0]\\nfor square in squares[i]:\\nprint(\\\"Before square \\\", i, 'is', squares[i])\\nsquares[i] = 'white'\\nprint(\\\"After square \\\", i, 'is', squares[i])\\ni=i+1\\nNow the iteration ends at i=2. Any tips why?\\nUpdate: I just removed [i] in the \\\"for\\\" statement and it works:\\nsquares = ['red', 'yellow', 'green', 'purple', 'blue']\\ni=0\\nsquare=squares[0]\\nfor square in squares:\\nprint(\\\"Before square \\\", i, 'is', squares[i])\\nsquares[i] = 'white'\\nprint(\\\"After square \\\", i, 'is', squares[i])\\ni=i+1\\nMy issue is I don't understand exactly why and that's essential for me in going forward the learning path.\", \"In the first case when you say for square in square[i], the for is based on the first element of your list and as this element is a string (\\\"red\\\"), Python takes the range of values as the number of letter in that string, which are three. That is the reason. If your first element was a longer word, your \\\"for function\\\" would last more.\\nThe correct is use for square in squares, because Python understands that this list has five elements and this is the range that your \\\"for function\\\" will use.\\nIf you have doubts, you can review this including a print of the length of squares.\\nprint(len(squares[i]))\\nprint(len(squares))\\nThe result of the first is 3 and the result of the second is 5.\", \"Thanks for the explanation and your time! It's much clearer now\"]}, {\"question\": \"def multi_word_search(doc_list, keywords):\\n\\\"\\\"\\\"\\nTakes list of documents (each document is a string) and a list of keywords.\\nReturns a dictionary where each key is a keyword, and the value is a list of indices\\n(from doc_list) of the documents containing that keyword\\n>>> doc_list = [\\\"The Learn Python Challenge Casino.\\\", \\\"They bought a car and a casino\\\", \\\"Casinoville\\\"]\\n>>> keywords = ['casino', 'they']\\n>>> multi_word_search(doc_list, keywords)\\n{'casino': [0, 1], 'they': [1]}\\n\\\"\\\"\\\"\\n\\ndic={}\\nz=[]\\nfor word in doc_list:\\n    i=doc_list.index(word)\\n    token=word.split()\\n    new=[j.rstrip(\\\",.\\\").lower() for j in token]\\n    for k in keywords:\\n\\n        if k.lower() in new:\\n            g=z.append(i)\\n            dic[k]= g\\n\\nreturn dic\\nthis is the message being displayed-----\\n***Incorrect: Expected return value of {'casino': [0]} given doc_list=['The Learn Python Challenge Casino', 'They bought a car', 'Casinoville?'], keywords=['casino'], but got {'casino': None} instead.\\n***\\nThis is a problem from the exercise on strings and dictionaries, I couldn't figure out, what's is wrong with the code.\\nI wonder if someone could help me\\u2026.\", \"answers\": [\"Hello @kartikeyasaraswat, you have some problems in your code.\\nIn a first place, when you pass z.append(i) in g is not needed. In fact, in g is not saved the expected result of z. You can directly use z.append(i) and then, dick[k] = z.\\nThis question is a little complex because you need to create a dictionary with the lists of ocurrences. You can use the method suggested by the author using two functions, however, you also can use only one function. I show you this example:\\n`\\ndoc_list = [\\\"The Learn Python Challenge Casino.\\\", \\\"They bought a car and a casino\\\", \\\"Casinoville\\\"]\\n\\nkeywords = ['casino', 'they']\\n\\n#Define function\\ndef multi_word_search(doc_list, keywords):\\n\\n    #It is created the empty dictionary\\n    dic={}\\n    for k in keywords:\\n        #It is created a empty list for each keyword\\n        z = []\\n        for word in doc_list:\\n            i=doc_list.index(word)\\n            token=word.split()        \\n            new=[j.rstrip(\\\",.\\\").lower() for j in token]\\n            print(\\\"new: \\\",new)\\n            print(\\\"k: \\\",k)\\n            if k.lower() in new:\\n                z.append(i)\\n                print(\\\"z: \\\",z)\\n                dic[k]= z\\n    return dic\\n\\n#Test the function\\nmulti_word_search(doc_list,keywords)`\\nThis example can useful to achieve the right answer. It is very important that you go to print your results to understand better your mistakes. As you can see in this example, I change the order of for due is a little easier to start with each keyword.\"]}, {\"question\": \"Hi everyone, I've been stuck with List exercise Q5 for an hour now\\u2026 I even copied and pasted the entire solution and still get an error message\\u2026\\nHere is what I have in the input:\\ndef fashionably_late(arrivals, name):\\n\\\"\\\"\\\"Given an ordered list of arrivals to the party and a name, return whether the guest with that\\nname was fashionably late.\\n\\\"\\\"\\\"\\nno_of_attendees = len(arrivals)\\n# Since indexing in python starts from zero, you have to  increase the index of the given name by one to \\n# match it with the value gotten from len(). Also (no_of_attendees/2) is rounded up to the nearest whole number\\n# in the case of odd number divisions, so that we make sure the given a name is after at least half, in all scenarios.\\n\\nif arrivals.index(name)+1 > (round(no_of_attendees/2)) and (arrivals.index(name)+1) < no_of_attendees:\\n    return True\\nelse: \\n    return False\\nq5.check()\\nI get the following output:\\nIncorrect: When calling your function with arguments [['Adela', 'Fleda', 'Owen', 'May', 'Mona', 'Gilbert', 'Ford'], 'Adela'], Python raised the following exception\\u2026 TypeError: 'list' object is not callable\\nCan somebody help me fix this please?\", \"answers\": [\"I think when you are calling the Function to check your result you are calling it wrong. Try calling your function with this\\nfashionably_late(['Adela', 'Fleda', 'Owen', 'May', 'Mona', 'Gilbert', 'Ford'], 'Adela').\\nyour code works correctly .\", \"I tried adding that line to the code and got the following incorrect output message.\\nIncorrect: When calling your function with arguments [['Adela', 'Fleda', 'Owen', 'May', 'Mona', 'Gilbert', 'Ford'], 'Adela'], Python raised the following exception\\u2026 RecursionError: maximum recursion depth exceeded while calling a Python object\", \"I tried your code and called the function this works fine. Can you compare it to what you are doing .?\\n`def fashionably_late(arrivals, name):\\n\\\"\\\"\\\"Given an ordered list of arrivals to the party and a name, return whether the guest with that\\nname was fashionably late.\\n\\\"\\\"\\\"\\nno_of_attendees = len(arrivals)\\nif arrivals.index(name)+1 > (round(no_of_attendees/2)) and (arrivals.index(name)+1) < no_of_attendees:\\nreturn True\\nelse:\\nreturn False\\nCheck your answer\\nq5.check()\\nname1= fashionably_late(['Adela', 'Fleda', 'Owen', 'May', 'Mona', 'Gilbert', 'Ford'], 'Adela')\\nprint(name1)`\", \"Hi Yogi, appreciate your help. I pasted your code and got the following error.\\nFile \\\"\\\", line 4\\n\\\"\\\"\\\"\\n^\\nIndentationError: expected an indented block\\nI tried indenting after each line with : but I'm still getting the same error message.\", \"oh after pasting the indentation were not pasted correctly, can you ident the if block.!\\nyou can also keep your old code since it runs perfectly.\\nsharing my notebook with you .\\nhttps://www.kaggle.com/yogidsba/exercise-lists/\\nCheck your answer\\nq5.check()\\nname1= fashionably_late(['Adela', 'Fleda', 'Owen', 'May', 'Mona', 'Gilbert', 'Ford'], 'Adela')\\nprint(name1)\", \"So sorry Yogi\\u2026. I don't still don't get where it went wrong. I indented the if block but still get the same error message. I'm new to Kaggle\\u2026 where am I supposed to go in your notebook?\", \"can you click on the link which i shared .?Does it take you to the notebook.?https://www.kaggle.com/yogidsba/exercise-lists/\", \"I played around with the indentations and finally got it correct!!! thank you, Yogi!!\", \"Glad, It worked!\"]}, {\"question\": \"This course is amazing and covers so much things beautifully. And the interface is just awesome <3 i am in love with it its very catchy and ngl at least to me its very attractive and now i will complete all the courses of Kaggle\", \"answers\": []}, {\"question\": \"Hi\\nIt's really nice and clear Python lesson, but I have a question in lesson 5 Loops and List Comprehensions in while loop (I couldn't attach the screenshot) is it correct that i + = 1? Or it suppose to be i = i + 1?\\nThank you\", \"answers\": [\"Hi there,\\nIn that case, both work in a similar way and can help you to solve the question. In simple words, i+=1 goes to add 1 to the variable i, while i = i+1 reassigns the value of i. Here, you have a more complete answer about this theme. It could be a little complicated to understand, but it is good to know: https://stackoverflow.com/questions/41446833/what-is-the-difference-between-i-i-1-and-i-1-in-a-for-loop\", \"Hello Victor,\\nThank you for the clarification, it's clear now.\"]}, {\"question\": \"Really helpful Course!\", \"answers\": []}, {\"question\": \"\\u0425\\u043e\\u0440\\u043e\\u0448\\u0438\\u0439 \\u043a\\u0443\\u0440\\u0441 \\u0434\\u043b\\u044f \\u0441\\u0442\\u0430\\u0440\\u0442\\u0430.\", \"answers\": []}, {\"question\": \"Hi, I have some questions regarding problem 1 of Working with External Libraries:\\nwhat actually is the difference between ticks and tick labels. Are ticks the points on y or x axis?\\nI've looked into docs for matplotlib but I haven't been able to find example code (like in docs for pandas)- there is example code but those are general examples not an example related to a particular function or method. Is there some resource where example related to one specific function in matplotlib is available?\\nThankyou!\", \"answers\": [\"hi,\\nyou can use help() and show the method's info, help(graph.get_yticks) gives:\\nReturn the yaxis' tick locations in data coordinates\\nand see the current value with graph.get_yticks:\\narray([ 0., 50., 100., 150., 200., 250., 300., 350.])\\nAbout the tick labels, help(graph.set_yticklabels) shows:\\nSet the yaxis' labels with list of string labels.\\nFor examples, see Top 50 matplotlib Visualizations.\\nI hope this helps.\", \"Thanks, the link you provided although doesn't have multiple examples for one function as in pandas, but the comments are really helping. Thankyou very much!\"]}, {\"question\": \"Question 2 in Strings and Dictionaries:\\nThis is my code, how can I make it better optimized, beautiful?\\ndef word_search(doc_list: [str], keyword: str) -> [int]:\\n    \\\"\\\"\\\"\\n    Takes a list of documents (each document is a string) and a keyword. \\n    Returns list of the index values into the original list for all documents \\n    containing the keyword.\\n    \\\"\\\"\\\"\\n    indexes = []\\n\\n    for doc in doc_list:\\n        words = doc.split()\\n        for word in words:\\n            if word.lower().split('.')[0].split(',')[0] == keyword.lower():\\n                    if not doc_list.index(doc) in indexes:\\n                        indexes.append(doc_list.index(doc)) \\n                    else:\\n                        ...\\n\\n    return indexes\", \"answers\": [\"Hi @codeaesthete, if you didn't put anything in the \\\"else\\\", you can remove it, in Python itsn't required. I think you can also join this \\\"if\\\" sequence with an \\\"and\\\":\\nif (word.lower().split('.')[0].split(',')[0] == keyword.lower()) and (not doc_list.index(doc) in indexes):\\nIt can return\\u2026\\nTrue + True = True\\nTrue + False = False\\nFalse + True = False\\nFalse + False = False\\nOnly in the first case the code will be executed, the same way in yours.\", \"Thankyou!! \\ud83d\\udcaf\"]}, {\"question\": \"While solving the tutorial exercise I changed the values in same code cell and then ran it, but now those things are saved as it is. And for revision, I want to solve all of them as a fresh questionnaire. How can I do that?\\nBasically, I want to know how should I reset my progress and repeat a whole new fresh exercise of the same questions?\", \"answers\": [\"Hi @milindomendra96, you can copy the exercise link and open the same excercise in an incognito window, you will get the original version, then copy the code to yours.\", \"Thanks for suggesting @brunotly, but it isn't working this way. As I copy the URL of the exercise page to the incognito window, it asks me to login into my Kaggle account and as I get logged in, it shows the same progress that I have done so far.\"]}, {\"question\": \"hello folks where do i see output of exercise? after pressing ctr+Enter or run button nothing is happening and i cant see my output of exercise\", \"answers\": [\"Hi @vmpathak, at the top right corner in \\\"Data\\\" and then in \\\"output\\\". Some times there is a delay to update, so I recommend you to refresh to the right of \\\"output\\\".\"]}, {\"question\": \"Hello Guys,\\nI am New to Python & even Programming, Can anyone help me understand concept of Hashing or why Sets don't tae Lists ?\\nThanks.\", \"answers\": [\"Hi @excitedelectron, if you mean the difference between a set and a list, basically a set can't be changed, doesn't have an order (elements doesn't have an index) and doesn't accept duplicate values (which in my opition is the most useful difference). If you mean \\\"hashing\\\" as a \\\"#\\\" in Python, it represents a comment, which will not be executed when you run your code. We use it just for notes in the code.\"]}, {\"question\": \"import math as *\\nimport numpy as *\\nprint(pi, log(32, 2))\\nIn the above code, will the 'log' function from the 'math' library get overridden or overwritten?\", \"answers\": [\"This code will not run, it will throw invalid syntax exception in the first line. You can not import a module as *, it should be some valid alias (some str value per se, shouldn't be a symbol like * or some int like 1). I think what you want to do is from math import *. This piece of code means \\\"import everything (*) from the math module. We use the as keyword when we want to use some alias in place of whole module name for example we can do import pandas as pd and then refer to functions and methods in pandas by just using pd instead of writing pandas.\\nComing to the third line, print(pi, log(32, 2)), notice that you imported numpy after importing math. This means the log function being used is from numpy not from math because log function from math get replaced by log function in numpy. You can check this by calling help(log) and verify for yourself that the help/ signature returned for log function is indeed for numpy.log. Also, this line will throw an exception too TypeError: return arrays must be of ArrayType because according to signature for numpy.log, the second argument should be an array instead of base. (It has to be base in case you use the math module). So, if you want to specify base, you should use log function in math module.\\nA working code example for the code you provided above can be:\\nfrom math import *\\nfrom numpy import *\\narr = zeros((1,1))\\nprint(log(32, arr))\\nOutput:\\n>>> [[3.4657359]]\\nBy importing everything from modules, we saw how much error prone it is and can bring conflicts very hard to debug. It is not a good practice to use from x import * in general, it can mess with the namespace of your code\"]}, {\"question\": \"I have done all 3 of the excercises of the last module in the python course, yet I dont seem to get credit for it, and is constantly showing up as not complete. Not sure what I need to do to complete. I have made it public:\\nhttps://www.kaggle.com/dennisabele/exercise-working-with-external-libraries\\nMuch appreciated any help. many thanks in advance.\", \"answers\": [\"Hi,\\nPerhaps should you fixe the warning on the 1rst exercise ?\", \"hi,\\nThe warning on the 1st exercise did not prevent me showing up the exercise as completed.\\nIn fact, I do not see a problem in your notebook.\\nMaybe there is some technical notebook issue, you could try to fill the last module from scratch, save your work first!, then delete the notebook.\\nI hope this helps.\"]}, {\"question\": \"Hey all,\\nI accidentally deleted a cell in 'Lists' question 4 and have no idea how to reset the exercise. Due to this, I'm unable to show I've completed the course. Any help would be much appreciated.\\nThanks in advance,\\nJoseph\", \"answers\": [\"Hi,\\nThe code is the following one :\\na = [1, 2, 3]\\nb = [1, [2, 3]]\\nc = []\\nd = [1, 2, 3][1:]\\n'# Put your predictions in the list below. Lengths should contain 4 numbers, the\\n'# first being the length of a, the second being the length of b and so on.\\nlengths = [---]\\n'# Check your answer\\nq4.check()\", \"Hello!\\nYou can open an 'Incognito' Browsing Session and load the question 4 page there. You will see that your answers aren't kept at that page. So you can copy the original code from question 4 and then come back to your usual browser to paste it, where you accidently deleted it. Then you can move on and complete your answer.\"]}, {\"question\": \"This tutorial teaches us a lot.\", \"answers\": []}, {\"question\": \"Hi,\\nExercise 3 has a simpler solution than all that.\\nThe solution is the following, it can be done with both strings and lists, since the two types work the same.\\nSolution:\\nrerturn racers [:: - 1]\", \"answers\": []}, {\"question\": \"Hi everyone,\\nI just begun the Python learning, and I've got a comment on exercise 5 on the \\\"lists\\\".\\n\\nShouldn't May also be a fashionably late guest according to definition, as she arrived 4th over 7 guests ?\\nIt doesn't change the way to get the solution, but I needed some times to figure out why my proposed code was incorrect.\\nThanks !\", \"answers\": [\"Hi @nicolasbernardin, can you post the name of lesson and excercise which contain this question to help find it or even the link?\", \"Sure, I thought I already did but it may not be clear.\\nHere is the link : https://www.kaggle.com/kernels/fork/1275173\\nLesson 4 on the lists, exercise 5\", \"Hi,\\n'May' is not considered 'fashionably late' because she arrived \\\"at half\\\" and not **after ** at least half\", \"The comment above is correct, May arrived at half.\", \"Thank you @brunotly for the answer, but I still find it confusing.\\nShe arrived 4th over 7 people, so indeed there was only 3 people when she arrived.\\nAnyway, great lesson and way to learning Python !\", \"Hello NicBer,\\nYes, if you think it can be a little confused, but in a simple analysis (not math), May is in the middle, she has three people before and three people after. Thus, only 'Mona' and 'Gilbert' should be considered as fashionably late.\"]}, {\"question\": \"Hello all.I have a question regarding boolean question\\u2026\\u2026.I didnt understand the ques of hackjack.please someone provide me hints\", \"answers\": [\"Hi,\\nIn the 'simplified version of blackjack', the 'should_hit' function shall return True or False depending of only one of its parameter\"]}, {\"question\": \"hi everyone\", \"answers\": []}, {\"question\": \"Hi,\\nFor information, I've identified 2 mistakes in https://www.kaggle.com/colinmorris/strings-and-dictionaries\\nconcerning \\\"claim.startswith(planet)\\\" command\\nplanet should be between quote\\nthe result should be False\", \"answers\": [\"Hi Fabrice, it's no mistake, see the code above of \\\"claim.startswith(planet)\\\"\\u2026\\nclaim = \\\"Pluto is a planet!\\\"\\nplanet = 'Pluto'\\nThe variable claim starts with planet (wich is equivalent to 'Pluto').\", \"Thanks !!!\"]}, {\"question\": \"Hi all! I have a question about the Exercises: Strings and Dictionaries, Q3.\\nI don't know why my code is wrong.\\ndef multi_word_search(doc_list, keywords):\\n    dic = {}\\n    for i, doc in enumerate(doc_list):\\n        tokens = doc.split()\\n        normalized = [token.rstrip(\\\",.\\\").lower() for token in tokens]\\n    #use word_search() method before\\n    for k in keywords:\\n        clean = []\\n        if k.lower() in normalized:\\n            clean.append(i)\\n        dic[k] = clean\\n    return dic\\n~~~~\\nIncorrect: Expected return value of {'casino': [0]} given doc_list=['The Learn Python Challenge Casino', 'They bought a car', 'Casinoville?'], keywords=['casino'], but got {'casino': []} instead.\", \"answers\": [\"I should use word_search() in the definition of multi_word_search().\"]}, {\"question\": \"I have completed Functions and Getting help but still get 67% completed. I downloaded the notebook and deleted the cells. Upload again and run each cell but still get the same message\", \"answers\": []}, {\"question\": \"Hi!\\nBecause even though I exercise, I solve it in a notebook and when I do the test is it wrong? I look for information on the internet and nothing. A case particularly with the third exercise.\\nThanks you\", \"answers\": [\"Hi! Would you like to post the exact exercise please ?\"]}, {\"question\": \"Hi everyone,\\nmy question is from https://www.kaggle.com/colinmorris/booleans-and-conditionals\\nIn the\\nprepared_for_weather = have_umbrella or rain_level < 5 and have_hood or not rain_level > 0 and is_workday\\ndoesn't not have higher precedence than and in not rain_level > 0 and is_workday.\\nSo, in explanation why has and been solved first?\", \"answers\": []}, {\"question\": \"Is it correct to say that a string is immutable? In the Python course I found this statement about strings:\\n\\\"But a major way in which they differ from lists is that they are immutable. We can't modify them\\\".\\nplanet = 'Pluto'\\nplanet[0] = 'B'\\n# planet.append doesn't work either\\n---------------------------------------------------------------------------\\nTypeError Traceback (most recent call last)\\n<ipython-input-12-6ca42463b9f9> in <module>\\n---> 1 planet[0] = 'B'\\n2 # planet.append doesn't work either\\nTypeError: 'str' object does not support item assignment\\nI think actually we can't modify them in that way, element by element or using the list method \\\".append\\\".\\nBut say that they are immutable sounds confuse to me, cause we can do somthing like this:\\nplanet = 'B' + planet[1:]\", \"answers\": [\"Strings are immutable, which means that their content can\\u2019t change.\\nExample:\\ns = 'Hello, World!'\\nInput 1:\\nfor char in s:\\n    print(char)\\nOutput 1:\\nH\\ne\\nl\\nl\\no\\n,\\nW\\no\\nr\\nl\\nd\\n!\\nInput 2:\\nfor char in s:\\n    if char == 'e':\\n        char = 'E'\\nprint(s)\\nOutput 2:\\nHello, world!\\nWe can iterate through the content of s (Output 1), but we can not change it (Output2).\\nNotes:\\nThis piece of code: planet = 'B' + planet[1:], reassigns a value on planet variable. The new value of planet variable is a new string that comes from the compination of: 1. the character 'B' and 2. a slice of the original value of planet variable. Remember that you can use + to compine strings.\\nAlso remember that list.append() is a python method applyed on lists and not on strings.\", \"Thanks for helping, I was interpreting planet = 'B' + planet[1:] as a modification in the string, but now I think that I must interpret this as a statement of a new string with the same name, which will replace the previous one.\", \"Something like that! I would describe it like reassigning a new value to an existing variable. The new value (which is a string) is replacing the old one ;)\"]}, {\"question\": \"def least_difference(a, b, c):\\n\\\"\\\"\\\"Return the smallest difference between any two numbers\\namong a, b and c.\\n>>> least_difference(1, 5, -5)\\n4\\n\\\"\\\"\\\"\\ndiff1 = abs(a - b)\\ndiff2 = abs(b - c)\\ndiff3 = abs(a - c)\\nreturn min(diff1, diff2, diff3)\\nHello,\\nHappy New Year to you.\\nThe pasted docstring might be written like\\n'\\\"\\\"\\\"Return the smallest *absolute value of * difference between any two numbers among a, b and c. \\\"\\\"\\\"\\nThank you very much for your attention.\", \"answers\": []}, {\"question\": \"Can any one explain this to me?\\nwhat is this key doing?\\ndoes it mean that the function in key applies on all other arguments given? or what\\nkaggle.PNG\", \"answers\": [\"hi,\\nkey is an optional argument of the max function.\\nThe value given to the key argument is a function name, in the given example max() returns the argument that maximizes mod_5(x).\\nSee https://docs.python.org/3/library/functions.html#max\\nI hope this helps.\"]}, {\"question\": \"Boolean Exercises\\nBlackjack Game Problem not Solved\\nI was unable to make up the solution to the problem of blackjack game . I have tried but even i was unable to understand the problem .Thanks\", \"answers\": [\"Hi @umaresso, in this problem you need to program a function to play Black Jack. Actually the game function is ready. But you need to create a function that decides if you want one more card or not, and what the conditions to make this decision. The function have to return True for one more card or False for finish your game. You start with two cards and than you can request as many cards you want until get 21 points, if you pass 21, you lose. Once you finish your game, it's the dealer round, and he plays the same way as you did, if he pass 21 points he lose, but he can request another card until get 17 points, and not 21 as you can. If nobody pass 21 points the player which have more points wins. The points of each card you can check in the excercise, but attention to the 'A' (ace), it can represent diferent values. You can see my solution for this exercise here: \\\"https://www.kaggle.com/brunotly/exercise-booleans-and-conditionals\\\".\"]}, {\"question\": \"Hey y'all,\\nfor the Sixth unit in the Python Course, 'Strings and Dictionaries', Question 2, where the goal of the code is to filter out a keyword, let's take a word like 'Casino' as was in the example. I don't how the code prevents a word like 'Casinoville' from being accidentally included. I understand how the code in the answer filters out all surrounding whitespace with the .split() method, and gets ride of periods or commas with the .strip('.,') method. But, I do not see how a larger word like 'Casinoville' containing the smaller string, like 'Casino' would be rejected.\\n**Thanks so much for helping me understand! **\", \"answers\": [\"Jonathan,\\nAfter we get rid of '.' and ',' we use the str.split() method to return a list of strings (in this case, to split the sentence into words). Next, we compare the keyword with each string (word) from the list. We use a comparison operator == which is True only if two values are equal. So, 'Casino'=='Casinoville' is False. Only if we use the keyword 'in' to check if 'Casino' in 'Casinoville' then it will return True ( This is the way to check if our keyword is contained within a larger string. But this time, this is not our intention at all).\\nAll the best\", \"AH YES! Thank you!\"]}, {\"question\": \"heey, i have a problem i don't know how to finish an exercise\\nalso i didn't understand what is q.check and q.hint and q.solution\\ndid you know how to mark an exercise is completed ?\", \"answers\": [\"@salmabenzakour Finishing an exercise? what do you mean by that?\\nq.check() : is a function/method that checks if your answer for that questions is correct or not and gives feed back\\nq.hint(): gives you a hint if you require one\\nq.solution() : gives you one of the possible solutions to the given problem\"]}, {\"question\": \"Thank you for sharing.\", \"answers\": []}, {\"question\": \"Hello everyone,\\nI have completed the course but in the last question of the \\\"working with External libraries\\\" notebook. My answer keeps getting shown as Incorrect even though my answer matches the solution of that question.\\nHelp would be really appreciated as I am stuck on 98% for this course's completion.\", \"answers\": [\"Sometimes it is easier to show your notebook by making it public and leaving a like here. People can then see it and may help you out.\"]}, {\"question\": \"Please point me where I'm missing, here is my notebook. This is blocking to make 100%\\nhttps://www.kaggle.com/maharajanm/exercise-lists\", \"answers\": [\"@maharajanm We can not open your notebook. First you have to make your notebook public. You may find the 'share' icon on the right-top side of the notebook kernel. There change the private setting to public and then share it.\", \"@desalegngeb Thanks, Please check now.\", \"Still does not work.\", \"@desalegngeb I added you as collob. Thanks for looking into it.\", \"@maharajanm Q2 was deleted from your notebook, perhaps accidentally. Now should be OK. Good luck!\", \"@desalegngeb Thank you.\", \"You are most welcome!\\ud83d\\udc4d\"]}, {\"question\": \"why can't we use this :\\nstring = doc_list[0]\\nreturn string[-6:].lower()\\nfor exercise question 2 in my notebook of link:\\nhttps://www.kaggle.com/kaushal200/exercise-strings-and-dictionaries\", \"answers\": [\"\", \"This comment was deleted.\", \"Hi @kaushal200, your function needs to work for any list. For this one\\u2026\\ndoc_list = [\\\"The Learn Python Challenge Casino.\\\", \\\"They bought a car\\\", \\\"Casinoville\\\"]\\nIt works fine, but if we change to this\\u2026\\ndoc_list = [\\\"They bought a car\\\", \\\"Casinoville\\\", \\\"The Learn Python Challenge Casino.\\\"]\\nIt won't return the correct answer. It will return \\\" a car\\\", the last 6 elements of the first string.\"]}, {\"question\": \"Hi can anyone tell me why the program did not accept my code:\\ni thing this is right.\\ndef purple_shell(racers):\\n\\\"\\\"\\\"Given a list of racers, set the first place racer (at the front of the list) to last\\nplace and vice versa.\\n>>> r = [\\\"Mario\\\", \\\"Bowser\\\", \\\"Luigi\\\"]\\n>>> purple_shell(r)\\n>>> r\\n[\\\"Luigi\\\", \\\"Bowser\\\", \\\"Mario\\\"]\\n\\\"\\\"\\\"\\nracers[:] = racers[len(racers)-1::-1]\", \"answers\": []}, {\"question\": \"focus! https://www.kaggle.com/duplicate/exercise-booleans-and-conditionals/edit\\nwhere is \\\"q7.simulate_one_game()\\\" from\\uff1f is it a function inside kaggle system?\", \"answers\": [\"@duplicate I think it is a methode within q7 function. It is used to simulate one game of blackjack in the optional exercise.\"]}, {\"question\": \"Hello! Can someone please explain what is the kernel editor? the tutorial said this \\\"Tip: In the kernel editor, you can highlight several lines and press ctrl+/ to toggle commenting\\\" and I don\\u00b4t know what it refers to. TIA\", \"answers\": [\"Hi @ursulapia,\\nKernel editor means thejupyter notebook you are coding on. The tip is refering to how you can comment or uncomment a block of code in the kernel editor.\\nGood luck!\", \"\\\"ctrl+/\\\" is just an easy way for you to disable/able the code block. very useful in case you want to debug or check your code working\", \"In addition, in case you want to run hint or solution code, you select the function and type \\\"crl+/\\\"\"]}, {\"question\": \"\\\"bools = True or True and False\\nprint(bools)\\\"\\nThis is my code run in Pycharm, but it returns \\\"True\\\". Follow the course \\\"Booleans and Conditionals\\\" it should be \\\"False\\\".\\nMay someone gives me the advice?\", \"answers\": [\"hi Nguyen, in order to solve that boolean expression, first of all consider which boolean operator has precedence: it's the AND one. So you need to do \\\"True and False\\\" first. It outputs False:\\nbools = True or True and False = True or False\\nNow you have a simple OR expression, whose output is True:\\nbools = True or False = True\\nThus, the output you've obtained with Pycharm is absolutely correct, and even during the lesson you get the same output for that boolean expression:\", \"It may help memorizing the truth tables for AND and OR operators that you can find here. Each one has only four rows and it's easy to remember. Let me know for any further question!\", \"Hi Tarukofusuki, thanks for your reply. My mistake for not read carefully. Appreciate your guidance.\\nI'm on the first step to becoming a data engineer, haha.\", \"Hey Nguyen, don't worry, it's ok! We are here for learning \\ud83d\\udcaa\", \"Sorry to bother you, have you try to learn on EdX or Simplilearn? I plan to apply for 1 Master's program on one of them. If possible please share me some reviews.\"]}, {\"question\": \"Hi\\nI wondered if anyone could help me understand something on the beginner python course please.\\nThere is something puzzling me on the Booleans and Conditionals section and the exercise involving this code.\\n{\\nprepared_for_weather = have_umbrella or rain_level < 5 and have_hood or not rain_level > 0 and is_workday\\nI'm trying to say that I'm safe from today's weather\\u2026.\\nif I have an umbrella\\u2026\\nor if the rain isn't too heavy and I have a hood\\u2026\\notherwise, I'm still fine unless it's raining and it's a workday\\n}\\nIf I'm understanding correctly we need a true from one of 3 things for prepared_for_weather to return true.\\nhave_umbrella\\nrain_level < 5 AND have_hood (both need to return true to get a true overall) not rain_level >0 AND is workday (both need to return true to get a true overall)\\nSo we've got false for the first 2, no umbrella, its raining at level 3 but no hood. So we need a true from the last part.\\nSo its raining at level 3 but its a saturday so we should get a true as its not a workday but cannot because not 3 > 0 returns false.\\nI hope I'm making sense and not just confusing myself. Any advice would be appreciated.\", \"answers\": [\"Hi,\\nI just realize, I think there is a problem with the check() of this question. The solution express what are you saying:\\nThe key problem is that Python implicitly parenthesizes the last part as:\\n(not (rain_level > 0)) and is_workday\\nWhereas what we were trying to express would look more like:\\nnot (rain_level > 0 and is_workday)\\nBut both ways are giving a Correct result to the exercise.\", \"Hi @stephenlancaster,\\nI think your thinking/ solution of the umbrella problem is correct. The confusion, perhaps is the application of the precedence of the boolean operators.\\nIf you read the lecture notes on boolean operations carefully , it is stated that and takes precedence before or. To clear any ambiguity when you have multiple booleans, its suggested to use brackets. For referece of operator precedence see here.\\nTheir example is:\\nTrue or True and False --> False\\nTrue or (True and False) --> True\\nHope it helps.\", \"Hello Daniele and des\\nThank you both for the responses\\nI actually got a correct for the exercise but it is bugging me as I don't think it makes sense. I should probably just move on.\\nI had a look online and it says that to return true, the statement on each side of an and operator has to be true so des, even if not (rain_level > 0 and is_workday) is evaluated first , it can't return true if it is raining as that will return false even if it is not a workday.\\nI think it is the not keyword that is causing the issue.\\nDaniele, I think in either situation that you pointed out the not keyword being applied to rain_level > 0 that is causing the problem in my understanding.\\nThank you both again \\ud83d\\udc4d\", \"Unless!!! (3 > 0 and is_workday) returns false but the not keyword changes the whole thing to true. I think thats it \\ud83d\\ude04\", \"No its not \\u2639\\ufe0f\", \"@stephenlancaster Now the confusion is back-propagating (to borrow a term from NNets ) to me as well. What is it that you are confused about?\\nThe question as given in the notebook is to give values to the below function\\ndef prepared_for_weather(have_umbrella, rain_level, have_hood, is_workday):\\n    # Don't change this code. Our goal is just to find the bug, not fix it!\\n    return have_umbrella or rain_level < 5 and have_hood or not rain_level > 0 and is_workday\\nso that it returns a value contrary to the logic or expectations (i.e, make it return TRUE while it should be FALSE and the vice versa). Note that the function has bugs and we are told NOT to fix it but to find the bug.\\nFor example when I pass in the below inputs,\\nhave_umbrella = False\\nrain_level = 10.0\\nhave_hood = True\\nis_workday = False\\nIt returns FALSE. But we know for the given conditions, we are prepared and should have returned TRUE. Due to the bug it is not.\\nThe step-wise boolean operation is then:\\nreturn (  have_umbrella or rain_level < 5 and have_hood or not rain_level > 0 and is_workday )\\nreturn (  F or 10 < 5 and T or not 10 > 0 and F )\\nreturn (  F or F and T or not T and F )\\nreturn (  F or F and T or F and F )\\nreturn (  F or F or F )\\nreturn (  False )\\nAfter fixing the code (not the goal of that exercise) as below the function returns as you would ex\\npect, i.e True when you are prepared False otherwise.\\ndef prepared_for_weather(have_umbrella, rain_level, have_hood, is_workday):\\n    # Don't change this code. Our goal is just to find the bug, not fix it!\\n    return have_umbrella or rain_level < 5 and have_hood or not (rain_level > 0 and is_workday)\\nThe step-wise boolean operation is then:\\nreturn (  have_umbrella or rain_level < 5 and have_hood or not (rain_level > 0 and is_workday ) )\\nreturn (  F or 10 < 5 and T or not (10 > 0 and F ))\\nreturn (  F or F and T or not (T and F ))\\nreturn (  F or F and T or not ( F )\\nreturn (  F or F and T or T )\\nreturn (  F or F or T )\\nreturn (  True )\\nHope it make sense.\", \"Thanks for taking the time for the breakdown des. Much appreciated.\\nI've been doing a bit of testing in notebook.\\nI think I was going wrong by applying the not to the statement before the and and then applying it to the statement after the and or not at all.\\nEg\\nnot(rain_level > 0) and not(is_workday)\\nor\\nnot(rain_level > 0) and (is_workday)\\nwhen I should have been getting the result and then applying the not to the whole thing.\\nEg\\n(False and False) returns False\\nnot(False and False) returns True\\nurgh rookie mistake!\\nThanks Again!\", \"You are welcome Stephen! We are here to learn and help eachother. That is what discussion forums are for.\"]}, {\"question\": \"I have completed \\\"Booleans and Conditionals\\\" exercise but the progress is still 88%, please someone help\", \"answers\": []}, {\"question\": \"how to start career as data scientist in** India** as** Fresher**.\", \"answers\": []}, {\"question\": \"Awesome course.\", \"answers\": []}, {\"question\": \"I solved all the question of strings and dictionaries but my progress stuck at 50% in this exercise. please help me out\", \"answers\": [\"if questions are correct, try clicking on \\u23e9 Run all button\", \"I have recently completed the python course\\u2026let me know what is the issue?\", \"It's very difficult to be said Vishal, because only you can see your notebooks. Try to run each cell and see if the progress will be updated\", \"I have uploaded a snapshot. There is a share button using which you can make your notebooks public.\\nTry it and let me know.\\nCapture.PNG\"]}, {\"question\": \"i couldnt understand the line q1.check() in any of the questions.so to run the code I replaced it with print function.\", \"answers\": [\"hey Shachi, those lines are needed in order to check if your code is correct and - consequently - to track your progress! Please restore those lines\"]}, {\"question\": \"what is to_smash.\", \"answers\": [\"hi GOWTHAMKUMAR C, to_smash is the name of a function (introduced in 2nd Python course lesson) that returns the number of candies to be smashed (if you prefer: destroyed), in order to let a number n of friends having each one the same amount of candies! Imagine there's only me and you (n=2), and we have 11 candies: 5 candies to me, 5 candies to you. The eleventh candy will be destroyed. So to_smash function will return 1.\\nOf course, it makes no sense in real life, but let's pretend it does\"]}, {\"question\": \"Hi, Can I reset the First Exercise, I deleted it by Error?\", \"answers\": [\"Hi Prateek,\\nyou will find the way to do that here.\"]}, {\"question\": \"Hi all, 2 questions on the Python Course regarding Lists:\\nIs anyone getting a syntax error for question 4: C = []?\\nI deleted this question messing around. Is there a way to get it back?\\nThank you!\", \"answers\": []}, {\"question\": \"hello,\\nI believe there is something work with the check method of Q2 in Exercise: Strings an Dictionaries.\\nWhenever I run word search manually, it returns correct indexes, but when I run q2.check() method, I receive\\nIncorrect: Expected return value of [0] given doc_list=['The Learn Python Challenge Casino has a big casino full of casino games', 'They bought a car', 'Casinoville'], keyword='casino', but got [0, 0, 0] instead.\\nScreenshot:\", \"answers\": []}, {\"question\": \"Hello there,\\nI'm stuck in the final exercise of working with libraries. I'm getting at error for ' q3.check()' as syntax error.\", \"answers\": [\"Hello,\\nCould you please share all your code block?\\nProbably the error is at the function, perhaps a missing parenthesis .\", \"`def blackjack_hand_greater_than(hand_1, hand_2):\\n\\\"\\\"\\\"\\nReturn True if hand_1 beats hand_2, and False otherwise.\\nIn order for hand_1 to beat hand_2 the following must be true:\\n- The total of hand_1 must not exceed 21\\n- The total of hand_1 must exceed the total of hand_2 OR hand_2's total must exceed 21\\n\\nHands are represented as a list of cards. Each card is represented by a string.\\n\\nWhen adding up a hand's total, cards with numbers count for that many points. Face\\ncards ('J', 'Q', and 'K') are worth 10 points. 'A' can count for 1 or 11.\\n\\nWhen determining a hand's total, you should try to count aces in the way that \\nmaximizes the hand's total without going over 21. e.g. the total of ['A', 'A', '9'] is 21,\\nthe total of ['A', 'A', '9', '3'] is 14.\\n\\nExamples:\\n>>> blackjack_hand_greater_than(['K'], ['3', '4'])\\nTrue\\n>>> blackjack_hand_greater_than(['K'], ['10'])\\nFalse\\n>>> blackjack_hand_greater_than(['K', 'K', '2'], ['3'])\\nFalse\\n\\\"\\\"\\\"\\ndef score(hand):\\n    \\\"\\\"\\\"Helper function to calculate the total points of a blackjack hand.\\n    \\\"\\\"\\\"\\n    total = 0\\n# Count the number of aces and deal with how to apply them at the end.\\n    aces = 0\\n    for card in hand:\\n        if card in ['J', 'Q', 'K']:\\n            total += 10\\n        elif card == 'A':\\n            aces += 1\\n        else:\\n        # Convert number cards (e.g. '7') to ints\\n            total += int(card)\\n# At this point, total is the sum of this hand's cards *not counting aces*.\\n\\n# Add aces, counting them as 1 for now. This is the smallest total we can make from this hand\\n    total += aces\\n# \\\"Upgrade\\\" aces from 1 to 11 as long as it helps us get closer to 21\\n# without busting\\n    while total + 10 <= 21 and aces > 0:\\n    # Upgrade an ace from 1 to 11\\n        total += 10\\n        aces -= 1\\n    return total\\nreturn score(hand_1)<= 21 and (score(hand_1) > score(hand_2) or score(hand_1)>21) and (score(hand_1)!=score(hand_2)\\nCheck your answer\\nq3.check()`\", \"I have copy pasted the solution given to figure out if my code was wrong but sadly it shows the same error.\", \"Thanks everyone, I have deleted the note book and started again. It worked \\ud83d\\udcaf!\"]}, {\"question\": \"Could somebody give me a hand?\\nExercise 1 Working with External Libraries\\nAfter I defined prettify_graph(graph) function, I have got an AttributeError: 'function' object has no attribute 'set_title'.\\n(I have done setup before that).\\nEven when I copy the solution code that is provided, I have the same result.\\nCould you please help me to figure out what is going on and how to overcome this problem?\", \"answers\": [\"Could you please share your code and error?\", \"\", \"@petar2020 I think you should call the method graph.set_title() instead of graph_title(). See the note above the current code cell.\", \"@petar2020 I think the problem is in the line:\\ngraph = jimmy_slots.get_graph\\nget_graph is a function, not an attribute so you should use get_graph().\", \"Thank you very much.\", \"I have tried both (graph.set_title() and graph.title()) without results. Daniele Jane Cruz helped me to find the error. When I run the code I should have done like get_graph() as a function, not an attribute.\"]}, {\"question\": \"Thank you for this course!\\nIt appears one needs a maths foundation to properly understand the arithmetic aspects. Is there a basic related resource I can use to brush up? I struggled with understanding the Alice, Bob, and Carol candy story.\\nAlso, I never saw the answer to the a and b swap.\", \"answers\": [\"Hello Faith, it can be difficult understanding some maths concepts. Anyway, I'm pretty sure you can find help in every occasion, just write here. Is there something you'd like to ask about the candy story?\\nIf you want to strenghten your maths skills, I'd suggest using khanacademy: I remember there's a test in that website, in order to understand which maths you need to learn and which not, in order to discard lessons about known concepts. That can be a good resource!\"]}, {\"question\": \"Thank you for this course!\\nIt appears one needs a maths foundation. I struggled with knowing the appropriate arithmetic function for the Alice, Bob, and Carol candy story. Please, where can I find basic relevant resources to brush up?\\nI never got to know the answer for the a and b swap.\", \"answers\": [\"Khan Academy is a very good platform for review math in general: https://www.khanacademy.org/\\nAbout the Exercise: Syntax, Variables, and Numbers - Exercise 4 to solve it you need to use the operator that returns the remainder after the division.\\nOperators related to division:\\nOperator Name Description\\na / b True division Quotient of a and b\\na // b Floor division Quotient of a and b, removing fractional parts\\na % b Modulus Integer remainder after division of a by b\\nExample:\\nCode Result\\n11 / 5 2.2\\n11 // 5 2\\n11 % 5 1\"]}, {\"question\": \"Can someone please explain q.4 on the Loops and List Comprehensions exercise (average slot pay-out function)? What exactly is the function supposed to do? Thanks.\", \"answers\": [\"Hi,\\nThe \\\"play_slot_machine()\\\" gives the output of a bet. Each time we bet, it cost us $1 (no matter the result). So, the idea of the function \\\"estimate_average_slot_payout(n_runs)\\\" is to obtain the average of gains in \\\"n_runs\\\" of the slot machine. This function is supposed to calculate the values of n_runs and return their average gain.\\nFor example, if we bet three times (ie if we run three times the function \\\"play_slot_machine()\\\") and get the values [0,0,0, 0.25] we need to subtract [-1,-1,-1,-1] (the cost of each time we play); in this case we get [-1,-1,-1,-.75] . In this example, we only win in the fourth bet $0.25. Then, our average win is \\\"mean([-1,-1,-1,-.75]) = -0.9375\\\".\\nThe interesting part is that, although it is very uncommon to win and most of the time we have losses, there are runs of the slot machine that we gain a lot of money. That is why the long-run average is positive (long-run average = the value of estimate_average_slot_payout(n_runs) for a BIG value ofn_runs). Unfortunately, the average of a real slot machine is always negative; the house always wins!\"]}, {\"question\": \"def exactly_one_topping(ketchup, mustard, onion):\\nreturn (int(ketchup)+int(mustard)+int(onion)==1\\nq6.check()\\nis there an error in the notebook? each time I run this code it says q6.check() is invalid syntax. Is there any way to restart my exercise notebook otherwise?\", \"answers\": [\"There is one parenthesis missing:\\nI put some spaces to visualize better.\\ndef exactly_one_topping(ketchup, mustard, onion):\\n    return ( int(ketchup) + int(mustard) + int(onion) ) ==1\"]}, {\"question\": \"In the last notebook Exercise: Working with External Libraries I had the following problem:\\nIf I use dir(graph) I can found set_title() method but If I run the cell where is def prettify_graph(graph) I have got:\\nAttributeError: 'function' object has no attribute 'set_title'\\nI have tried to run the solution code but I have got the same result. Can somebody give me a hint what is wrong?\", \"answers\": [\"Hello,\\nCould you put the line of code that you tried to use the function set_title and raised the error?\", \"`def prettify_graph(graph):\\ngraph.set_title(\\\"Results of 500 slot machine pulls\\\")\\n# Make the y-axis begin at 0\\ngraph.set_ylim(bottom=0)\\n# Label the y-axis\\ngraph.set_ylabel(\\\"Balance\\\")\\n# Bonus: format the numbers on the y-axis as dollar amounts\\n# An array of the values displayed on the y-axis (150, 175, 200, etc.)\\nticks = graph.get_yticks()\\n# Format those values into strings beginning with dollar sign\\nnew_labels = ['${}'.format(int(amt)) for amt in ticks]\\n# Set the new labels\\ngraph.set_yticklabels(new_labels)\\ngraph = jimmy_slots.get_graph\\nprettify_graph(graph)\\ngraph`\\nWhen I run the cell I have got the following message:\\n`AttributeError Traceback (most recent call last)\\nin\\n35\\n36 graph = jimmy_slots.get_graph\\n---> 37 prettify_graph(graph)\\n38 graph\\nin prettify_graph(graph)\\n21 #graph\\n22 def prettify_graph(graph):\\n---> 23 graph.set_title(\\\"Results of 500 slot machine pulls\\\")\\n24 # Make the y-axis begin at 0\\n25 graph.set_ylim(bottom=0)\\nAttributeError: 'function' object has no attribute 'set_title'`\", \"\"]}, {\"question\": \"It is a very good introductory-level Python course.\", \"answers\": []}, {\"question\": \"What are the lengths of the following lists? Fill in the variable lengths with your predictions. (Try to make a prediction for each list without just calling len() on it.)\\na = [1, 2, 3]\\nb = [1, [2, 3]]\\nc = []\\nd = [1, 2, 3][1:]\\ncan any one help me with this answer?\", \"answers\": [\"a = 3, b = 2, c= 0 and \\u2026\\nd = 2 from the expression.\"]}, {\"question\": \"can someone help me plz !!\", \"answers\": []}, {\"question\": \"Halo,\\nIs this even valid?\\nPlayer starts with J and A (total = 21)\\nDealer starts with A\\n\\n__Player's turn__\\nPlayer stays\\n\\n__Dealer's turn__\\nDealer hits and receives J. (total = 21)\\nDealer stands.\\nDealer wins. 21 >= 21\\nNot fair \\ud83d\\udc94\", \"answers\": []}, {\"question\": \"Did anyone get this type of error ' Incorrect: When calling your function with arguments [['J', 'A'], ['6']], Python raised the following exception\\u2026 NameError: name 'hand_total' is not defined ' in the last question of working with external Libraries\", \"answers\": [\"It seems that you simply have not previously declared this function (at the time of calling it). Perhaps you just made a typo in the name of the variable at the time of calling the function or when defining it.\"]}, {\"question\": \"Did anyone get this kind of error ' Incorrect: When calling your function with arguments [['J', 'A'], ['6']], Python raised the following exception\\u2026 NameError: name 'hand_total' is not defined '\", \"answers\": []}, {\"question\": \"Hi everyone!\\nI'm doing a recap on the basics of Python and at the end of the notebook of Lesson 4 (Lists) something weird happes.\\nOn the Ex.4, I wrote the right answer, and the notebook says incorrect. On the Ex.5, I wrote a different but similar answer and the notebook says incorrect because it returns False when testing the last element. If I test on my laptop, my function returns the correct answer and wrong answer if I use the function provided on the solution.\\nDoes anyone know how I can report? Did anyone had any experience like this?\\nThank you!\", \"answers\": []}, {\"question\": \"Hello friends, I am new to both : the platform as well as computer science stuff . I know basic python .\\nWill you please tell me where to get started and how to go . I will love it if you respond .\", \"answers\": [\"I started from there, maybe you'll find it interesting:\\nhttps://www.kaggle.com/learn/overview\"]}, {\"question\": \"I am stuck at 88% and can't complete the entire course.\", \"answers\": []}, {\"question\": \"Hi everyone,\\nI'm stuck on Booleans and Conditionals exercise 3. I'm pretty sure the conditions I created will get me the right answer but I keep getting an error message for my equal sign. Can anyone help?\", \"answers\": [\"The error is at the function, in the return line you have missed a parenthesis.\\nHope this helps!\"]}, {\"question\": \"I seem to have peaked at 41.9% for the blackjack win rate, fellow learners how about you? Is there hope for more :P and would appreciate if you can explain your logic\", \"answers\": []}, {\"question\": \"Can anyone explain to me the solution of question number 2 and 3 in chapter 6? I'm still trying to understand the usage of the syntax\", \"answers\": [\"I worked on these problems for a long time. Especially number 2.\\nMaybe this is helpful. I think the answer they are looking for is the location of the string in the list of strings that matches the keyword. If there is no match ignore it. So for the example in the code the first string in the list has a match to the keyword so the answer is [0].\\nHope this is helpful.\"]}, {\"question\": \"i got q0 or q1 is not defined error.\\nand there is not mentioned about q0 or q1\", \"answers\": []}, {\"question\": \"In the code, it imports\\nfrom learntools.core import binder;\\nWhere can I go to see what learntools is and all the stuff that it has.\\nI found this https://github.com/Kaggle/learntools/tree/master/learntools/core\\nbut there is no binder file in the core folder.\", \"answers\": []}, {\"question\": \"please suggest me. i don't to complete 100% to my first exercise\", \"answers\": []}, {\"question\": \"Exercise: Loops and List Comprehensions\\nDoes this code seem to be right?\\ndef estimate_average_slot_payout(n_runs):\\n    \\\"\\\"\\\"Run the slot machine n_runs times and return the average net profit per run.\\n    Example calls (note that return value is nondeterministic!):\\n    >>> estimate_average_slot_payout(1)\\n    -1\\n    >>> estimate_average_slot_payout(1)\\n    0.5\\n    \\\"\\\"\\\"\\n    result = []\\n    for i in range(nruns):\\n        result.append(play_slot_machine()-1)\\n    return sum(result)/n_runs\\nThis is my suggestion to solve exercise 4 using the list comprehension version:\\n# the list comprehension version:\\ndef estimate_average_slot_payout(n_runs):\\n    return [sum((play_slot_machine()-1) for i in range(nruns))/n_runs]\", \"answers\": [\"Your function takes the argument n_runs. But you change the argument for the range function to nruns? Why? If you run your code you will get NameError: name 'nruns' is not defined\"]}, {\"question\": \"exercise is difficult for me\", \"answers\": []}, {\"question\": \"Hi, how do i restart my programming exercise? Can anyone help? Thanks\", \"answers\": []}, {\"question\": \"I have no idea where is the error.\", \"answers\": [\"You need a colon (:) after \\\"def round_to_two_places(num)\\\"\\nAlso, make sure you indent lines of code that are inside the function definition.\\nHope that helps!\", \"Thank you Nicklaus Kim\"]}, {\"question\": \"Finished Python course few days ago.\\nCompared to other Python basic courses elsewhere this one is the best. \\ud83d\\udc4d\", \"answers\": []}, {\"question\": \"This tutorial is easy for me as the beginner, they taught me a lot\", \"answers\": []}, {\"question\": \"Great Python course to refresh my dwindling Python knowledge in a few hours, Thanks Kaggle\\ud83d\\udc4d\", \"answers\": []}, {\"question\": \"Has anyone tried to do item 4 in Exercise: Loops and List Comprehensions? I don't feel it is working correctly. Usually I can get code blocks to display information with the print() command as I am working on code. But I get nothing with this exercise when I try that. Thanks\", \"answers\": []}, {\"question\": \"Did all exercises and still stuck at 88%\\u2026 How can solve this?\", \"answers\": [\"Which exercise you stuck? All exercises worked well for me.\\nThere are some tasks with following lines:\\nCheck your answer (Run this code cell to receive credit!)\\nYou should run it as well to get \\\"correct\\\" message.\"]}, {\"question\": \"From someone who learned python three years ago. There is truly nothing good to say about this course. It's all nonsense and guessing. Spent more time trying to figure out what's being said then anything else. Only was able to complete 96%.\", \"answers\": []}, {\"question\": \"It is a good way to start with python - sure not the only way. I have used other courses as well but the positive thing about this one is, that a novice can do it directly in own written code snippets.\", \"answers\": []}, {\"question\": \"That's an amazing tutorial, in a short time you can get a lot about python from this tutorial. Must recommend for all the python beginners.\", \"answers\": []}, {\"question\": \"https://www.kaggle.com/manashpdphukan/exercise-working-with-external-libraries\\nGuys, kindly review these codes and let me know where did I go wrong.\", \"answers\": []}, {\"question\": \"Not understanding, what you are trying to tell\\u2026 Please update the content\", \"answers\": []}, {\"question\": \"The exercises can be improvised.\", \"answers\": []}, {\"question\": \"I keep getting this error: \\\"NameError: name 'qx' is not defined\\\" which gives me this prompt \\\"Working on an exercise? Don't forget to run the setup code cell at the top of the notebook to import the exercise helpers.\\\" So clearly I need to run the setup code cell, but the first cell I am able to run is this one:\\nprint(\\\"You've successfully run some Python code\\\")\\nprint(\\\"Congratulations!\\\")\\nSorry for the noob question but I'd like to be able to check my answers. Thanks in advance.\", \"answers\": []}, {\"question\": \"Thanks for the courses\", \"answers\": []}, {\"question\": \"Really amazing to get started for beginners. \\u270c\", \"answers\": []}, {\"question\": \"Hi. I would appreciate any help with the Python tutorial.\\nI have done (several times) all exercise cells on lesson 3 Booleans and Conditionals, but it always appears incomplete (88% of progress). I reviewed my work and did not delete any cell. Can anyone give me a hint about what I could have done wrong?\", \"answers\": []}, {\"question\": \"Hi, I somehow deleted a cell in one of the notebooks. Is there a way to revert the notebook to original?\", \"answers\": []}, {\"question\": \"Hello,\\nI am taking the Python course.\\nWould it be possible to restart the exercises of the Functions and Getting Help module? I have mistakenly deleted the cells from exercise 1 and now I cannot re-set these exercises from the beginning.\\nBest regards,\\nAlex\", \"answers\": []}, {\"question\": \"The courses provided by the Kaggle are one of the best way to learn python and Data Science in an experimental way. But Kaggle only give us a good startup , remaining depends on our own practice and doing small projects.\", \"answers\": []}, {\"question\": \"hi, i think the course was very informative, but i felt quite a big leap from the exercises to the tutorials before them, maby building python skills a little slowly can improve the benefits of taking this course, anyway i realy enjoyed it!\", \"answers\": []}, {\"question\": \"Can I find more exercises for Python somewhere? I'm stuck at Strings and Dictionaries, I would like to understand word_search and multi_word_search (had to use Solution despite few treis\\u2026 :( )\", \"answers\": []}, {\"question\": \"Hello, I am trying to do lesson 5 on lists\\nHere is my code\\ndef fashionably_late(arrivals, name):\\n\\\"\\\"\\\"Given an ordered list of arrivals to the party and a name, return whether the guest with that\\nname was fashionably late.\\n\\\"\\\"\\\"\\npass\\nlast_early_person=len(arrivals)/2 \\nprint(last_early_person)\\nnumber_of_fashionably_late=arrivals.index(name)-1\\nprint(number_of_fashionably_late)\\nreturn (number_of_fashionably_late>last_early_person) and (number_of_fashionably_late!=(len(arrivals)-1))\\nCheck your answer\\nq5.check()\\nIt prints out 3.5, -1, 3.5, 0 ,3.5, 1, 3.5, 2, 3.5, 3 when I am expecting 3.5 and 4 Any ideas?.\", \"answers\": []}, {\"question\": \"Thank you for the nice Python course.\\nI just finished the Intro ML also.\\nHowever, I am not sure about my Python skills, especially about string and list.\\nIf I wanna learn more what should I do? I don't know whether I should continue other courses in Kaggle or I should find other resources about Python.\", \"answers\": []}, {\"question\": \"How do I complete the course? I solved the problems and ran the solution to get credit. Why isn't this being marked as complete?\", \"answers\": []}, {\"question\": \"\\ud83c\\udf36\\ufe0f\\nWe're using lists to record people who attended our party and what order they arrived in. For example, the following list represents a party with 7 guests, in which Adela showed up first and Ford was the last to arrive:\\nparty_attendees = ['Adela', 'Fleda', 'Owen', 'May', 'Mona', 'Gilbert', 'Ford']\\nA guest is considered 'fashionably late' if they arrived after at least half of the party's guests. However, they must not be the very last guest (that's taking it too far). In the above example, Mona and Gilbert are the only guests who were fashionably late.\\nComplete the function below which takes a list of party attendees as well as a person, and tells us whether that person is fashionably late.\\ndef fashionably_late(arrivals, name):\\n\\\"\\\"\\\"Given an ordered list of arrivals to the party and a name, return whether the guest with that\\nname was fashionably late.\\n\\\"\\\"\\\"\\narrive = arrivals.index(name)\\nif arrive>= len(arrivals)/2 and arrive!=len(arrivals)-1:\\nreturn True\\nelse:\\nreturn False\\nCheck your answer\\nq5.check()\\nCorrect\\nq5.solution()\\nHint: Use the index method to find when the person arrived. Check whether that is a fashionably late spot given the list length (len). Think about 0-indexing\\nSolution:\\ndef fashionably_late(arrivals, name):\\norder = arrivals.index(name)\\nreturn order >= len(arrivals) / 2 and order != len(arrivals) - 1\\nI think the code will give wrong answer if the length of arrivals is even and we check the name of arrivals[len(arrival)/2]\", \"answers\": []}, {\"question\": \"I am having a bit of difficulty with the jumps expected between what's made visible/knowable in the lessons, and what we're expected to implement in the exercises.\\nSpecifically - I am looking at the exercises in Strings and DIctionaries, and I see that the solution is deploying enumerate() but can't find in previous lessons where students are pointed toward or made aware of enumerate() existing as a function? Please advise.\", \"answers\": []}, {\"question\": \"The course is very informative so far\", \"answers\": []}, {\"question\": \"lists question 5 anyone? I'm unable to understand\", \"answers\": [\"hey Ishwar,\\nyou have to make a function that returns True or False depending on whether:\\n1.\\nthe guest has arrived after at least half of all party attendees. In this case, the condition is met if the guest is arrived after:\\nparty_attendees = ['Adela', 'Fleda', 'Owen', 'May', 'Mona', 'Gilbert', 'Ford']\\n\\nparty_attendees[int(len(party_attendees) / 2)]\\nwhich returns May.\\n2.\\nThe guest must not be the last arrived at the party, that in this case is:\\nparty_attendees[int(len(party_attendees))-1]\\nwhich returns (who'd have thought? \\ud83e\\udd13) Ford.\\nNow, your function should get party_attendees and guest name as inputs, and must return True or False according to those 2 conditions.\"]}, {\"question\": \"Has anybody gotten this when they tried to simulate a black jack game?\\nhttps://screenshot.googleplex.com/5K4NT9F7VYfPnCp\\nI thought I'd get a True or False answer\", \"answers\": []}, {\"question\": \"I am on Booleans and Conditions. My practice sheet is stuck at 88% even though I have completed all the questions. What should I do?\", \"answers\": [\"It seems like you've missed running any relevant code cell which carries credit. Please go through the exercises of Booleans and Conditions again and make sure to run all the code cells.\\nI hope this answers your question. Good luck!\"]}, {\"question\": \"Hi everyone,\\nI was trying to do my first programming exercise in python course. Following are my observations/comments,\\nq0 - If you use capital letters in writing name of the color , for example \\\"Blue\\\" it is saying incorrect but the correct answer is \\\"blue\\\". May be explicitly it needs to be mentioned in the question that write in small letters or account for it in the code of q0.check()\\nq1 - (applicable for python version less than 3) In the solution it is given that, radius=diameter/2 but I would prefer the solution to be radius=diameter/2.0\", \"answers\": []}, {\"question\": \"I don't understand that how it works , like those functions q1.check() or any other similar functions written there because code is running without them\", \"answers\": []}, {\"question\": \"Good Course~\", \"answers\": []}, {\"question\": \"Solution for : ''blackjack_hand_greater_than(hand_1, hand_2):''\\ndef blackjack_hand_greater_than(hand_1, hand_2):\\n\\\"\\\"\\\"\\nReturn True if hand_1 beats hand_2, and False otherwise.\\nIn order for hand_1 to beat hand_2 the following must be true:\\n- The total of hand_1 must not exceed 21\\n- The total of hand_1 must exceed the total of hand_2 OR hand_2's total must exceed 21\\n\\nHands are represented as a list of cards. Each card is represented by a string.\\n\\nWhen adding up a hand's total, cards with numbers count for that many points. Face\\ncards ('J', 'Q', and 'K') are worth 10 points. 'A' can count for 1 or 11.\\n\\nWhen determining a hand's total, you should try to count aces in the way that \\nmaximizes the hand's total without going over 21. e.g. the total of ['A', 'A', '9'] is 21,\\nthe total of ['A', 'A', '9', '3'] is 14.\\n\\nExamples:\\n>>> blackjack_hand_greater_than(['K'], ['3', '4'])\\nTrue\\n>>> blackjack_hand_greater_than(['K'], ['10'])\\nFalse\\n>>> blackjack_hand_greater_than(['K', 'K', '2'], ['3'])\\nFalse\\n\\\"\\\"\\\"\\n\\n\\n\\ndef tot(hand):\\n    total=0\\n    ntotal=0\\n    for i in hand:\\n        if i.isnumeric():\\n            if int(i) in range(1,11):\\n                total=total+int(i)\\n\\n\\n    for i in hand:\\n        if i in ['J','Q','K']:\\n            total=total+10\\n        if i=='A':\\n            if total+11>21:\\n                total=total+1\\n            else:\\n                total=total+11\\n    return(total)\\n\\nh1=tot(hand_1)\\nh2=tot(hand_2)\\n\\nif h1>21:\\n    return False\\nelif h2>21:\\n    return True\\nelse:\\n    return h1>h2\\nCheck your answer\\nq3.check()\", \"answers\": []}, {\"question\": \"error : maximum recursion depth exceeded\\ni was not able to solve so even when i run solution provided i am getting error\", \"answers\": [\"Hi @ajjutiwari\\nCan you exactly point out where you are facing this issue?\\nUsually, if you make any recursive call and there is no proper stopping condition, causing infinite recursion, you'll get such kind of error.\"]}, {\"question\": \"Hi! I am struggling with Question 4 on the Loops and List Comprehensions exercise. Could you share the code to get the solution possibly? Thanks!\", \"answers\": []}, {\"question\": \"I'm so thankfull for Kaggle contribution on our owndevellopment , i used to R but now i benefit Pyton !!!!!\\ni've get problemes to my turn , exercises are really not very clear. maybe you may devellope !\", \"answers\": []}, {\"question\": \"it may will sound silly but I dont know how to do the blackjack excercise (number 7) in the booleans and conditionals lesson\\u2026 any tip?\", \"answers\": [\"Hi little Fausto, it's not silly at all! I'd suggest you drop the seventh point, because it will be asked to do the same later, so don't worry for now about that \\ud83d\\udc4c\"]}, {\"question\": \"Great content!\", \"answers\": []}, {\"question\": \"hi guys,\\nI'm having trouble w/ the following code, please help.\\nI enter:\\ndef rp(num):\\nreturn round(num, 2)\\nprint(rp)\\nAnd I get this message in the output: function rp at 0x00000162C8FCA60 (imagine these characters (< >) at both ends respectively,\\nwhat am I doing wrong?\\u2026..\", \"answers\": [\"hey jgreenwo34,\\nYou need to consider two thing in order to make your code working:\\n1.\\nwhen you are defining a function, remember that after the instruction def function_name(parameter), you need to indent each line of your function. You can choose between backspace and tab to indent. In your case, you have only a single line in the definition of your function, so:\\ndef rp(num):\\n return round(num, 2)\\n2.\\nIf you want to call your function, you have to choose an argument. If the argument is 20:\\nnum = 20\\nprint(rp(num))\\nor, if you prefer:\\nprint(rp(20))\"]}, {\"question\": \"hi guys,\\nI'm having trouble w/ the following code, please help:\\ndef rp(num):\\nreturn round(num, 2)\\nprint(rp)\\nAnd I get this message in the output:\\nwhat am I doing wrong?\\u2026..\", \"answers\": []}, {\"question\": \"Thanks\\u2026the python course to this point is helpful and great.\", \"answers\": []}, {\"question\": \"Thanks for the courses. Very helpful \\ud83d\\udc4d\", \"answers\": []}, {\"question\": \"Where should I report typos so that they can get fixed? I found a typo in the Functions and Getting Help notebook. In the getting help section, it says\\nIf you can remember how to use help(), you hold the key to understanding most other function.\\nI think it should say\\nIf you can remember how to use help(), you hold the key to understanding most other functions.\", \"answers\": []}, {\"question\": \"Hi there, I am just curious on what are some of the highest win rates you have achieved for the simplified version of blackjack (aka twenty-one) at https://www.kaggle.com/kernels/fork/1275165\\nIs there an interesting strategy you can share? I am using a simple one that looks at the player_total points before making a decision to hit or stop which gives me around 40% win rate from 50K simulated games \\ud83d\\ude03\", \"answers\": [\"I am around 40% too\"]}, {\"question\": \"hello!!\\ni had a great challenge yesterday trying to complete the machine learning exercise\\u2026.\\nhe notebook was not responding\\u2026.\\nany help???\", \"answers\": []}, {\"question\": \"While I did find the course useful I it could be expanded a bit. Just seemed a little too short.\", \"answers\": []}, {\"question\": \"Hello!\\nCan someone pls help me understand how can I see the output of exercises? For example 'Exercise: Functions and getting help' question 4 (optional). I corrected the code and its no longer showing error but the output is not shown. How do I check the result? Also, I wanted to run some of the examples in the tutorial but the same. When I run is no errors are thrown but no output window. Thanks!\", \"answers\": []}, {\"question\": \"Hi! I am stuck at estimate_average_slot_payout(n_runs) function of this course at \\\"Loops and List comprehensions\\\". I have written the following code but it is not giving any output while running it. Could anyone please tell me what I am doing wrong here or what the correct way of doing it is?\\ndef estimate_average_slot_payout(n_runs):\\n\\\"\\\"\\\"Run the slot machine n_runs times and return the average net profit per run.\\nExample calls (note that return value is nondeterministic!):\\n>>> estimate_average_slot_payout(1)\\n-1\\n>>> estimate_average_slot_payout(1)\\n0.5\\n\\\"\\\"\\\"\\nprofit = 0\\nfor i in range(n_runs):\\nprofit = profit + play_slot_machine() - 1\\navg_payout = profit / n_runs\\nreturn avg_payout\\n*The indentations are correct in the actual code. *\", \"answers\": [\"Hi\\nAt the end of each cell, you will find something like qN.check(). This function call is basically responsible to check your solution and thus, producing an output.\\nIn this particular cell, there is no call to qN.check() which is why you are not getting an output.\\nWhat you can do is add a print statement and call the estimate_average_slot_payout function several times with varying values for n_runs and experiment a bit regarding what average value you are receiving.\\nI hope this answers your question. Best wishes :)\", \"Thank you very much!\\nYour comment did answer my question.\", \"You're welcome :)\"]}, {\"question\": \"Hey, I loved this course because of how short information is gathered, just got a quest:\\nOn exercice 3. of \\\" Working with External Libraries\\\", shouldn't the sum of cards be done by order, since the cards come sequencially? I was trying to do it that way, which made me not sum aces on end, and getting a bit confused because of situations where the game would end before it reached certain card; or I must consider that the list is not ordered by play time?\\nAppreciate any answer, I've never played Blackjack, so I'm learning with this course >.<\", \"answers\": []}, {\"question\": \"Hey folks!\\nI am facing a bit difficulties in understanding problem 3 and 4 of Exercise on Loops and List Comprehension; I look forward for some more guidance and help!!!\\nMy queries:\\nproblem 3:\\nif meals[i] == meals[i+1]:\\nreturn True\\nDoes this mean to return true for those cases where number of repetition of particular meal item is more than once?\\nFor i being the number of times a item is served\\nproblem 4:\\nI want to get some hint on which functions are used for the solution or where to begin\\nAny help provided will be greatly appreciated!!\\nThank you !!!\", \"answers\": [\"Hey, how's it going? I'll try to help you based on what I understood of the problems.\\n3. It returns true if a meal is the same as it's next one, so you're checking if there's a repetition sequentially , 1 after another and only that.\\ni is the index of the list, the position of the meal on that list, so.\\n4. Your aim is to calculate the average payment of each play on the slot machine, so all you have to do is \\\"play on the slot machine\\\" n_runs times and calculate the average value of the spins you took. To check the result, you may print out the call of a function with a number of times you wish, the more, the better. Once you got it running, check solution for comparison.\\nHope I could help you, if you still have any doubts say, I explained 4. more on what you have to do, assuming you'll know how to call the functions.\\nGl hf , let me know the results \\ud83d\\ude09\", \"Thank you for your reply!!!\\nI understood the explanation for 3rd one, but there what if I repeat meal not subsequently but after some interval; and for 4th one of my doubt even on how to check whether my codes is right or not? (as there's no marking for that particular one) And what variables are in that class!!\\nYour explanation helped\", \"Glad I did ^^\\n3 -> It has to do with the context, the idea of the exercice was that, although it's ambiguous, and I had the same problem on figuring it out.\\n4 -> In terms of syntax - if you want to know if runs - debug is enough. In terms of solution, I believe you want to know the value, as I said, you must print it and then check if it's same as the one shown in the solution.\\nWhat you mean by \\\"what variables are in that class\\\" ? Which class?\"]}, {\"question\": \"Hello!\\nI am trying to solve exercise 3 on lesson 7.\\nAfter I have apmlyied a code to calculate the points in hand1 (hand1_total) and hand2 (hand2_total), I applied this code to find the winner:\\nif hand1_total > hand2_total and hand1_total <= 21: return True elif hand1_total < hand2_total and hand2_total > 21: return True else: return False\\nAnd still the check() message is that:\\nIncorrect: Expected return value of False given hand_1=['6', '2', '8', '10'], hand_2=['3', '4', 'Q', 'K', '6', '3'], but got True instead\\nBased on black jack rules the right answer should be True.\\nAny help on this please?\", \"answers\": [\"This comment was deleted.\"]}, {\"question\": \"The courses here are indeed awesome\", \"answers\": []}, {\"question\": \"the content is good\", \"answers\": []}, {\"question\": \"i completed the exercise, but it does not show on under courses the exercise circle turn into green. Is there a waiting period?\", \"answers\": [\"No it happens immediately. Did you recieve 'Correct' as answer in your asnwers?\"]}, {\"question\": \"Hello, does anyone have the answer code to the bonus question of the first excercise? This is the questions,\\nBonus: Can you code this in a way the minimizes the number of empty cells (while obeying the original constraints about 2x2 inches per image and no more than 16\\\" total width)? For example, a naive solution for n = 10 might create an 8x2 grid, meaning the bottom row would have only 2 images, and 4 empty spaces. A more clever solution would set rows = 2, and columns = 5.\\nThank you in advance!\", \"answers\": []}, {\"question\": \"Hello, were you able to access the exercise of the last chapter? That of working with external libraries. This is my screen when I open it. Would be great if someone could help me out here. Thanks in advance!\\nScreenshot 2020-09-22 at 02.16.07.png\", \"answers\": []}, {\"question\": \"if 0:\\nprint(0)\\nelif \\\"spam\\\":\\nprint(\\\"spam\\\")\\nCan anyone help me why it gives spam\", \"answers\": [\"\", \"Hi\\nIn Python, the integer 0 is considered as False and a non-empty string is considered as True when evaluated in a boolean expression, which is why the elif part gets printed here.\\nI hope this answers your question. Best wishes :)\"]}, {\"question\": \"Hi cook,\\nThe community objective looks good. Expecting big things.\\nThanks\", \"answers\": []}, {\"question\": \"For the third problem, the DocString is so confusing\", \"answers\": []}, {\"question\": \"The course provided me the basic idea about python. It was really helpful.\\ud83d\\udc4d\\ud83d\\udc4d\", \"answers\": []}, {\"question\": \"I\\u00b4m stuck in this exercise. Can you help me?\", \"answers\": [\"I believe your IF statement is the issue. You can't compare an index value to the length of a list. They are two different things. Index refers to a location. Length refers to the number of characters or in this case, the number of elements in the list. Here's the code I wrote.\\nnum_guests = len(arrivals)\\nmiddle = round(num_guests/2)\\n\\nif name in arrivals[middle:-1]:\\n    return True\\nelse:\\n    return False\"]}, {\"question\": \"42.5% winning rate in blackjack game (Python exercise 3)\", \"answers\": []}, {\"question\": \"I am new to programming language.\\ndef mod_5(x):\\n\\\"\\\"\\\"Return the remainder of x after dividing by 5\\\"\\\"\\\"\\nreturn x % 5\\nprint(\\n'Which number is biggest?',\\nmax(100, 51, 14),\\n'Which number is the biggest modulo 5?',\\nmax(100, 51, 14, key=mod_5),\\nsep='\\\\n',\\n)\\nIn this what is happening in \\\"WHICH NUMBER IS THE BIGGEST MODULO 5\\\" ?\", \"answers\": [\"The max() function returns the largest of the input values. 'key' is an optional parameter and refers to a single argument function to customize the sort order. The function is applied to each item on the iterable.\\nSo basically it works similar to a dictionary having keys 100, 51, 14, with corresponding % 5 as values and is sorted based on values to return the key with maximum % 5 value.\"]}, {\"question\": \"Is this the correct code for the should_hit function in the optional black jack activity? I get a win rate of 40%. The logic is is not complex. Maybe I'm missing something??? Or are the function's other arguments just there for the purpose of making this activity seem harder than it is??? Thanks!!!\\ndef should_hit(dealer_total, player_total, player_low_aces, player_high_aces):\\nif player_total >= 17:\\nreturn False\\nelse:\\nreturn True\", \"answers\": []}, {\"question\": \"Hello I've been uncommenting \\\"#q0.hint()\\\" for the tutorials. and I get an error stating it's undefined. very annoying.\\nWhat's going on?\", \"answers\": [\"You need to run the first line of code at the top of the exercices page.\"]}, {\"question\": \"Hi everyone, I would like to start by saying Thank you kaggle community for this amazing course.\\nSecond, I would like to have an opinion or a hint in a problem mentioned in Loops exercices section. It's related to Monte Carlo method which I'm not familiar with, as you can see in the picture below. Thanks once again.\", \"answers\": [\"I am not familiar with Monde Carlo Method either. I think it is about taking a set of random values. I would like to see the right answer on this one.\", \"Hi,\\nthe idea is pretty simple: you can simulate 1 run with the provided function play_slot_machine(), say you won $x, since it costs $1 for each play so the net outcome for this run should be $(x-1) and the avg outcome is (x-1)/1.\\nImplement the same idea for n_runs and you should be able to solve the problem.\", \"Hi Thanh Binh,\\nI tried this code:\\ndef estimate_average_slot_payout(n_runs):\\n\\\"\\\"\\\"Run the slot machine n_runs times and return the average net profit per run.\\nExample calls (note that return value is nondeterministic!):\\n>>> estimate_average_slot_payout(1)\\n-1\\n>>> estimate_average_slot_payout(1)\\n0.5\\n\\\"\\\"\\\"\\ni=0\\nL=[]\\nfor i in range(n_runs):\\nreturn(sum (L.append(play_slot_machine()-1)/n_runs))\\nestimate_average_slot_payout(1000)\\nBut I don't get any answer. Could you help me checkeing the code and tell what should I do to get the answer from the programm?\"]}, {\"question\": \"Hi,\\nI did complete this python course and its assignments. However, for 3rd and 7th lesson assignment, it keeps showing incomplete with certain percentage. I have checked, ran and re ran all sets of answers individually and together. It neither show any issues nor it updates/refreshes percentage completion. Has anyone faced similar issue? Any insight will be really helpful.\", \"answers\": [\"Have the sign 'Correct' appeared to each one of your answers?\", \"I also had the same problem, turns out I had missed a small subpart of a question in between. Carefully rerun all the cells for the incomplete assignments and make sure 'Correct' comes against all of the questions.\"]}, {\"question\": \"Very helpful course!\", \"answers\": []}, {\"question\": \"Hello, does anyone get this error when trying to access the 'Working with external libraries' questions? I have attached a screenshot for reference :)\\nScreenshot 2020-09-15 at 14.51.19.png\", \"answers\": []}, {\"question\": \"Hello, can I please get the answer for question 5 in the 'Loops and List comprehensions' exercise? Thank you in advance!\", \"answers\": [\"just an advice. post the picture of the question and your work (if possible), people are too lazy to go back to exercise. That way, you can easily get an answer.\\nThanks\", \"Hey Omar, thanks for that. Will do! Also, figured out the answer for this \\ud83d\\ude03\"]}, {\"question\": \"In Question number 3 of Strings and Dictionaries exercise, when I'm running the code-\\ndef multi_word_search(documents, keywords): keyword_to_indices = {} for keyword in keywords: keyword_to_indices[keyword] = multi_word_search(documents, keyword) return keyword_to_indices\\nI'm getting this error - RecursionError: maximum recursion depth exceeded\\nI'm new to pyhton so having hard time understanding this\", \"answers\": [\"Hi\\nBasically in this line -> keyword_to_indices[keyword] = multi_word_search(documents, keyword), you are causing a recursive call. The recursive call keeps on continuing since you haven't specified any stopping condition. Python, by default, has a recursion limit, and once that limit is reached it throws an error saying that you've reached a maximum recursion depth.\\nSo, the issue here is that you are calling the wrong function. You are supposed to call the function word_search(documents, keyword) instead of the function multi_word_search(documents, keyword).\\nI hope this helps you. Best wishes :)\"]}, {\"question\": \"hi,\\nI did complete this python course and its assignments. However, for 3rd and 7th lesson assignment, it keeps showing incomplete with certain percentage. I have checked, ran and re ran all sets of answers individually and together. It neither show any issues nor it updates/refreshes itself. Any insight will be really helpful.\\nscreenshot attached : py_ws.png\\nhttps://www.kaggle.com/supplejade/exercise-booleans-and-conditionals\\nhttps://www.kaggle.com/supplejade/exercise-working-with-external-libraries\\nThanks.\\npy_ws.png\", \"answers\": []}, {\"question\": \"When I run the following, it doesnt show any output or error. Could someone help?\\nx = -10\\ny = 5\\n# Which of the two variables above has the smallest absolute value?\\nsmallest_abs = min(abs(x),abs(y))\", \"answers\": [\"You need to print the variable 'smallest_abs', to get the output.\\nafter - smallest_abs = min(abs(x),abs(y))\\nadd a print statement to print the contents of variable 'smallest_abs'\\nHope it helps!\", \"Thanks Shobhit. Missed the obvious.\"]}, {\"question\": \"Hello,\\nA new Kaggle Learner here,\\nI want help in the Q.7 (Optional) of the Chapter 3. Booleans and Conditionals. I am simple not able to understand what do I need to do. Can someone help me or point me in the right direction?\", \"answers\": []}, {\"question\": \"New to Python, was trying this code and im getting an Indentation error. Can someone help guide.\\n<>\\ndef f(x):\\ny = abs(x, /)\\nreturn y\\nprint (f(10))\\\"\\n<<Error Message >>\\ny = abs(x, /)\\n^\\nIndentationError: expected an indented block\", \"answers\": [\"@ankrulz2004 The function is written as follows\\ndef f(x):\\ny = abs(x)\\nreturn y\\nYou need to give indentation after def.\\nHope it helps you.\"]}, {\"question\": \"For the Python exercise on Booleans and Conditionals , I accidentally deleted Question 3. Is there a way to undelete?\\nI tried to reset, but Question 3 does not pop up?\", \"answers\": [\"There could be an easy way, but this has worked for me;\\nlogout from your kaggle or open another browser(recommended) ,go to kaggle course and choose the specific exercise you're looking for, drill down to the questions 3, and there its. don't login. just browse. copy and paste the question into your kernell.\\nhope that helps\"]}, {\"question\": \"Today, I tried to solve the exercises on Lesson 5 \\\"Loops and list comprehensions\\\". For some reason, the check() function gave the results from a previous exercise sheet. Did this happen to anyone else?\", \"answers\": []}, {\"question\": \"Hi guys,\\nI solved the last question from (exercise:lists) as follows:\\ndef fashionably_late(arrivals, name):\\n\\\"\\\"\\\"Given an ordered list of arrivals to the party and a name, return whether the guest with that\\nname was fashionably late.\\n\\\"\\\"\\\"\\nordre = arrivals.index(name)+1\\nreturn ordre >= len (arrivals)/2 and ordre != len(arrivals)\\nI got this comment:\\nIncorrect: Expected return value of False given arrivals=['Adela', 'Fleda', 'Owen', 'May', 'Mona', 'Gilbert', 'Ford'], name='May', but got True instead.\\nthe q5.solution was as follows:\\nSolution:\\ndef fashionably_late(arrivals, name):\\norder = arrivals.index(name)\\nreturn order >= len(arrivals) / 2 and order != len(arrivals) - 1\\nhowever in the exercice statement it is said : For example, the following list represents a party with 7 guests, in which Adela showed up first and Ford was the last to arrive:\\nparty_attendees = ['Adela', 'Fleda', 'Owen', 'May', 'Mona', 'Gilbert', 'Ford']\\nIt is clear that Adela's order is one, however according to the solution given in Kaggle, Adela's order is 0\\ncan someone explain what is wrong in my code, and why is Kaggle code dorrect ?\\nthanks in advance.\", \"answers\": [\"Your logic should work with this change:\\nordre = arrivals.index(name)+1\\nreturn ordre > round(len (arrivals)/2) and ordre != len(arrivals)\\nso if there are 7 persons, 7/2 is 3.5. But you want to round up to be 4, and exclude the 4th.\\nparty_attendees = ['Adela', 'Fleda', 'Owen', 'May', 'Mona', 'Gilbert', 'Ford']\\nonly Mona and Gilbert are fashionable late.\"]}, {\"question\": \"Hi!\\nI'm a complete beginner so please bear with me..\\nI'm trying to understand loops in Python and in the beginning of the lesson there is this code:\\nmultiplicands = (2, 2, 2, 3, 3, 5)\\nproduct = 1\\nfor mult in multiplicands:\\nproduct = product * mult\\nproduct\\nWhat's the purpose of \\\"product=1\\\"? Is it to start the iteration by multiplying 1x2? Thank you!\", \"answers\": [\"The product here , is just multiplier. change product = 2 or to another number greater than 1, and it will make sense. in another words, the 'product' is just a variable that holds 1, a multiplier.\\nof course, you can use the multiplier direct, without assigning to a variable, but the whole point here is to learn how to work with variables.\\nhope that helps.\", \"Thank you! It does help\"]}, {\"question\": \"Hi everyone, I am new to python and I find my kaggle kernel didn't work when finishing exercise 1, it can't even finishing the print method. Is there anything I missed? Thank you!\\n2020-09-11 3.19.39.png\", \"answers\": []}, {\"question\": \"can't get hint or solloution after removing #\", \"answers\": []}, {\"question\": \"Hey everyone, can someone write the code regarding question 7 in Booleans and Conditionals exercice.\\nthanks in advance\", \"answers\": [\"def should_hit(dealer_total, player_total, player_low_aces, player_high_aces):\\n\\\"\\\"\\\"Return True if the player should hit (request another card) given the current game\\nstate, or False if the player should stay.\\nWhen calculating a hand's total value, we count aces as \\\"high\\\" (with value 11) if doing so\\ndoesn't bring the total above 21, otherwise we count them as low (with value 1).\\nFor example, if the player's hand is {A, A, A, 7}, we will count it as 11 + 1 + 1 + 7,\\nand therefore set player_total=20, player_low_aces=2, player_high_aces=1.\\n\\\"\\\"\\\"\\nif player_total < 15:\\nreturn True\\nelse:\\nFalse\\nThe code above is just a simple way to increase the win rate, if you want to dig deeper into more sophisticated solutions, this is a good thread: https://www.kaggle.com/learn-forum/58735\"]}, {\"question\": \"Hi everyone , does anyone have a solution for the question 7 in the course Booleans and Conditionals\", \"answers\": []}, {\"question\": \"Even after completing working with external libraries exercise it shows 67 percent .Can someone help with this\", \"answers\": [\"@poojapalod21 There must be something left. You can refresh and check again \\ud83d\\ude0a.\"]}, {\"question\": \"Hello, I am confused why isn't this working.\\nThen I tried Kaggle's answer and it is still outputting error. Thank you for your help :)\", \"answers\": [\"hi Samuel! q1.check() has the sole purpose to check if your function is working correctly, and it doesn't need any argument. If you want to check the ouput of the function you wrote for some numbers, comment q1.check() and call the function: round_to_two_places(3.544343)\"]}, {\"question\": \"In \\\"Exercise: Strings and Dictionaries\\\" I had issues with this question:\\n`def word_search(doc_list, keyword):\\nkeywordlist = []\\nfor i in range(len(doc_list)):\\ntmp = doc_list[i].split()\\nfor j in tmp:\\nif (j.lower() == keyword) or (j.lower() == keyword + '.') or (j.lower() == keyword + ','):\\nkeywordlist.append(i)\\nreturn keywordlist\\nCheck your answer\\nq2.check()`\\nIn web ide it returns [0, 0, 0], the answer should be [0]. I checked my code in VSCode and it returns just [0]. Am i doing something wrong?\", \"answers\": [\"Add break after your append to break from the loop once an instance of the word is found in the sentence.\\nif (j.lower() == keyword) or (j.lower() == keyword + '.') or (j.lower() == keyword + ','):\\nkeywordlist.append(i)\\nbreak\"]}, {\"question\": \"Hello, I think there is an error in the last question of the topic string and dictionary, I followed the solution given but error still occurred, can someone help me?\", \"answers\": [\"I have just done it, and it works ok. Can you show your code?\", \"Here is the code and the error msg:\\ndef multi_word_search(doc_list, keywords):\\n\\\"\\\"\\\"\\nTakes list of documents (each document is a string) and a list of keywords.\\nReturns a dictionary where each key is a keyword, and the value is a list of indices\\n(from doc_list) of the documents containing that keyword\\n>>> doc_list = [\\\"The Learn Python Challenge Casino.\\\", \\\"They bought a car and a casino\\\", \\\"Casinoville\\\"]\\n>>> keywords = ['casino', 'they']\\n>>> multi_word_search(doc_list, keywords)\\n{'casino': [0, 1], 'they': [1]}\\n\\\"\\\"\\\"\\nkeyword_to_indices = {}\\nfor keyword in keywords:\\n    keyword_to_indices[keyword] = word_search(doc_list, keyword)\\nreturn keyword_to_indices\\npass\\nCheck your answer\\nq3.check()\\nIncorrect: When calling your function with arguments [['The Learn Python Challenge Casino', 'They bought a car', 'Casinoville?'], ['casino']], Python raised the following exception\\u2026 NameError: name 'word_search' is not defined\"]}, {\"question\": \"Thank you very much!\", \"answers\": []}, {\"question\": \"Thank you very much!\", \"answers\": []}, {\"question\": \"thanks kaggle\\u2026\", \"answers\": []}, {\"question\": \"Hi, I'm having trouble with getting my to course 100% on the Lists exercise (it's at 80%). I think this is because the q5.check() method is not working. Has anyone else had this problem?\\nHere's the code and the error message:\\ndef fashionably_late(arrivals, name):\\n    order = arrivals.index(name)\\n    return order >= len(arrivals / 2 and order != len(arrivals) - 1\\n\\n# Check your answer\\nq5.check()\\n  File \\\"<ipython-input-47-5919e0f94790>\\\", line 6\\n    q5.check()\\n     ^\\nSyntaxError: invalid syntax\", \"answers\": [\"Hi Luke,\\n1) pasting your code, a strange **dot **symbol appeared, you should delete it:\\n2) You forget a round bracket in len(arrivals / 2\", \"Perfect. Thanks so much!\"]}, {\"question\": \"def estimate_average_slot_payout(n_runs):\\n    \\\"\\\"\\\"Run the slot machine n_runs times and return the average net profit per run.\\n    Example calls (note that return value is nondeterministic!):\\n    >>> estimate_average_slot_payout(1)\\n    -1\\n    >>> estimate_average_slot_payout(1)\\n    0.5\\n    \\\"\\\"\\\"\\n    pass\\nStuck in the Loops and List Comprehensions last coding challenge question. The code for which is mentioned above. I don't understand how to implement this. Can someone help me out?\", \"answers\": [\"Salve Diksha,\\nyou have a working function called play_slot_machine(), whose output is your winnings in dollars after playing slot machine a single time.\\nWhat you have to do is to create a function which is able to automatically play the slot machine a number n_runs of times. Then, this function must calculate the average of all outcomes.\\nA good idea could be this: you make the sum of all outcomes you get after running play_slot_machine() a number n_runs of times. You can use a **for **cycle in order to make this sum and to store it in a proper variable. Then, you have to divide this sum for the number n_runs.\\nLet me know, have fun :)\", \"I completely forgot about the play_slot_machine() function\\u2026the thing is that I read the Monte Carlo method thing and I wandered off in a different direction. Thanks for your answer :)\"]}, {\"question\": \"Can anybody please explain me on How to Submit the exercise of \\\"Hello Python\\\" course\\nI tried many things, but can't see a right tick mark on the page of the course neither my progress percent increased\\nIs there anything else required to do except these things:\\nClicking on Save version (and then trying both \\\"Quick Save\\\" & \\\" Save and Run all\\\" individually)\\nClicking on Download button of the files menu\\nShare\\nOr they like auto check these\", \"answers\": [\"Hi Bhargav,\\npoint 1. is enough. Maybe you are encountering some problems with cookies or something like that. But Save version should be enough in order to finish the exercise (assuming everything is correct).\"]}, {\"question\": \"planets = ['Mercury', 'Venus', 'Earth', 'Mars', 'Jupiter', 'Saturn', 'Uranus', 'Neptune'] for planet in planets: print(planet, end=' ') # print all on same line\\nmultiplicands = (2, 2, 2, 3, 3, 5) product = 1 for mult in multiplicands: product = product * mult product\\nHow do we know what to call the entries of the list or tuple. Like in the first code, the entries of the list planets are called 'planet' and in the second code the entries of the tuple multiplicands are called 'mult'.\\nCan someone guide.\", \"answers\": []}, {\"question\": \"I have a question referring to last exercise of loops and list comprehensions:\\nhas something been changed in the play_slot_machine()'s code like the win rate has been reduced?\\nmy avg outcome isnt even near 0.025.\\nhere is my code:\\ndef estimate_average_slot_payout(n_runs):\\n\\\"\\\"\\\"Run the slot machine n_runs times and return the average net profit per run.\\nExample calls (note that return value is nondeterministic!):\\n>>> estimate_average_slot_payout(1)\\n-1\\n>>> estimate_average_slot_payout(1)\\n0.5\\n\\\"\\\"\\\"\\nwin = 0\\nfor i in range(n_runs):\\na = play_slot_machine()\\nwin =+ a\\nreturn (win-n_runs)/n_runs\\nestimate_average_slot_payout(1000000)\", \"answers\": [\"need to subtract $1 cost per play.\\ndef estimate_average_slot_payout(n_runs):\\nreturn (sum([play_slot_machine() - 1 for run in range(n_runs)]) / n_runs)\"]}, {\"question\": \"Hi all! Having gone through the Boolean and conditionals I got stuck with the blackjack exercise.\\nthe condition that one needs to apply to account for the different values (either 11 or 1) of Aces cards is proving to be difficult to resolve. Assistance with this will be highly appreciated. . .\", \"answers\": []}, {\"question\": \"Hi all! Having gone through the Boolean and conditionals I got stuck with the blackjack exercise.\\nthe condition that one needs to apply to account for the different values (either 11 or 1) of Aces cards is proving to be difficult to resolve. Assistance with this will be highly appreciated. . .\", \"answers\": []}, {\"question\": \"The course lecture has used 'print' command to take output from Conditional statement inside of a user-defined function, but when I do the same in the practice exercise, it says that 'return' command should be used to take output instead of 'print' command.\\nCan someone help why is that so?\\nP.S: Pictures attached below.\\nimgonline-com-ua-twotoone-4jGzEBuEAQQ6P.jpg\", \"answers\": [\"As beginner, you shouldn't worry too much about the difference between print and return in a function. for your case now, the error you getting is due to how they programmed the exercise. The answers for practices questions are already predetermined answers that the instructors have programmed, and they want to challenge the students to get the exact answers.\\nhope that helps\", \"Maybe the error is in the Print statement, Remove space between print and ().\\nprint(\\\"Correct\\\")\\nprint (\\\"Wrong!\\\")\", \"The error persists even then, but if I replace all 'print' commands with 'return' commands, the code runs fine. Perhaps what Omar Abidi is saying is the only reason that justifies this behaviour of the program.\"]}, {\"question\": \"**Can someone help me with this error? I am not able to comprehend it. Thanks.\\nRefer to attached picture for my query.**\\nQuery.PNG\", \"answers\": [\"you have indent issue; the \\\"return\\\" should be within the function scope\\nso the solutions is ; have the 'return' in the same indent with y = abs(x)\\n**see the attachment\\nhope that helps.\\nsoln.PNG\", \"That was indeed the error. Thank you!\"]}, {\"question\": \"Hey Kaggler's did anyone tried this strategy.\\nI got 41.1% wins with this strategy.\\ndef should_hit(dealer_total, player_total, player_low_aces, player_high_aces):\\n\\n    if player_total <= 13:\\n        return True\\n\\n    if player_total == 14 or player_total == 15 or player_total == 16:\\n        if dealer_total == 5 or dealer_total == 6:\\n            return False\\n        return True\\n\\n    if player_total == 17:\\n        if dealer_total == 11 or dealer_total == 1:\\n            return True\\n        return False\\n\\n    return False\\nkaggle_blackjack_strategy.JPG\", \"answers\": []}, {\"question\": \"This is regarding \\\"Exercise: Loops and List Comprehensions\\\"\\nQuestion 1: Try to identify the bug and fix it in the cell below\\nA more refined answer should be:\\ndef has_lucky_number(nums):\\nreturn any([num % 7 == 0 and num != 0 for num in nums])\\nIf the above answer is wrong (as 0 % 7 =0 hence 0 also being the lucky number) then still passes the correct status if executed on kaggle. I guess bug in q1.check() ?\", \"answers\": []}, {\"question\": \"Loops and Lists Exercise 3. Menu_is_boring\\nAs an alternate question for a bit of practice I altered the conditions of the question and defined the menu is boring if the same meal was served more than twice in the period, regardless of when it was served. I came up with the following code that worked as a solution.\\n\\nNow some would probably disagree it would be boring to have ice-cream served twice.\\nHas anyone else done this and altered the question to create a new challenge for pracitce purposes ? If so please share.\", \"answers\": []}, {\"question\": \"Hi i don't know how to do exercises can you help me each time i want to run the cell some errors creep into cells\", \"answers\": [\"do post the screenshot of the error that is occuring\"]}, {\"question\": \"Hey everyone how do we change the ylim()\\u2026\", \"answers\": [\"ylim(bottom, top)\\ngraph.ylim(bottom = 1)\\nDo share the ss for any other help or you can go through my notebooks.\\nhttps://www.kaggle.com/shubrajain99/exercise-working-with-external-libraries\\nDo upvote if it helps\\ud83d\\ude0a\"]}, {\"question\": \"Hi everyone i am new to this \\ud83d\\ude0a\\ud83d\\ude0a\\ud83d\\ude0a but i have almost completed python course\\u2026Thanks Kaggle for making the best python crash course\", \"answers\": []}, {\"question\": \"In the \\\"Exercise: Booleans and Conditionals\\\" -> \\\"7. \\ud83c\\udf36\\ufe0f (Optional)\\\" -> Black Jack Question\\nI used one simple line and got >40% win rate.\\nreturn True if player_total < 12 and player_high_aces == 0 else False\\nIf anyone knows a better win rate solution than this, feel free to comment here \\ud83d\\ude00.\", \"answers\": []}, {\"question\": \"Hi I have query on Q5 from List exercise, when i try to assign values to the lists and try to print output i am getting error, following is the code.\\narrivals = [1,2,3,4,5,6,7]\\nname = ['Adela', 'Fleda', 'Owen', 'May', 'Mona', 'Gilbert', 'Ford']\\nfashionalbly_late_members = fashionably_late(arrivals, name)\\nprint(fashionalbly_late_members)\\nPlease let me know if my understanding is wrong.\", \"answers\": []}, {\"question\": \"Hi i have query on Question 5 from List exercise, which is as below.\\nIf i try to assign the values in the lists and try to print output, i am getting error.\\narrivals = [1,2,3,4,5,6,7]\\nname = ['Adela', 'Fleda', 'Owen', 'May', 'Mona', 'Gilbert', 'Ford']\\nfashionalbly_late_members = fashionably_late(arrivals, name)\\nprint(fashionalbly_late_members)\", \"answers\": []}, {\"question\": \"Useful course,\", \"answers\": []}, {\"question\": \"Helped in refreshing python skills in short time.\", \"answers\": []}, {\"question\": \"Need help on the Python Casino Challenge. I didn't understand any of it.\", \"answers\": []}, {\"question\": \"Tough but very helpful course.\", \"answers\": []}, {\"question\": \"This is really good!\", \"answers\": []}, {\"question\": \"Hi,\\nEven though I've completed all exercises in Boolean and Conditionals chapter in Python Tutorials, including the optional exercise, the exercise completion percentage is showing only 75%. What could be the issue here?\", \"answers\": [\"@tharapr\\ntry clicking the run all button on the left top\", \"@tharapr did it work?\"]}, {\"question\": \"def multi_word_search(doc_list, keywords):\\nkeyword_indices={}\\nfor keyword in keywords:\\nkeyword_indices[keyword]= word_search(doc_list,keyword)\\nreturn keyword_indices\\nMy code is not giving any output\", \"answers\": [\"@salonimiharia\\ni think the problem is with wordsearch since in the previous question you solved in that exercise the function was defined with the name word_search\\nand in the end check if q*.check() is present.\\nI hope this solves your problem. :)\\nInform me if it helps.\", \"@priyanshdragonheart ty it helped\", \"@salonimiharia\\nyour welcome.\"]}, {\"question\": \"Hi All,\\nIs this result looking right? Why \\\"q1\\\" is not defined?\\nNameError Traceback (most recent call last)\", \"answers\": [\"Have you run the first lines of codes to import all the necessary stuff?\"]}, {\"question\": \"I have an with exercise number 4 in exercise-loops-and-list-comprehensions. How many times I do the coding the program is not completed. If I run q4.solution() its not giving whether I am Correct or Incorrect. I am not able to pass the exam. Pls help me\", \"answers\": [\"@sravanmaheshdesai\\njust type after the pass\\nq4.check()\"]}, {\"question\": \"Hi,\\nCould anyone help me with this question?\\nI'm curious about my answer of Exercise: Loops and List Comprehensions 2.b\\nmy code:\\n    for i in L:\\n        if L[i] > thresh:\\n            L[i] = True\\n        else:\\n            L[i] = False\\n    return L\\nAnd this is the comment i got :\\nExpected return value of [False, False, True, True] given L=[1, 2, 3, 4], thresh=2, but got [False, False, 3, True] instead.\\nI don't get it why there's a \\\"3\\\" in the list.\\nI'll be grateful for anyone who can tell me my problem!\\nThank u!!!\\ud83d\\ude4f\\ud83d\\ude4f\\ud83d\\ude4f\", \"answers\": [\"@poeteller\\nfor i in range (len(L)):\\nif L[i]>=thresh:\\nL[i]=True\\nelse:\\nL[i]=False\\nreturn L\\nI hope this will solve your problem\", \"Your main issue here is you are using i as an index to L, where the python code 'for i in L' goes through the list L and sets i to each value in the List.\\nPriyansh shows the correct way here to get an index i which can be used to go through the List as an index.\\nso:\\nfor i in range(len(L))\\ni = 0,1,2,3\\nfor i in L\\ni = 1,2,3,4 (all the values in the List L)\\nHere is the long explanation if your interested (feel free to ignore if it is too much, but I was curious):\\nSo the issue is your index is going one step beyond where you would like, which is one problem, but then it is updating the value in that index and then it is stepping to the next position and getting the value that you updated as the new index. Many weird things happen as a result. First you go to index 1 (second position in the List) and update it with False, then you step to the next value in the list, which you just updated as False and use it as an index. Using False as an index goes to position 0 in the List you get 1 here and update position 0 as False. Then you go to the next position in the List and get 3, look it up you get 4 which lets you update position 3 in the list to True. Now you got to the last position in the List and you get the value you just updated to True (you are lucky here that you overwrote the 4 or the index would be beyond the List and you might get a memory error). So it goes to index True, which is 1 and gets False as the value in the list, then overwrites the value to False again. It never gets to index 2, because the List is getting overwritten as it is going through the for loop, so the value there remains 3.\\nThis may be a confusing explanation, so here is the debug code and output. This may make more sense:\\nL = [1,2,3,4]\\nthresh = 2\\nfor i in L:\\n    print (\\\" my index is \\\",i, \\\" the value is \\\", L[i])\\n    if L[i] > thresh:\\n        L[i] = True\\n        print (\\\"replace index \\\", i, \\\"with True\\\\n\\\" )\\n    else:\\n        L[i] = False\\n        print (\\\"replace index \\\", i, \\\"with False\\\\n\\\" )\\nprint (L)\\nmy index is 1 the value is 2\\nreplace index 1 with False\\nmy index is False the value is 1\\nreplace index False with False\\nmy index is 3 the value is 4\\nreplace index 3 with True\\nmy index is True the value is False\\nreplace index True with False\\n[False, False, 3, True]\", \"This comment was deleted.\"]}, {\"question\": \"Can someone help me with the Blackjack problem?\\nI don't understand the language of the question it self\", \"answers\": []}, {\"question\": \"I don't think the explanation in the third module for 'True or True and False' is correct. Python evaluates the first expression only! Since the first expression is 'True', the rest of the expression is discarded. See https://docs.python.org/2/reference/expressions.html#boolean-operations\\nThe expression x or y first evaluates x; if x is true, its value is returned; otherwise, y is evaluated and the resulting value is returned.\", \"answers\": [\"The first priority goes to \\\"and\\\" and consider \\\"or\\\" so the result is correct.\", \"This was mind-boggling also for me. This really helped me to understand.\"]}, {\"question\": \"Hello there! In lesson#3 there's an example of a function 'inspect' (Input#8) and it works without any 'return', but in the first exercise when i've tried using the same to define sign function the code wouldn't run unless i use a 'return'. Why such an example? Same goes to Input#9 function 'f'.\", \"answers\": []}, {\"question\": \"Useful course\", \"answers\": []}, {\"question\": \"The course was very interesting and challenging. Also quite tough but nice!\", \"answers\": []}, {\"question\": \"I am having trouble understanding the output for this. Thanks!\\n>\\nif 0:\\nprint(0)\\nelif \\\"spam\\\":\\nprint(\\\"spam\\\")\\nOutput: spam\", \"answers\": [\"What is the code before the if statement?\\nBut for that piece of code the output will be spam because there is nothing being assigned to 0 or compared to 0, therefor the output should be 'spam'.\", \"The reason is this: 0 corresponds to truth value false (all other integers to true), the empty String \\\"\\\" corresponds to false (all other strings, eg \\\"Spam\\\", to true).\\nSo, the condition of the Elif branch is true and executed.\", \"@antonnymuiko Thanks! I get it now.\", \"The input in this case is 0. Thus 0 is printed as the output. If the input was spam the output would be spam as the if condition is skipped and the else condition is executed.\"]}, {\"question\": \"\", \"answers\": [\"you have typo in the first line -- it should be from learntools.core import binder and not learntoolsb\"]}, {\"question\": \"In the lesson 1 exercise, where we are importing some lib using this code-- (from learntools.core import binder; binder.bind(globals())\\nfrom learntools.python.exl import *\\nprint(\\\"Setup complete! You're ready to start question 0.\\\")). Running this gives an error --'ModuleNotFoundError: No module named 'learntools.python.exl''. Can somebody help me with what exactly is going wrong here?\", \"answers\": [\"Hi,\\nApparently you have a typo here. In line 2, you type learntools.python.exl , it should be learntools.python.ex1\"]}, {\"question\": \"Hi, when I run solutions of exercise programs, I get errors as\\nname 'q1' is not defined. Please help! Thanks\", \"answers\": [\"Maybe you forgot to run the setup code cell at the top of the excercise?\", \"This comment was deleted.\", \"Sometimes it takes a little bit longer for your Kaggle Kernels session to start. Wait for the dot on the status bar (containing the + icon, the power button icon, etc.) to turn green from yellow.\\nIf you executed the command line containing from learntools.core import binder; binder.bind(globals()) before the status sign turned green, the necessary tools for running these exercise programs would not be loaded. You can re-run this command line again and things should start working.\"]}, {\"question\": \"I too face the same issue\", \"answers\": []}, {\"question\": \"Is it just me or are the string/dictionaries solutions \\\"not covered\\\" by the material? The code is extremely terse and for a beginner it takes me 5-10 minutes just reading it to understand what they did.\", \"answers\": [\"i faced so.\", \"It would have been nice if the \\\"enumerate\\\" option was explained, and then that you can do stuff like this (my problem was that I never could understand how to call the \\\"str\\\" function(s).\\n\\\"normalized = [token.rstrip('.,').lower() for token in tokens]\\\"\\nIt is nice to know but out goes your confidence\\u2026\", \"Helpfull:\\nhttps://www.geeksforgeeks.org/enumerate-in-python/\"]}, {\"question\": \"Hi,i have gone through the solution of question no. 2 and 3 of strings and dictionaries.But still stuck with some problems.Can you help me to understand those solutions ,please\", \"answers\": [\"What exactly are your problems?\"]}]"